<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Client STS - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="agentconfig.stsclientedit"></a><h4>Client STS</h4>
<p>L'interface du client du service de jeton de s&#233;curit&#233; (STS) vous permet
de cr&#233;er et de configurer un client qui communique avec le service
de jeton de s&#233;curit&#233; d'OpenSSO pour obtenir un jeton de s&#233;curit&#233;. OpenSSO
fournit le m&#233;canisme permettant de cr&#233;er les types suivants d'agents clients de
STS&#160;:</p><dl><dt>Agent de d&#233;couverte</dt>
<dd><p>Permet de configurer un client d'agent de d&#233;couverte qui communique avec le service de d&#233;couverte Liberty pour obtenir un jeton de s&#233;curit&#233; Liberty. Cette configuration d&#233;finit les attributs permettant de s&#233;curiser les demandes Liberty envoy&#233;es par le client de d&#233;couverte &#224; l'extr&#233;mit&#233; de d&#233;couverte Liberty.</p></dd>
</dl>
<dl><dt>Agent du service de jeton de s&#233;curit&#233;</dt>
<dd><p>Permet de configurer un agent du service de jeton de s&#233;curit&#233; qui communique avec le service de jeton de s&#233;curit&#233; d'OpenSSO pour obtenir des jetons de s&#233;curit&#233; bas&#233;s sur des services Web. Cette configuration d&#233;finit les attributs permettant de s&#233;curiser les demandes d'approbation de services Web envoy&#233;es par le client STS &#224; l'extr&#233;mit&#233; STS.</p></dd>
</dl>
<p>Dans l'interface du client STS, vous pouvez effectuer les op&#233;rations suivantes&#160;:</p>
<ul><li><p>configurer les <a href="agentconfig.discoveryagentprofile.html">Attributs de l'agent de d&#233;couverte</a>&#160;;</p></li></ul>

<ul><li><p>Configurer les <a href="agentconfig.webservicestsedit.html">Attributs de l'agent du service de jeton de s&#233;curit&#233;</a></p></li></ul>

<br/>

</body>
</html>
