<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@14981-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=iso-8859-1">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Magasins de donn&eacute;es
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="datastore"></A><h2>Magasins de donn&eacute;es</h2>
<p><A NAME="indexterm-10"></A><A NAME="indexterm-11"></A>Un magasin de donn&eacute;es est une base de donn&eacute;es dans laquelle vous pouvez stocker des attributs utilisateur et des donn&eacute;es de configuration utilisateur. </p>
<p>Access Manager fournit un plug-in de r&eacute;f&eacute;rentiel d'identit&eacute;s qui se connecte &agrave; une structure de r&eacute;f&eacute;rentiel d'identit&eacute;s LDAPv3. Ce nouveau mod&egrave;le vous permet de consulter et de r&eacute;cup&eacute;rer les informations utilisateur Access Manager sans apporter de modification &agrave; votre base de donn&eacute;es utilisateur existante. La structure Access Manager int&egrave;gre les donn&eacute;es du plug-in de r&eacute;f&eacute;rentiel d'identit&eacute;s avec les donn&eacute;es d'autres plug-ins Access Manager afin de constituer une identit&eacute; virtuelle pour chaque utilisateur. Access Manager peut alors utiliser cette identit&eacute; universelle dans les processus d'authentification et d'autorisation au sein de plusieurs r&eacute;f&eacute;rentiels d'identit&eacute;s. L'identit&eacute; d'utilisateur virtuelle est d&eacute;truite lorsque la session de l'utilisateur prend fin.</p>
<p>Pour plus d'informations sur la cr&eacute;ation d'un magasin de donn&eacute;es et sur la configuration du plug-in de r&eacute;f&eacute;rentiel, reportez-vous &agrave; <A HREF="datastore.html#realm.idrepo">Cr&eacute;ation d'un magasin de donn&eacute;es LDAPv3</A>.</p>
<p>Si vous avez install&eacute; Access Manager en mode Domaines, vous pouvez configurer le SDK d'Access Manager pour g&eacute;rer les donn&eacute;es Directory Server. Reportez-vous &agrave;  <A HREF="amsdkrepo.html#amsdkrepo">Cr&eacute;ation d'un plug-in de r&eacute;f&eacute;rentiel Access Manager</A>.</p>
<A NAME="realm.idrepo"></A><h3><IMG border="0" alt="Procedure" src="graphics/procedure.gif">Cr&eacute;ation d'un magasin de donn&eacute;es LDAPv3</h3>
<ol><li><p><b><A NAME="indexterm-12"></A>S&eacute;lectionnez le domaine auquel vous souhaitez ajouter un nouveau magasin de donn&eacute;es.</b></p></li>
<li><p><b>Cliquez sur l'onglet Magasin de donn&eacute;es.</b></p></li>
<li><p><b>Cliquez sur Nouveau dans la liste des magasins de donn&eacute;es.</b></p></li>
<li><p><b>Entrez le nom du magasin de donn&eacute;es. </b></p></li>
<li><p><b>D&eacute;finissez les attributs du plug-in de r&eacute;f&eacute;rentiel LDAPv3. Pour une description des attributs, reportez-vous &agrave; <A HREF="realm.idrepoadd.html#realm.idrepoadd">Attributs du plug-in du r&eacute;f&eacute;rentiel LDAPv3</A>. </b></p></li>
<li><p><b>Cliquez sur Terminer.</b></p></li>
</ol>
<br />

</body>
</html>
