<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Informations document - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">

<a name="documentinfo"></a><p>R&#233;f&#233;rence&#160;: 820-4362</p>8.0<p></p><p>4150 Network Circle<br>Santa Clara,  CA 95054<br>U.S.A.</p><p>Copyright 2008 Sun Microsystems, Inc.</p><p>L'aide
en ligne de la console Sun<sup>TM</sup>OpenSSO&#160;8.0 fournit des informations sur les t&#226;ches
d'administration relatives au contr&#244;le d'acc&#232;s, aux services de f&#233;d&#233;ration et Web, et
propose des d&#233;finitions d'attribut pour les services par d&#233;faut d'OpenSSO.</p><p>Sun Microsystems, Inc.
d&#233;tient les droits de propri&#233;t&#233; intellectuelle relatifs &#224; la technologie incorpor&#233;e au
produit qui est d&#233;crit dans ce document. En particulier, et ce sans
limitation, ces droits de propri&#233;t&#233; intellectuelle peuvent inclure un ou plusieurs des
brevets am&#233;ricains ou des demandes de brevet en instance aux &#201;tats-Unis et
dans d'autres pays.</p><p>Droits soumis &#224; la l&#233;gislation am&#233;ricaine &#8211; Logiciel commercial. Les
utilisateurs du gouvernement am&#233;ricain sont soumis au contrat de licence standard de
Sun Microsystems, Inc, ainsi qu'aux clauses applicables stipul&#233;es dans le FAR et
ses suppl&#233;ments.</p><p>La distribution du logiciel peut s'accompagner de celle de composants mis
au point par des tiers.</p><p>Des parties de ce produit peuvent &#234;tre d&#233;riv&#233;es
des syst&#232;mes Berkeley BSD, distribu&#233;s sous licence par l'Universit&#233; de Californie. UNIX
est une marque d&#233;pos&#233;e aux &#201;tats-Unis et dans d'autres pays, exclusivement conc&#233;d&#233;e
sous licence par X/Open Company, Ltd.</p><p>Sun, Sun Microsystems, le logo Sun, le
logo Solaris, le logo de tasse de caf&#233; Java, docs.sun.com,        Java et
Solaris sont des marques commerciales ou d&#233;pos&#233;es de Sun Microsystems, Inc. aux
&#201;tats-Unis et dans d'autres pays. Toutes les appellations SPARC sont utilis&#233;es sous
licence et sont des marques commerciales ou d&#233;pos&#233;es de SPARC International, Inc.
aux &#201;tats-Unis et dans d'autres pays. Les produits portant les marques SPARC
sont bas&#233;s sur une architecture d&#233;velopp&#233;e par Sun Microsystems, Inc.    </p><p>OPEN LOOK
et l'interface graphique utilisateur Sun sont d&#233;velopp&#233;s par Sun Microsystems, Inc. pour
ses utilisateurs et ses concessionnaires. Sun reconna&#238;t les efforts novateurs de Xerox
en ce qui concerne la recherche et le d&#233;veloppement du concept des
interfaces visuelles ou graphiques dans le domaine informatique. Sun d&#233;tient une licence
non exclusive de Xerox sur l'interface d'utilisateur graphique Xerox, cette licence couvrant
&#233;galement les d&#233;tenteurs de licence Sun qui mettent en place l'interface utilisateur
graphique OPEN LOOK et qui, en outre, se conforment aux licences &#233;crites
de Sun.</p><p>Les produits mentionn&#233;s dans ce manuel et les informations fournies sont
soumis &#224; la l&#233;gislation am&#233;ricaine en mati&#232;re de contr&#244;le des exportations et
peuvent &#234;tre soumis &#224; la r&#233;glementation en vigueur dans d'autres pays dans
le domaine des exportations et importations. L'utilisation d'armes nucl&#233;aires, de missiles, d'armes
biologiques et chimiques ou d'armes nucl&#233;aires maritimes, qu'elle soit directe ou indirecte,
est strictement interdite. Les exportations ou r&#233;exportations vers les pays sous embargo
am&#233;ricain ou vers des entit&#233;s figurant sur les listes d'exclusion des exportations
am&#233;ricaines, y compris mais de mani&#232;re non exhaustive, la liste des personnes
refus&#233;es et la liste de ressortissants sp&#233;cifiquement d&#233;sign&#233;s, sont rigoureusement interdites.</p><p>LA DOCUMENTATION
EST FOURNIE &#171;&#160;EN L'&#201;TAT&#160;&#187; ET TOUTES AUTRES CONDITIONS, REPR&#201;SENTATIONS ET GARANTIES EXPRESSES
OU TACITES, Y COMPRIS TOUTE GARANTIE IMPLICITE RELATIVE &#192; LA COMMERCIALISATION, L'AD&#201;QUATION
&#192; UN USAGE PARTICULIER OU LA NON-VIOLATION DE DROIT, SONT FORMELLEMENT EXCLUES.
CETTE EXCLUSION DE GARANTIE NE S'APPLIQUE PAS DANS LA MESURE O&#217; ELLE
EST TENUE JURIDIQUEMENT NULLE ET NON AVENUE.</p>
<br/>

</body>
</html>
