<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Modification du profil d'un cercle de confiance - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fsauthdomainsedit"></a><h4>Modification du profil d'un cercle de confiance</h4><a name="indexterm-57"></a><p>Suivez cette proc&#233;dure pour modifier les attributs globaux d'un cercle de confiance
ou pour lui ajouter des fournisseurs. Le point de d&#233;part est Cercle
de confiance dans l'interface F&#233;d&#233;ration.</p><ol>
<li><b>Cliquez sur le nom d'un cercle de confiance pour modifier son profil
ou lui ajouter des fournisseurs.</b><p>La page Modifier le cercle de confiance appara&#238;t.</p></li>
<li><b>Tapez les nouvelles valeurs ou modifiez celles affich&#233;es dans les attributs g&#233;n&#233;raux
du cercle de confiance&#160;:</b><dl><dt>Nom</dt>
<dd><p>La valeur statique de cet attribut est le nom fourni lors de la cr&#233;ation du cercle de confiance.</p></dd>
<dt>Description</dt>
<dd><p>Cet attribut est une description du cercle de confiance. Si n&#233;cessaire, vous pouvez modifier la description d&#233;j&#224; saisie.</p></dd>
<dt>URL du service &#233;criture IDFF</dt>
<dd><p>Cet attribut indique l'emplacement du service qui &#233;crit le cookie du domaine commun. L'URL a le format <tt><b>http://</tt><i>common-domain-host</i><tt>:</tt><i>port</i><tt>/common/idffwriter</b></tt>.</p></dd>
<dt>URL du service lecture IDFF</dt>
<dd><p>Cet attribut indique l'emplacement du service qui lit le cookie du domaine commun. L'URL a le format <tt><b>http://</tt><i>common-domain-host</i><tt>:</tt><i>port</i><tt>/common/idffreader</b></tt>.</p></dd>
<dt>URL du &#233;criture SAML2</dt>
<dd><p>Sp&#233;cifie l'emplacement du service &#233;criture SAML2 qui &#233;crit le cookie dans le domaine commun. L'URL a le format <tt><b>http://</tt><i>common-domain-host</i><tt>:</tt><i>port</i><tt>/common/saml2writer</b></tt>.</p></dd>
<dt>URL du lecture SAML2</dt>
<dd><p>Sp&#233;cifie l'emplacement du service &#233;criture SAML2 qui &#233;crit le cookie dans le domaine commun. L'URL a le format <tt><b>http://</tt><i>common-domain-host</i><tt>:</tt><i>port</i><tt>/common/saml2reader</b></tt>.</p></dd>
<dt>Statut</dt>
<dd><p>Le statut par d&#233;faut est Actif. Si vous s&#233;lectionnez Inactif, vous d&#233;sactivez la communication dans le cercle de confiance.</p></dd>
</dl>
</li>
<li><b>Choisissez un ou plusieurs fournisseurs disponibles et cliquez sur la fl&#232;che Ajouter
pour les s&#233;lectionner.</b><p>La liste fournie contient les noms des entit&#233;s cr&#233;&#233;es et renseign&#233;es avec
des fournisseurs. Pour plus d'informations, reportez-vous &#224; la rubrique <a href="federation.fsauthdomainsselectprovider.html">Ajout de fournisseurs &#224; un cercle de confiance</a>.</p></li>
<li><b>Cliquez sur Enregistrer pour terminer l'op&#233;ration.</b></li></ol>
<br/>

</body>
</html>
