<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Ajout d'un fournisseur de services &#224; une entit&#233; fournisseur - Aide en ligne de la console Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fsserviceprovider"></a><h4>Ajout d'un fournisseur de services &#224; une entit&#233; fournisseur</h4><a name="indexterm-75"></a><a name="indexterm-76"></a><p>La premi&#232;re &#233;tape du processus d'ajout d'un fournisseur de services &#224; une
entit&#233; fournisseur consiste &#224; d&#233;finir le type de fournisseur de services ajout&#233;.</p>
<ul><li><p>Un <b>fournisseur h&#233;berg&#233;</b> est h&#233;berg&#233; sur le m&#234;me serveur qu'Access Manager.</p></li>
<li><p>Un <b>fournisseur distant</b> n'est pas h&#233;berg&#233; sur le m&#234;me serveur qu'Access Manager.</p></li></ul>
<p>La proc&#233;dure suivante d&#233;crit l'&#233;tape initiale. Le point de d&#233;part est Entit&#233;s
sous l'interface F&#233;d&#233;ration.</p><ol>
<li><b>S&#233;lectionnez le nom d'une entit&#233; fournisseur configur&#233;e pour modifier son profil.</b><p>La page du profil de l'entit&#233; s'affiche.</p></li>
<li><b>Dans le menu Afficher, s&#233;lectionnez Fournisseur de services.</b></li>
<li><b>S&#233;lectionnez le type du fournisseur que vous ajoutez :</b>
<ul><li><p>Choisissez Nouveau fournisseur central si le fournisseur est h&#233;berg&#233; sur le m&#234;me serveur qu'Access Manager.</p></li>
<li><p>Choisissez Nouveau fournisseur distant si le fournisseur n'est pas h&#233;berg&#233; sur le m&#234;me serveur que Federated Access Manager.</p></li></ul>
<p>La page du profil du fournisseur de services s'affiche.</p></li>
<li><b>Selon votre s&#233;lection &#224; l'&#233;tape pr&#233;c&#233;dente, faites votre choix parmi les possibilit&#233;s
suivantes :</b><ul>
<li><b><a href="federation.fsserviceproviderhostedadd.html">Ajout d'un nouveau fournisseur de services h&#233;berg&#233; &#224; une entit&#233; fournisseur</a></b></li>
<li><b><a href="federation.fsserviceproviderremoteadd.html">Ajout d'un nouveau fournisseur de services distant &#224; une entit&#233; fournisseur</a></b></li></ul></li></ol>
<br/>

</body>
</html>
