<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Ajout d'un nouveau fournisseur d'identit&#233;s distant &#224; une entit&#233; fournisseur - Aide en ligne de la console Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fsidentityproviderremoteadd"></a><h4>Ajout d'un nouveau fournisseur d'identit&#233;s distant &#224; une entit&#233; fournisseur</h4><p>Un <b>fournisseur distant</b> n'est pas h&#233;berg&#233; sur le m&#234;me serveur que Federated Access
Manager. La configuration des attributs d'un nouveau fournisseur d'identit&#233;s distant inclut l'ajout
de m&#233;tadonn&#233;es concernant le fournisseur d'identit&#233;s au profil de l'entit&#233; fournisseur. Le
point de d&#233;part est <a href="federation.fsidentityprovider.html">Ajout d'un fournisseur d'identit&#233;s &#224; une entit&#233; fournisseur</a>.</p>
<hr><p><b>Remarque &#8211; </b>D'autres attributs peuvent &#234;tre configur&#233;s mais n'apparaissent pas dans cette premi&#232;re page
de configuration. Reportez-vous &#224; <a href="federation.fsidentityproviderremoteprofile.html">Modification des attributs d'un fournisseur d'identit&#233;s distant dans une entit&#233; fournisseur</a>.</p>
<hr>
<ol>
<li><b>Fournissez les informations des attributs communs.</b><p>Ces attributs d&#233;finissent g&#233;n&#233;ralement l'identit&#233; du fournisseur lui-m&#234;me.</p><dl><dt>Description</dt>
<dd><p>La valeur de cet attribut est la description fournie lors de la cr&#233;ation de l'entit&#233;. Vous pouvez modifier la description initiale ou en ajouter une s'il n'y en a pas.</p></dd>
<dt>&#201;num&#233;ration des protocoles pris en charge</dt>
<dd><p>Choisissez la version de Liberty Alliance Project Liberty Identity Federation Framework (Liberty ID-FF) prise en charge par cette entit&#233;.</p>
<ul><li><p><tt>urn:liberty:iff:2003-08</tt> correspond &#224; la version 1.2 de Liberty ID-FF.</p></li>
<li><p><tt>urn:liberty:iff:2002-12</tt> correspond &#224; la version 1.1 de Liberty ID-FF.</p></li></ul>
</dd>
</dl>
</li>
<li><b>Fournissez les informations des attributs des URL de communication.</b><p>Ces attributs contiennent les emplacements auxquels des fournisseurs peuvent envoyer des transmissions
sp&#233;cialis&#233;es pour ce fournisseur d'identit&#233;s.</p><dl><dt>URL du service de connexion unique (SSO)</dt>
<dd><p>Tapez un URL auquel les fournisseurs de services peuvent adresser les demandes de f&#233;d&#233;ration et de connexion unique.</p></dd>
</dl>
</li>
<li><b>Fournissez les informations des attributs des profils de communication. </b><p>Un <b>profil</b> Liberty Alliance Project d&#233;finit la combinaison entre un contenu de
message et le m&#233;canisme utilis&#233; pour son transport. Les attributs de profils
de communication suivants d&#233;finissent les profils utilis&#233;s par le fournisseur d'identit&#233;s pour
chaque fonctionnalit&#233;.</p><dl><dt>F&#233;d&#233;ration/connexion unique</dt>
<dd><p>S&#233;lectionnez le profil de ce fournisseur d'identit&#233;s &#224; utiliser pour envoyer des r&#233;ponses &#224; des demandes d'authentification ou de f&#233;d&#233;ration.</p>
<ul><li><p>Poste navigateur (sp&#233;cifie un protocole POST HTTP bas&#233; sur un navigateur)</p></li>
<li><p>Art&#233;fact navigateur (sp&#233;cifie un protocole bas&#233; sur SOAP hors navigateur).</p></li>
<li><p>LECP (sp&#233;cifie un proxy client compatible Liberty)</p></li></ul>
</dd>
</dl>
</li>
<li><b>S&#233;lectionnez l'un des cercles d'approbation disponibles &#224; attribuer au fournisseur.</b><p>Un fournisseur peut appartenir &#224; un ou plusieurs cercles d'approbation. Cependant, un
fournisseur sans cercle d'approbation sp&#233;cifi&#233; ne peut pas participer &#224; des communications
bas&#233;es sur les sp&#233;cifications Liberty Alliance Project. Si aucun cercle d'approbation n'a
&#233;t&#233; cr&#233;&#233;, vous pouvez d&#233;finir cet attribut plus tard.</p></li>
<li><b>Cliquez sur OK pour ajouter le fournisseur &#224; l'entit&#233;.</b></li>
<li><b>Poursuivez la configuration de l'entit&#233; en s&#233;lectionnant une autre option dans le
menu Affichage ou cliquez sur Enregistrer pour terminer la configuration.</b></li></ol>
<br/>

</body>
</html>
