<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Pour permettre &#224; un agent d'h&#233;riter des propri&#233;t&#233;s d'un groupe - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="ggouy"></a><h5>Pour permettre &#224; un agent d'h&#233;riter des propri&#233;t&#233;s d'un groupe</h5>
<h6>Avant de commencer</h6><p>Le groupe dont vous souhaitez qu'un agent h&#233;rite des propri&#233;t&#233;s doit &#234;tre
cr&#233;&#233; en premier.</p><ol>
<li><b>Cliquez sur l'onglet Contr&#244;le d'acc&#232;s.</b></li>
<li><b>Cliquez sur le nom du domaine auquel l'agent appartient.</b></li>
<li><b>Cliquez sur l'onglet Agents.</b></li>
<li><b>Si n&#233;cessaire, s&#233;lectionnez l'onglet correspondant au type d'agent appropri&#233;.</b></li>
<li><b>Dans la section Agent, cliquez sur le nom de l'agent que vous
souhaitez configurer.</b></li>
<li><b>L'onglet Global &#233;tant s&#233;lectionn&#233;, pour l'attribut Groupe, s&#233;lectionnez le nom du groupe
dont l'agent doit h&#233;riter des propri&#233;t&#233;s.</b></li>
<li><b>Cliquez sur Enregistrer.</b><p>En haut de la page, le bouton Param&#232;tres d'h&#233;ritage devient actif.</p></li>
<li><b>Cliquez sur Param&#232;tres d'h&#233;ritage.</b><p>Dans l'onglet Global, les param&#232;tres d'h&#233;ritage apparaissent dans l'ordre alphab&#233;tique.</p></li>
<li><b>S&#233;lectionnez les propri&#233;t&#233;s que l'agent doit h&#233;riter du groupe.</b><p>En haut de la page, le bouton Param&#232;tres d'h&#233;ritage devient actif.</p></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>&#201;tapes suivantes</h6><p>Cette t&#226;che d&#233;crit comment modifier les param&#232;tres d'h&#233;ritage des propri&#233;t&#233;s r&#233;pertori&#233;es dans
l'onglet Global. Pour les param&#232;tres d'h&#233;ritage des propri&#233;t&#233;s r&#233;pertori&#233;es dans d'autres onglets
(par exemple, Application), cliquez sur l'onglet souhait&#233; et modifiez les param&#232;tres d'h&#233;ritage
en suivant la proc&#233;dure d&#233;crite dans les &#233;tapes pr&#233;c&#233;dentes.</p>
<br/>

</body>
</html>
