<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Authentificateur d'agent - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="ghfif"></a><h4>Authentificateur d'agent</h4>
<p>Un authentificateur d'agent est un type d'agent qui, une fois qu'il est
authentifi&#233;, peut obtenir les donn&#233;es en lecture seule de profils d'agent s&#233;lectionn&#233;s.
Les profils d'agent peuvent &#234;tre de tout type (J2EE, WSP, D&#233;tection, etc.)
mais doivent appartenir au m&#234;me domaine. Les utilisateurs qui poss&#232;dent les r&#233;f&#233;rences
de l'authentificateur d'agent (nom d'utilisateur et mot de passe) peuvent lire les
donn&#233;es du profil agent, mais n'ont pas les droits de cr&#233;ation, de
mise &#224; jour et de suppression de l'agent Admin. </p><p>L'authentificateur d'agent comporte les attributs suivants&#160;:</p>

<a name="ghfjj"></a><h5>Mot de passe</h5>
<p>Le mot de passe a &#233;t&#233; d&#233;fini lors de la cr&#233;ation du
profil d'authentificateur d'agent. Cependant, vous pourrez changer de mot de passe &#224;
tout moment.</p>

<a name="ghfiu"></a><h5>Confirmation de mot de passe</h5>
<p>Le mot de passe a &#233;t&#233; confirm&#233; lors de la cr&#233;ation du
profil d'authentificateur d'agent. Si vous modifiez le mot de passe, vous devez
confirmer votre modification.</p>

<a name="ghfka"></a><h5>Statut</h5>
<p>L'option <tt>Active</tt> est s&#233;lectionn&#233;e lors de la cr&#233;ation de l'authentificateur d'agent. Ne
choisissez <tt>Inactive</tt> que si vous voulez supprimer la protection assur&#233;e par l'agent.</p>

<a name="ghfig"></a><h5>Profils d'agent disposant d'un droit de lecture</h5>
<p>Cet attribut d&#233;finit une liste d'agents OpenSSO dont les donn&#233;es du profil
sont lues par l'authentificateur d'agent. Les agents peuvent &#234;tre de tout type
(J2EE, WSP, D&#233;tection, etc.), mais doivent appartenir au m&#234;me domaine. Pour ajouter
un agent &#224; la liste, s&#233;lectionnez le nom de l'agent et cliquez
sur Ajouter.</p>
<br/>

</body>
</html>
