<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Introduction - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="intro"></a><h3>Introduction</h3>
<p>Sun OpenSSO emp&#234;che les acc&#232;s non autoris&#233;s aux applications de service Web
et aux contenus Web. OpenSSO int&#232;gre des services d'authentification et d'autorisation, des
agents de strat&#233;gie et la f&#233;d&#233;ration d'entit&#233;s dans une solution compl&#232;te de
protection des ressources r&#233;seau.</p><p>De nombreuses entreprises autorisent l'acc&#232;s aux informations en fonction de l'application. Par
exemple, un employ&#233; peut &#234;tre amen&#233; &#224; d&#233;finir un nom d'utilisateur et
un mot de passe pour acc&#233;der au site Web d'administration de la
mutuelle d'entreprise. Ce m&#234;me employ&#233; peut avoir d'autres nom d'utilisateur et mot
de passe pour acc&#233;der aux formulaires en ligne du service Comptabilit&#233;. Au
sein de la m&#234;me entreprise, un client d&#233;finit un nom d'utilisateur et
un mot de passe pour acc&#233;der &#224; la partie publique du site
Web de la soci&#233;t&#233;. Pour chaque site Web ou service, un administrateur
doit convertir les donn&#233;es saisies par l'utilisateur en un format de donn&#233;es
exploitable par le service. Chaque service ajout&#233; &#224; l'entreprise doit &#234;tre compl&#233;t&#233;
et g&#233;r&#233; s&#233;par&#233;ment.</p><p>OpenSSO r&#233;duit les co&#251;ts administratifs et &#233;limine les informations utilisateur redondantes associ&#233;es
aux solutions par application. OpenSSO permet &#224; un administrateur d'assigner des r&#232;gles
ou des strat&#233;gies sp&#233;cifiques qui r&#233;gissent les informations ou services auxquels chaque
utilisateur peut acc&#233;der. Les agents de strat&#233;gie sont d&#233;ploy&#233;s sur les serveurs
d'applications ou les serveurs Web afin de traiter les requ&#234;tes HTTP et
d'appliquer les strat&#233;gies actives. Conjointement, les informations de l'utilisateur et les strat&#233;gies
d'acc&#232;s associ&#233;es constituent l'identit&#233; de l'entreprise de l'utilisateur. OpenSSO permet &#224; un
utilisateur d'acc&#233;der &#224; de nombreuses ressources de l'entreprise sous une seule identit&#233;.</p>
<br/>

</body>
</html>
