<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Strat&#233;gies - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="policy.policy"></a><h3>Strat&#233;gies</h3>
<p><a name="indexterm-20"></a><a name="indexterm-21"></a>Une <b>strat&#233;gie</b> d&#233;finit des r&#232;gles qui sp&#233;cifient les privil&#232;ges d'acc&#232;s aux ressources
prot&#233;g&#233;es d'un domaine. Les entreprises poss&#232;dent des ressources, des applications et des
services qui doivent &#234;tre prot&#233;g&#233;s, g&#233;r&#233;s et surveill&#233;s. Les strat&#233;gies permettent de
contr&#244;ler les autorisations d'acc&#232;s et l'utilisation qui est faite des ressources en
d&#233;finissant &#224; quel moment et de quelle mani&#232;re un utilisateur peut ex&#233;cuter
des actions sur une ressource donn&#233;e. Appliqu&#233;e &#224; un objet, une strat&#233;gie
d&#233;finit les ressources auquel cet objet sp&#233;cifique peut acc&#233;der.</p><p>Une strat&#233;gie unique peut d&#233;finir soit des d&#233;cision binaires soit des d&#233;cisions
non binaires. Une d&#233;cision binaire est de type <b>oui</b>/<b>non</b>, <b> vrai</b>/<b>faux</b> ou <b>autoriser</b>/<b>refuser</b>.
Une d&#233;cision non binaire repr&#233;sente la valeur d'un attribut. Par exemple, un
service de messagerie peut comporter un attribut <tt>mailboxQuota</tt> avec une valeur maximale
de stockage d&#233;finie pour chaque utilisateur. En g&#233;n&#233;ral, une strat&#233;gie d&#233;finit ce
qu'un objet peut faire, sur quelles ressources et dans quelles conditions.</p><p>Il existe deux types de strat&#233;gies configurables avec OpenSSO&#160;: les <a href="normalpolicy.html">Strat&#233;gies normales</a> et
les <a href="fyfby.html">Strat&#233;gies d'orientation</a>. Une strat&#233;gie normale se compose de <b>r&#232;gles</b>, d'<b>objets</b>, de <b>conditions</b>
et de <b>fournisseurs de r&#233;ponses</b>. Une strat&#233;gie d'orientation comprend des <b>r&#232;gles</b> et des <b>orientations</b>
vers des organisations.</p>
<br/>

</body>
</html>
