<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Ajout d'un fournisseur de r&#233;ponses &#224; une strat&#233;gie - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="policy.responseprovideradd"></a><h5>Ajout d'un fournisseur de r&#233;ponses &#224; une strat&#233;gie</h5>
<ol>
<li><b><a name="indexterm-42"></a>Si vous avez d&#233;j&#224; cr&#233;&#233; la strat&#233;gie, cliquez sur le nom de
la strat&#233;gie &#224; laquelle vous souhaitez ajouter le fournisseur de r&#233;ponses. Si
vous n'avez pas encore cr&#233;&#233; la strat&#233;gie, reportez-vous &#224; <a href="policy.policynormaladd.html">Cr&#233;ation d'une strat&#233;gie normale</a>.</b></li>
<li><b>Sous la liste Fournisseurs de r&#233;ponses, cliquez sur Nouveau.</b></li>
<li><b>Entrez un nom pour le fournisseur de r&#233;ponses.</b></li>
<li><b>D&#233;finissez les valeurs suivantes :</b><dl><dt>StaticAttribute</dt>
<dd><p>Il s'agit d'attributs statiques au format de valeur d'attribut, d&#233;finis dans une instance de <tt>IDResponseProvider</tt>stock&#233;e dans la strat&#233;gie.</p></dd>
<dt>DynamicAttribute</dt>
<dd><p>Les attributs de r&#233;ponse choisis ici doivent &#234;tre les premiers d&#233;finis dans le service de <a href="service.scpolicy.html">Configuration de r&#232;gles</a> du domaine correspondant. Les noms d'attribut d&#233;finis doivent &#234;tre un sous-ensemble de ceux existant dans le magasin de donn&#233;es configur&#233; (IDRepository). Pour plus d'informations sur la d&#233;finition des attributs, reportez-vous aux d&#233;finitions d'attribut Configuration de strat&#233;gie. Pour s&#233;lectionner des attributs sp&#233;cifiques ou multiples, maintenez la touche Ctrl enfonc&#233;e et cliquez sur le bouton gauche de la souris.</p></dd>
</dl>
</li>
<li><b>Cliquez sur Terminer.</b></li>
<li><b>Pour supprimer un fournisseur de r&#233;ponses d'une strat&#233;gie, s&#233;lectionnez l'objet et cliquez
sur Supprimer. Vous pouvez modifier n'importe quelle d&#233;finition de fournisseur de r&#233;ponses
en cliquant sur son nom.</b></li></ol>
<br/>

</body>
</html>
