<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Ajout d'un objet &#224; une strat&#233;gie - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="policy.subjectadd"></a><h5>Ajout d'un objet &#224; une strat&#233;gie</h5>
<ol>
<li><b><a name="indexterm-28"></a>Si vous avez d&#233;j&#224; cr&#233;&#233; la strat&#233;gie, cliquez sur le nom de
la strat&#233;gie &#224; laquelle vous souhaitez ajouter l'objet. Si vous n'avez pas
encore cr&#233;&#233; la strat&#233;gie, reportez-vous &#224; <a href="policy.policynormaladd.html">Cr&#233;ation d'une strat&#233;gie normale</a>.</b></li>
<li><b>Sous la liste Objet, cliquez sur Nouveau.</b></li>
<li><b>S&#233;lectionnez l'un des types d'objet par d&#233;faut. Pour une description des types
d'objet, reportez-vous &#224; <a href="policy.selectsubjecttype.html">Objets</a>.</b></li>
<li><b>Cliquez sur Suivant.</b></li>
<li><b>Entrez un nom pour l'objet.</b></li>
<li><b>S&#233;lectionnez ou d&#233;s&#233;lectionnez le champ Exclusif.</b><p>Si ce champ n'est pas s&#233;lectionn&#233; (valeur par d&#233;faut), la strat&#233;gie s'applique
&#224; l'identit&#233; membre de l'objet. Si ce champ est s&#233;lectionn&#233;, la strat&#233;gie
s'applique &#224; l'identit&#233; qui n'est <b>pas</b> membre de l'objet.</p><p>Si la strat&#233;gie comporte plusieurs objets, elle s'applique &#224; l'identit&#233; lorsqu'au moins
un des objets implique que la strat&#233;gie s'applique &#224; l'identit&#233; donn&#233;e.</p></li>
<li><b>Effectuez une recherche afin d'afficher les identit&#233;s &#224; ajouter &#224; l'objet. Cette
&#233;tape n'est pas applicable dans le cas des objets Utilisateurs authentifi&#233;s ou
Clients de services Web.</b><p>Le mod&#232;le de recherche par d&#233;faut (&#42;) affiche toutes les entr&#233;es qualifi&#233;es.</p></li>
<li><b>S&#233;lectionnez les diff&#233;rentes identit&#233;s que vous voulez ajouter &#224; l'objet, ou cliquez
sur Tout ajouter pour ajouter toutes les identit&#233;s en une seule op&#233;ration.
Cliquez sur Ajouter pour d&#233;placer les identit&#233;s vers la liste S&#233;lectionn&#233;. Cette
&#233;tape n'est pas applicable dans le cas d'un objet Utilisateurs authentifi&#233;s.</b></li>
<li><b>Cliquez sur Terminer.</b></li>
<li><b>Pour supprimer un objet d'une strat&#233;gie, s&#233;lectionnez l'objet et cliquez sur Supprimer.
Vous pouvez modifier n'importe quelle d&#233;finition d'objet en cliquant sur son nom.</b></li></ol>
<br/>

</body>
</html>
