<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@14981-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=iso-8859-1">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Attributs du plug-in du r&eacute;f&eacute;rentiel LDAPv3
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="realm.idrepoadd"></A><h3>Attributs du plug-in du r&eacute;f&eacute;rentiel LDAPv3</h3>
<p><A NAME="indexterm-13"></A>Les attributs suivants permettent de configurer un plug-in de r&eacute;f&eacute;rentiel LDAPv3:</p>
<ul><li><p><A HREF="realm.idrepoadd.html#fyfdo">Serveur LDAP principal</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdt">DN de la liaison LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfds">Mot de passe pour la liaison LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdu">Mot de passe pour la liaison LDAP (confirmer)</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdv">DN de l'organisation LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdw">Activer le protocole SSL pour LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfej">Taille minimale de pool de connexion LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfee">Taille maximale de pool de connexion LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdx">Maximum de r&eacute;sultats renvoy&eacute;s par la recherche</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfen">D&eacute;lai de recherche</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdz">Orientation suivie par LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffh">Nom de la classe pour le plug-in du r&eacute;f&eacute;rentiel LDAPv3</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfeu">Mappage du nom d'attribut</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffb">Types et op&eacute;rations pris en charge pour le plug-in LDAPv3</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffj">Attribut de recherche d'utilisateurs LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfeo">Filtre de recherche d'utilisateurs LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffi">Classe d'objet utilisateur LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfez">Attributs utilisateur LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfeb">Attribut de recherche de groupes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfep">Filtre de recherche de groupes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfed">Attribut d'affectation de nom du conteneur de groupes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfec">Valeur du conteneur de groupes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffc">Classe d'objet de groupes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfff">Attributs des groupes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfea">Nom d'attribut pour l'appartenance &agrave; un groupe</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfes">Nom d'attribut pour le membre du groupe</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfev">Nom d'attribut pour un URL membre d'un groupe</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfem">Attribut d'affectation de nom du conteneur de personnes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffe">Valeur du conteneur de personnes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffk">Attribut de recherche d'agents LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffl">Attribut d'affectation de nom du conteneur d'agents LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffa">Valeur du conteneur d'agents LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffd">Filtre de recherche d'agents LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfey">Classe d'objet d'agents LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfew">Attributs d'agents LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfef">DN de base de la recherche persistante</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffz">D&eacute;lai d'inactivit&eacute; maximal de la recherche persistante avant red&eacute;marrage</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfgh">Nombre maximal de nouvelles tentatives apr&egrave;s r&eacute;ception de codes d'erreur</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfge">Le d&eacute;lai entre les nouvelles tentatives</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffr">Codes d'erreur LDAPException suite auxquels une nouvelle tentative doit avoir lieu</A></p>
</li>
</ul>
<A NAME="fyfdo"></A><h4>Serveur LDAP principal</h4>
<p>Entrez le nom du serveur LDAP auquel vous serez connect&eacute;. Le format doit &ecirc;tre <tt>hostname.domainname:portnumber</tt>. </p>
<p>Si plusieurs entr&eacute;es <tt>host:portnumber</tt> sont saisies, une tentative de connexion au premier h&ocirc;te de la liste est effectu&eacute;e. L'entr&eacute;e suivante dans la liste est essay&eacute;e uniquement en cas d'&eacute;chec de la connexion &agrave; l'h&ocirc;te actuel.</p>
<A NAME="fyfdt"></A><h4>DN de la liaison LDAP</h4>
<p>Sp&eacute;cifie le nom DN qui sera utilis&eacute; par Access Manager pour effectuer l'authentification aupr&egrave;s du serveur LDAP auquel vous &ecirc;tes actuellement connect&eacute;. L'utilisateur poss&eacute;dant le nom DN utilis&eacute; pour la liaison doit poss&eacute;der des privil&egrave;ges d'ajout/de modification/de suppression appropri&eacute;s que vous avez configur&eacute;s dans l'attribut  <A HREF="realm.idrepoadd.html#fyffb">Types et op&eacute;rations pris en charge pour le plug-in LDAPv3</A>.</p>
<A NAME="fyfds"></A><h4>Mot de passe pour la liaison LDAP</h4>
<p>Sp&eacute;cifie le mot de passe DN qui sera utilis&eacute; par Access Manager pour effectuer l'authentification aupr&egrave;s du serveur LDAP auquel vous &ecirc;tes actuellement connect&eacute;.</p>
<A NAME="fyfdu"></A><h4>Mot de passe pour la liaison LDAP (confirmer)</h4>
<p>: confirmez le mot de passe.</p>
<A NAME="fyfdv"></A><h4>DN de l'organisation LDAP</h4>
<p>DN sur lequel le r&eacute;f&eacute;rentiel du magasin de donn&eacute;es sera mapp&eacute;. Ceci constituera le DN de base de toutes les op&eacute;rations effectu&eacute;es dans le magasin de donn&eacute;es. </p>
<A NAME="fyfdw"></A><h4>Activer le protocole SSL pour LDAP</h4>
<p>Lorsque cet attribut est activ&eacute;, Access Manager se connecte au serveur principal &agrave; l'aide du protocole HTTPS.</p>
<A NAME="fyfej"></A><h4>Taille minimale de pool de connexion LDAP</h4>
<p>D&eacute;finit le nombre initial de connexions dans le pool de connexions. L'utilisation d'un pool de connexions permet de ne pas avoir &agrave; cr&eacute;er une connexion chaque fois. </p>
<A NAME="fyfee"></A><h4>Taille maximale de pool de connexion LDAP</h4>
<p>Indique le nombre maximal de connexions autoris&eacute;.</p>
<A NAME="fyfdx"></A><h4>Maximum de r&eacute;sultats renvoy&eacute;s par la recherche</h4>
<p>Sp&eacute;cifie le nombre maximal d'entr&eacute;es retourn&eacute;es &agrave; la suite d'une op&eacute;ration de recherche. Si cette limite est atteinte, Directory Server retourne toutes les entr&eacute;es correspondant &agrave; la recherche.</p>
<A NAME="fyfen"></A><h4>D&eacute;lai de recherche</h4>
<p>Sp&eacute;cifie le nombre maximal de secondes allou&eacute; &agrave; une recherche. Si cette limite est atteinte, Directory Server retourne toutes les entr&eacute;es correspondant &agrave; la recherche.</p>
<A NAME="fyfdz"></A><h4>Orientation suivie par LDAP</h4>
<p>Si elle est activ&eacute;e, cette option sp&eacute;cifie que les r&eacute;f&eacute;rences aux autres serveurs LDAP sont suivies automatiquement.</p>
<A NAME="fyffh"></A><h4>Nom de la classe pour le plug-in du r&eacute;f&eacute;rentiel LDAPv3</h4>
<p>D&eacute;finit l'emplacement du fichier de classe qui impl&eacute;mente le r&eacute;f&eacute;rentiel LDAPv3.</p>
<A NAME="fyfeu"></A><h4>Mappage du nom d'attribut</h4>
<p>Active le mappage des attributs communs connus de la structure avec le magasin de donn&eacute;es natif. Par exemple, si la structure utilise <tt>inetUserStatus</tt> pour d&eacute;terminer le statut de l'utilisateur, il est possible que le magasin de donn&eacute;es natif utilise <tt>userStatus</tt>. La distinction majuscules/minuscules s'applique pour les d&eacute;finitions d'attribut.</p>
<A NAME="fyffb"></A><h4>Types et op&eacute;rations pris en charge pour le plug-in LDAPv3</h4>
<p>Sp&eacute;cifie les op&eacute;rations autoris&eacute;es sur ce serveur LDAP. Les op&eacute;rations par d&eacute;faut sont les seules op&eacute;rations prises en charge par ce plug-in de r&eacute;f&eacute;rentiel LDAPv3. Les op&eacute;rations prises en charge par le plug-in de r&eacute;f&eacute;rentiel LDAPv3 sont les suivantes:</p>
<ul><li><p>groupe : lecture, cr&eacute;ation, modification, suppression</p>
</li>
<li><p>domaine : lecture, cr&eacute;ation, modification, suppression, service</p>
</li>
<li><p>utilisateur : lecture, cr&eacute;ation, modification, suppression, service</p>
</li>
<li><p>agent : lecture, cr&eacute;ation, modification, suppression</p>
</li>
</ul>
<p>Vous pouvez supprimer des autorisations </p>
<p>dans la liste ci-dessus en fonction des param&egrave;tres de votre serveur LDAP et des t&acirc;ches, mais vous ne pouvez pas en ajouter.</p>
<A NAME="fyffj"></A><h4>Attribut de recherche d'utilisateurs LDAP</h4>
<p>Ce champ d&eacute;finit le type d'attribut qui permet de rechercher un utilisateur. Par exemple, si le DN de l'utilisateur <tt>uid=user1,ou=people,dc=iplanet,dc=com </tt>, l'attribut de nommage est <tt>uid</tt>. </p>
<A NAME="fyfeo"></A><h4>Filtre de recherche d'utilisateurs LDAP</h4>
<p>Sp&eacute;cifie le filtre de recherche &agrave; utiliser pour rechercher les entr&eacute;es utilisateur.</p>
<A NAME="fyffi"></A><h4>Classe d'objet utilisateur LDAP</h4>
<p>Sp&eacute;cifie les classes d'objet d'un utilisateur. Lorsqu'un utilisateur est cr&eacute;&eacute;, la liste des classes d'objet de cet utilisateur est ajout&eacute;e &agrave; la liste des attributs de l'utilisateur.</p>
<A NAME="fyfez"></A><h4>Attributs utilisateur LDAP</h4>
<p>D&eacute;finit la liste des attributs associ&eacute;s &agrave; un utilisateur. Toute tentative de lecture/d'&eacute;criture des attributs utilisateur autres que ceux figurant sur cette liste est interdite. La distinction majuscules/minuscules s'applique pour les attributs. Vous pouvez d&eacute;finir ici les classes d'objet et le sch&eacute;ma d'attribut uniquement s'ils sont d&eacute;j&agrave; d&eacute;finis dans Directory Server.</p>
<A NAME="fyfeb"></A><h4>Attribut de recherche de groupes LDAP</h4>
<p>Ce champ d&eacute;finit le type d'attribut qui permet de rechercher un groupe. La valeur par d&eacute;faut est <tt>cn</tt>.</p>
<A NAME="fyfep"></A><h4>Filtre de recherche de groupes LDAP</h4>
<p>Sp&eacute;cifie le filtre de recherche &agrave; utiliser pour rechercher les entr&eacute;es groupe. La valeur par d&eacute;faut est <tt>(objectclass=groupOfUniqueNames)</tt>.</p>
<A NAME="fyfed"></A><h4>Attribut d'affectation de nom du conteneur de groupes LDAP</h4>
<p>D&eacute;finit l'attribut de nommage d'un conteneur de groupes, si des groupes r&eacute;sident dans un conteneur. Dans le cas contraire, cet attribut n'est pas d&eacute;fini. Par exemple, si un DN de groupe <tt>cn=group1,ou=groups,dc=iplanet,dc=com</tt> r&eacute;side dans <tt>ou=groups</tt>, l'attribut de nommage de conteneur de groupes est <tt>ou</tt>.</p>
<A NAME="fyfec"></A><h4>Valeur du conteneur de groupes LDAP</h4>
<p>Indique la valeur du conteneur de groupes. Par exemple, si le DN de groupe  <tt>cn=group1,ou=groups,dc=iplanet,dc=com</tt> r&eacute;side dans un conteneur nomm&eacute; <tt>ou=groups</tt>, la valeur du conteneur de groupes est <tt>groups</tt>. </p>
<A NAME="fyffc"></A><h4>Classe d'objet de groupes LDAP</h4>
<p>Sp&eacute;cifie les classes d'objet des groupes. Lorsqu'un groupe est cr&eacute;&eacute;, cette liste des classes d'objet de groupe est ajout&eacute;e &agrave; la liste des attributs du groupe.</p>
<A NAME="fyfff"></A><h4>Attributs des groupes LDAP</h4>
<p>D&eacute;finit la liste des attributs associ&eacute;s &agrave; un groupe. Toute tentative de lecture/d'&eacute;criture des attributs de groupe autres que ceux figurant sur cette liste est interdite. La distinction majuscules/minuscules s'applique pour les attributs. Vous pouvez d&eacute;finir ici les classes d'objet et le sch&eacute;ma d'attribut uniquement s'ils sont d&eacute;j&agrave; d&eacute;finis dans Directory Server.</p>
<A NAME="fyfea"></A><h4>Nom d'attribut pour l'appartenance &agrave; un groupe</h4>
<p>Indique le nom des attributs dont les valeurs sont les noms de tous les groupes auxquels appartient le DN. La valeur par d&eacute;faut est <tt>memberOf</tt>. </p>
<A NAME="fyfes"></A><h4>Nom d'attribut pour le membre du groupe</h4>
<p>Sp&eacute;cifie le nom de l'attribut dont les valeurs sont un DN appartenant &agrave; ce groupe. La valeur par d&eacute;faut est <tt>uniqueMember</tt>.</p>
<A NAME="fyfev"></A><h4>Nom d'attribut pour un URL membre d'un groupe</h4>
<p>Indique le nom de l'attribut dont la valeur est un URL LDAP qui aboutit aux membres appartenant &agrave; ce groupe. La valeur par d&eacute;faut est <tt>memberUrl</tt>.</p>
<A NAME="fyfem"></A><h4>Attribut d'affectation de nom du conteneur de personnes LDAP</h4>
<p>Indique l'attribut de nommage du conteneur de personnes si un utilisateur r&eacute;side dans un conteneur de personnes. Ce champ est laiss&eacute; vide si l'utilisateur ne r&eacute;side pas dans un conteneur de personnes. </p>
<A NAME="fyffe"></A><h4>Valeur du conteneur de personnes LDAP</h4>
<p>Indique la valeur du conteneur de personnes. La valeur par d&eacute;faut est <tt>people</tt>.</p>
<A NAME="fyffk"></A><h4>Attribut de recherche d'agents LDAP</h4>
<p>Ce champ d&eacute;finit le type d'attribut qui permet de rechercher un agent. La valeur par d&eacute;faut est <tt>uid</tt>.</p>
<A NAME="fyffl"></A><h4>Attribut d'affectation de nom du conteneur d'agents LDAP</h4>
<p>L'attribut de nommage du conteneur d'agents si l'agent r&eacute;side dans un conteneur d'agents. Ce champ est laiss&eacute; vide si l'agent ne r&eacute;side pas dans un conteneur d'agents.</p>
<A NAME="fyffa"></A><h4>Valeur du conteneur d'agents LDAP</h4>
<p>Indique la valeur du conteneur d'agents. La valeur par d&eacute;faut est <tt>agents</tt>.</p>
<A NAME="fyffd"></A><h4>Filtre de recherche d'agents LDAP</h4>
<p>D&eacute;finit le filtre utilis&eacute; pour rechercher un agent. L'attribut Recherche d'agents LDAP est ajout&eacute; devant ce champ pour former le filtre de recherche d'agents r&eacute;el. </p>
<p>Par exemple, si l'attribut de recherche d'agents LDAP est <tt>uid</tt> et que le filtre de recherche d'utilisateurs LDAP est <tt>(objectClass=sunIdentityServerDevice) </tt>, le filtre de recherche d'utilisateur utilis&eacute; est: <tt>(&amp;(uid=*)(objectClass=sunIdentityServ erDevice))</tt></p>
<A NAME="fyfey"></A><h4>Classe d'objet d'agents LDAP</h4>
<p>D&eacute;finit les classes d'objet des agents. Lorsqu'un agent est cr&eacute;&eacute;, la liste des classes d'objet de l'utilisateur est ajout&eacute;e &agrave; la liste des attributs de l'agent.</p>
<A NAME="fyfew"></A><h4>Attributs d'agents LDAP</h4>
<p>D&eacute;finit la liste des attributs associ&eacute;s &agrave; un agent. Toute tentative de lecture/d'&eacute;criture des attributs d'agents autres que ceux figurant sur cette liste est interdite. La distinction majuscules/minuscules s'applique pour les attributs. Vous pouvez d&eacute;finir ici les classes d'objet et le sch&eacute;ma d'attribut uniquement s'ils sont d&eacute;j&agrave; d&eacute;finis dans Directory Server.</p>
<A NAME="fyfef"></A><h4>DN de base de la recherche persistante</h4>
<p>D&eacute;finit le DN de base &agrave; utiliser pour une recherche persistante. Certains serveurs LDAPv3 prennent en charge la recherche persistante uniquement au niveau du suffixe racine.</p>
<A NAME="fyffz"></A><h4>D&eacute;lai d'inactivit&eacute; maximal de la recherche persistante avant red&eacute;marrage</h4>
<p>D&eacute;finit le d&eacute;lai d'inactivit&eacute; maximal avant de red&eacute;marrer la recherche persistante. Cette valeur doit &ecirc;tre sup&eacute;rieure &agrave; 1. Les valeurs inf&eacute;rieures ou &eacute;gales &agrave; 1 red&eacute;marrent la recherche quel que soit le temps d'inactivit&eacute; de la connexion.</p>
<p>Si Access Manager est d&eacute;ploy&eacute; avec un &eacute;quilibreur de charge, certains &eacute;quilibreurs de charge seront interrompus apr&egrave;s un certain d&eacute;lai d'inactivit&eacute;. Dans ce cas, vous devez d&eacute;finir le d&eacute;lai d'inactivit&eacute; maximal de la recherche persistante avant red&eacute;marrage sur une valeur inf&eacute;rieure au temps sp&eacute;cifi&eacute; pour l'&eacute;quilibreur de charge. </p>
<A NAME="fyfgh"></A><h4>Nombre maximal de nouvelles tentatives apr&egrave;s r&eacute;ception de codes d'erreur</h4>
<p>D&eacute;finit le nombre maximal de tentatives de l'op&eacute;ration de recherche persistante si celle-ci rencontre les codes d'erreur sp&eacute;cifi&eacute;s dans les Codes d'erreur LDAPException suite auxquels une nouvelle tentative doit avoir lieu.</p>
<A NAME="fyfge"></A><h4>Le d&eacute;lai entre les nouvelles tentatives</h4>
<p>Indique le d&eacute;lai &agrave; observer avant chaque tentative. Cet attribut s'applique uniquement &agrave; la connexion de recherche persistante.</p>
<A NAME="fyffr"></A><h4>Codes d'erreur LDAPException suite auxquels une nouvelle tentative doit avoir lieu</h4>
<p>Indique les codes d'erreur apr&egrave;s lesquels une nouvelle tentative de recherche persistante doit &ecirc;tre effectu&eacute;e. Cet attribut s'applique uniquement &agrave; la recherche persistante, et non &agrave; toutes les op&eacute;rations LDAP.</p>

<br />

</body>
</html>
