<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Pour cr&#233;er une instance de serveur - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.serveradd"></a><h4>Pour cr&#233;er une instance de serveur</h4><p>Une entr&#233;e correspondant &#224; chaque serveur est automatiquement cr&#233;&#233;e dans la liste
des serveurs lorsque OpenSSO Configurator est lanc&#233; pour configurer des serveurs. Normalement,
ces op&#233;rations ne sont pas obligatoires.</p><ol>
<li><b>Connectez-vous &#224; la console OpenSSO en tant qu'administrateur niveau sup&#233;rieur.</b></li>
<li><b>Cliquez sur l'onglet Configuration, puis sur Sites et serveurs.</b></li>
<li><b>Cliquez sur Nouveau dans la liste des serveurs.</b></li>
<li><b>Entrez le nom de domaine complet (FQDN) du serveur &#224; ajouter, puis
cliquez sur OK.</b><p>Le FQDN doit avoir le format suivant&#160;: <tt>http</tt><i> (s)</i><tt>://</tt><i>h&#244;te.domaine</i><tt>:</tt><i>port </i><tt>/</tt><i>uri</i><tt></tt>.</p></li>
<li><b>L'instance de serveur nouvellement cr&#233;&#233;e appara&#238;t dans la liste.</b></li>
<li><b>Pour modifier le serveur, cliquez sur son nom. Vous pouvez configurer les
attributs de configuration du serveur.</b><p>Les param&#232;tres de serveur par d&#233;faut constituent le groupe de valeurs par
d&#233;faut des instances de serveur. Chaque instance de serveur doit comporter un
jeu minimal de valeurs de propri&#233;t&#233;s et, selon votre d&#233;ploiement, la plupart
de ces valeurs peuvent &#234;tre les m&#234;mes pour toutes les instances de
serveur. Ce param&#232;tre vous permet de sp&#233;cifier les propri&#233;t&#233;s de base en
un endroit, sans devoir les changer pour chaque instance de serveur suppl&#233;mentaire.
</p><p>Ces valeurs par d&#233;faut peuvent &#234;tre &#233;cras&#233;es. Pour ce faire, cliquez sur
le bouton Param&#232;tres d'h&#233;ritage, situ&#233; en haut de la page de profil
d'instance de serveur. Lorsque vous cliquez sur ce bouton, la console affiche
une page sur laquelle vous pouvez s&#233;lectionner et d&#233;s&#233;lectionner les valeurs dont
h&#233;riter et les valeurs &#224; &#233;craser. </p></li></ol>
<br/>

</body>
</html>
