<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>R&#233;initialisation du mot de passe - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.scserviceprofile.iplanetampasswordresetservice"></a><h4>R&#233;initialisation du mot de passe</h4>
<p><a name="indexterm-190"></a> Les attributs de r&#233;initialisation du mot de passe sont des attributs
de domaine. Ces attributs sont les suivants :</p>
<ul><li><p><a href="#fsuwe">Validation de l'utilisateur</a></p></li>
<li><p><a href="#fsuwd">Question secr&#232;te</a></p></li>
<li><p><a href="#fsuwh">Filtre de recherche</a></p></li>
<li><p><a href="#fsuwi">DN base</a></p></li>
<li><p><a href="#fsuwj">DN de liaison</a></p></li>
<li><p><a href="#fsuwl">Mot de passe de liaison</a></p></li>
<li><p><a href="#fsuwk">Option de r&#233;initialisation du mot de passe</a></p></li>
<li><p><a href="#fsuwq">Option de notification de changement du mot de passe</a></p></li>
<li><p><a href="#fsuwp">R&#233;initialisation du mot de passe</a></p></li>
<li><p><a href="#fsuwm">Question personnelle</a></p></li>
<li><p><a href="#fsuwo">Nombre max. de questions</a></p></li>
<li><p><a href="#fsuwn">Forcer le changement de mot de passe &#224; la connexion suivante</a></p></li>
<li><p><a href="#fsuwr">Verrouillage d'&#233;chec de r&#233;initialisation de mot de passe</a></p></li>
<li><p><a href="#fsuxh">Nombre de verrouillages d'&#233;chec de r&#233;initialisation de mot de passe</a></p></li>
<li><p><a href="#fsuww">Intervalle de verrouillage d'&#233;chec de r&#233;initialisation de mot de passe</a></p></li>
<li><p><a href="#fsuxg">Adresse &#233;lectronique o&#249; envoyer la notification de verrouillage</a></p></li>
<li><p><a href="#fsuwt">Avertir utilisateur apr&#232;s N &#233;checs</a></p></li>
<li><p><a href="#fsuxa">Dur&#233;e de verrouillage d'&#233;chec de r&#233;initialisation du mot de passe </a> </p></li>
<li><p><a href="#fsuxb">Nom d'attribut du verrouillage de r&#233;initialisation du mot de passe</a></p></li>
<li><p><a href="#fsuxt">Valeur de l'attribut de verrouillage de r&#233;initialisation du mot de passe</a></p></li></ul>


<a name="fsuwe"></a><h5>Validation de l'utilisateur</h5>
<p>Cet attribut sp&#233;cifie le nom de l'attribut utilis&#233; pour rechercher l'utilisateur dont
le mot de passe doit &#234;tre r&#233;initialis&#233;. </p>

<a name="fsuwd"></a><h5>Question secr&#232;te</h5>
<p>Ce champ vous permet d'ajouter une liste de questions que l'utilisateur peut
utiliser pour r&#233;initialiser son mot de passe. Pour ajouter une question, tapez-la
dans le champ Question secr&#232;te, puis cliquez sur Ajouter. Les questions s&#233;lectionn&#233;es
vont figurer dans la page du profil de l'utilisateur. L'utilisateur peut alors
s&#233;lectionner une question pour r&#233;initialiser le mot de passe. Les utilisateurs peuvent
cr&#233;er leur propre question si l'attribut Question personnelle activ&#233;e est s&#233;lectionn&#233;.</p>

<a name="fsuwh"></a><h5>Filtre de recherche</h5>
<p>Cet attribut sp&#233;cifie le filtre de recherche &#224; utiliser pour rechercher des
entr&#233;es utilisateur.</p>

<a name="fsuwi"></a><h5>DN base</h5>
<p>Cet attribut sp&#233;cifie le nom distinctif (DN) &#224; partir duquel d&#233;marre la
recherche utilisateur. Si aucun nom distinctif n'est sp&#233;cifi&#233;, la recherche d&#233;marre &#224;
partir du DN de domaine. Vous ne devez pas utiliser <tt>cn=directorymanager</tt> comme
DN de base, en raison de conflits d'authentification de proxy.</p>

<a name="fsuwj"></a><h5>DN de liaison</h5>
<p>Cette valeur d'attribut est utilis&#233;e avec le mot de passe de liaison
pour r&#233;initialiser le mot de passe de l'utilisateur.</p>

<a name="fsuwl"></a><h5>Mot de passe de liaison</h5>
<p>Cette valeur d'attribut est utilis&#233;e avec le DN de liaison pour r&#233;initialiser
le mot de passe de l'utilisateur.</p>

<a name="fsuwk"></a><h5>Option de r&#233;initialisation du mot de passe</h5>
<p>Cet attribut d&#233;termine le nom de classe pour la r&#233;initialisation du mot
de passe. Le nom de classe par d&#233;faut est <tt>com.sun.identity.password.RandomPasswordGenerator </tt> . La
classe de r&#233;initialisation de mot de passe peut &#234;tre personnalis&#233;e gr&#226;ce &#224;
un plug-in. Elle doit &#234;tre impl&#233;ment&#233;e par l'interface <tt>PasswordGenerator</tt>.</p>

<a name="fsuwq"></a><h5>Option de notification de changement du mot de passe</h5>
<p>Cet attribut d&#233;termine la m&#233;thode de notification &#224; l'utilisateur de la r&#233;initialisation
du mot de passe. Le nom de classe par d&#233;faut est <tt>com.sun.identity.password.EmailPassword </tt>
Il est possible de personnaliser la classe de notification de mot de
passe par l'interm&#233;diaire d'un plug-in. Elle doit &#234;tre impl&#233;ment&#233;e par l'interface <tt>NotifyPassword </tt>.
Reportez-vous au manuel OpenSSO Developer's Guide pour en savoir plus.</p>

<a name="fsuwp"></a><h5>R&#233;initialisation du mot de passe</h5>
<p>La s&#233;lection de cet attribut active la fonction de r&#233;initialisation du mot
de passe.</p>

<a name="fsuwm"></a><h5>Question personnelle</h5>
<p>La s&#233;lection de cet attribut permet &#224; l'utilisateur de cr&#233;er une question
unique pour la r&#233;initialisation du mot de passe.</p>

<a name="fsuwo"></a><h5>Nombre max. de questions</h5>
<p>Cette valeur sp&#233;cifie le nombre maximum de questions &#224; poser dans la
page de r&#233;initialisation de mot de passe.</p>

<a name="fsuwn"></a><h5>Forcer le changement de mot de passe &#224; la connexion suivante</h5>
<p>Lorsque cet attribut est activ&#233;, cette option contraint l'utilisateur &#224; modifier son
mot de passe lors de la connexion suivante. Si vous souhaitez qu'un
administrateur, autre que l'administrateur de niveau sup&#233;rieur, d&#233;finisse l'option de r&#233;initialisation forc&#233;e
du mot de passe, vous devez modifier les ACI d'autorisation par d&#233;faut
pour permettre l'acc&#232;s &#224; cet attribut.</p>

<a name="fsuwr"></a><h5>Verrouillage d'&#233;chec de r&#233;initialisation de mot de passe</h5>
<p>Cet attribut indique si les utilisateurs sont autoris&#233;s ou non &#224; r&#233;initialiser
leur mot de passe en cas d'&#233;chec de la r&#233;initialisation du mot
de passe &#224; l'aide de l'application R&#233;initialiser mot de passe. Par d&#233;faut,
cette fonction n'est pas activ&#233;e.</p>

<a name="fsuxh"></a><h5>Nombre de verrouillages d'&#233;chec de r&#233;initialisation de mot de passe</h5>
<p>Cet attribut d&#233;finit le nombre de tentatives de r&#233;initialisation d'un mot de
passe qu'un utilisateur peut effectuer, dans le d&#233;lai d&#233;fini dans le champ
Intervalle de verrouillage d'&#233;chec de r&#233;initialisation de mot de passe, avant d'&#234;tre
bloqu&#233;. Par exemple, si le nombre de verrouillage d'&#233;chec de r&#233;initialisation de
mot de passe est d&#233;fini sur 5 et l'intervalle de verrouillage d'&#233;chec
de connexion sur 5 minutes, l'utilisateur dispose de cinq chances dans un
intervalle de cinq minutes pour r&#233;initialiser le mot de passe avant d'&#234;tre
bloqu&#233;.</p>

<a name="fsuww"></a><h5>Intervalle de verrouillage d'&#233;chec de r&#233;initialisation de mot de passe</h5>
<p>Cet attribut d&#233;finit (en minutes) l'intervalle de temps durant lequel le nombre
d&#233;fini de tentatives de r&#233;initialisation du mot de passe (d&#233;fini dans le
champ Nombre de verrouillages d'&#233;chec de r&#233;initialisation de mot de passe) peut
&#234;tre effectu&#233; avant le blocage de l'utilisateur.</p>

<a name="fsuxg"></a><h5>Adresse &#233;lectronique o&#249; envoyer la notification de verrouillage</h5>
<p>Cet attribut d&#233;finit une adresse e-mail qui recevra la notification en cas
de blocage d'un utilisateur &#224; partir du service R&#233;initialisation du mot de
passe. Indiquez l'adresse e-mail dans une liste s&#233;par&#233;e par des espaces.</p>

<a name="fsuwt"></a><h5>Avertir utilisateur apr&#232;s N &#233;checs</h5>
<p>Cet attribut indique le nombre d'&#233;checs de r&#233;initialisation de mot de passe
au-del&#224; duquel OpenSSO envoie un message d'avertissement signalant que l'utilisateur sera bloqu&#233;.</p>

<a name="fsuxa"></a><h5>Dur&#233;e de verrouillage d'&#233;chec de r&#233;initialisation du mot de passe </h5>
<p>Cet attribut d&#233;finit (en minutes) le d&#233;lai durant lequel l'utilisateur ne pourra
pas tenter de r&#233;initialisation du mot de passe en cas de verrouillage.</p>

<a name="fsuxb"></a><h5>Nom d'attribut du verrouillage de r&#233;initialisation du mot de passe</h5>
<p>Cet attribut contient la valeur <i>inetuserstatus</i> qui est d&#233;finie dans le champ
Valeur de l'attribut de verrouillage de r&#233;initialisation du mot de passe. Si
un utilisateur est exclu de la r&#233;initialisation du mot de passe et
que la variable Dur&#233;e de verrouillage des &#233;checs de r&#233;initialisation du mot
de passe (en minutes) a pour valeur 0, <i>inetuserstatus</i> est inactif, emp&#234;chant
l'utilisateur de tenter de r&#233;initialiser son mot de passe.</p>

<a name="fsuxt"></a><h5>Valeur de l'attribut de verrouillage de r&#233;initialisation du mot de passe</h5>
<p>Cet attribut sp&#233;cifie la valeur de <i>inetuserstatus</i> (contenue dans le champ Nom
d'attribut du verrouillage de r&#233;initialisation du mot de passe) du statut de
l'utilisateur. Si un utilisateur est exclu de la r&#233;initialisation du mot de
passe et que la variable Dur&#233;e de verrouillage des &#233;checs de r&#233;initialisation
du mot de passe (en minutes) a pour valeur 0, <i>inetuserstatus</i> est
inactif, emp&#234;chant l'utilisateur de tenter de r&#233;initialiser son mot de passe.</p>
<br/>

</body>
</html>
