<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Serveurs et Sites - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.serversite"></a><h3>Serveurs et Sites</h3>
<p>Les attributs de configuration Serveurs et Sites permettent de centraliser la gestion
de la configuration des sites et des serveurs pour l'int&#233;gralit&#233; du d&#233;ploiement.
</p><p>Plusieurs (deux ou plus) instances OpenSSO peuvent &#234;tre d&#233;ploy&#233;es sur au moins
deux serveurs h&#244;tes diff&#233;rents. Par exemple, vous pouvez d&#233;ployer deux instances sur
un serveur et une troisi&#232;me sur un autre serveur. Ou vous pouvez
d&#233;ployer toutes les instances sur des serveurs diff&#233;rents. Vous pouvez aussi configurer
les instances OpenSSO en mode de basculement de session, si votre d&#233;ploiement
le n&#233;cessite.</p><p>Un ou plusieurs &#233;quilibreurs de charge acheminent les demandes clients vers les
diverses instances OpenSSO. Vous configurez chaque &#233;quilibreur de charge en fonction des
besoins de votre d&#233;ploiement (par exemple, pour utiliser la charge circulaire ou
moyenne) pour distribuer la charge entre les instances OpenSSO. Un &#233;quilibreur de
charge simplifie le d&#233;ploiement et permet de r&#233;soudre les probl&#232;mes li&#233;s par
exemple &#224; un pare-feu entre le client et les serveurs OpenSSO d'arri&#232;re-plan.
Vous pouvez utiliser un &#233;quilibreur de charge mat&#233;riel ou logiciel avec votre
d&#233;ploiement OpenSSO. Toutes les instances OpenSSO acc&#232;dent au m&#234;me serveur Directory Server.
</p>
<br/>

</body>
</html>
