<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Session - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.scserviceprofile.amsessionservice"></a><h4>Session</h4>
<p><a name="indexterm-196"></a>Le service Session d&#233;finit les valeurs d'une session d'utilisateur authentifi&#233;, comme la
dur&#233;e maximale de la session et la dur&#233;e d'inactivit&#233; maximale. Les attributs
de session sont des attributs globaux, dynamiques ou utilisateur. Ces attributs sont
les suivants :</p>
<ul><li><p><a href="#fwfeu">Instance de configuration secondaire</a></p></li>
<li><p><a href="#fwfew">Nombre maximal de r&#233;sultats renvoy&#233;s par la recherche</a></p></li>
<li><p><a href="#fwfex">D&#233;lai d'attente de recherche</a></p></li>
<li><p><a href="#fwfez">Activer les notifications de modification de propri&#233;t&#233;</a></p></li>
<li><p><a href="#fwfey">Activer les contraintes li&#233;es aux quotas</a></p></li>
<li><p><a href="#fwffa">Expiration du d&#233;lai de lecture de la contrainte li&#233;e aux quotas</a></p></li>
<li><p><a href="#fwffb">Exempter les administrateurs de niveau sup&#233;rieur de la v&#233;rification des contraintes</a></p></li>
<li><p><a href="#fwffc">Comportement observ&#233; en cas d'&#233;puisement du quota de sessions</a></p></li>
<li><p><a href="#fwffd">Propri&#233;t&#233;s de notification</a></p></li>
<li><p><a href="#fwffe">Dur&#233;e maximale de session</a></p></li>
<li><p><a href="#fwfff">Dur&#233;e maximale d'inactivit&#233;</a></p></li>
<li><p><a href="#fwffh">Dur&#233;e maximale de mise en cache</a></p></li>
<li><p><a href="#fwffi">Sessions utilisateur actives</a></p></li></ul>


<a name="fwfeu"></a><h5>Instance de configuration secondaire</h5>
<p>Fournit les informations de connexion pour le r&#233;f&#233;rentiel de session utilis&#233; pour
la fonction de reprise de session dans OpenSSO. L'URL de l'&#233;quilibreur de
charge doit &#234;tre fourni en tant qu'identificateur de cette configuration secondaire. Si
la configuration secondaire est d&#233;finie dans ce cadre, la fonction de reprise
de session sera automatiquement activ&#233;e et entrera en vigueur au red&#233;marrage du
serveur. Pour plus d'informations, reportez-vous &#224; <a href="service.subconfigadd.html">Ajout d'une configuration secondaire</a>.</p>

<a name="fwfew"></a><h5>Nombre maximal de r&#233;sultats renvoy&#233;s par la recherche</h5>
<p>Cet attribut sp&#233;cifie le nombre maximal de r&#233;sultats renvoy&#233;s par une recherche
de session. La valeur par d&#233;faut est 120.</p>

<a name="fwfex"></a><h5>D&#233;lai d'attente de recherche</h5>
<p>Cet attribut d&#233;finit la dur&#233;e maximale avant expiration d'une recherche de session.
La valeur par d&#233;faut est 5 secondes.</p>

<a name="fwfez"></a><h5>Activer les notifications de modification de propri&#233;t&#233;</h5>
<p>Active ou d&#233;sactive la notification de modification d'une propri&#233;t&#233; de session. Dans
un environnement de connexion unique, une session OpenSSO peut &#234;tre partag&#233;e par
plusieurs applications. Lorsque cette fonctionnalit&#233; est activ&#233;e, si une application modifie une
des propri&#233;t&#233;s de session sp&#233;cifi&#233;es dans la liste Propri&#233;t&#233;s de notification (d&#233;finie
en tant qu'attribut de service de session distinct), la notification est envoy&#233;e
aux autres applications faisant partie de cet environnement de connexion unique.</p>

<a name="fwfey"></a><h5>Activer les contraintes li&#233;es aux quotas</h5>
<p>Active ou d&#233;sactive les contraintes li&#233;es aux quotas. L'application de contraintes li&#233;es
aux quotas de session permet aux administrateurs de limiter le nombre de
sessions actives/simultan&#233;es pour un utilisateur en fonction des param&#232;tres de contraintes d&#233;finis
au niveau global ou des configurations associ&#233;es aux entit&#233;s (domaine/r&#244;le/utilisateur) auxquelles il
appartient.</p><p>La valeur par d&#233;faut pour cet attribut est OFF. Vous devez red&#233;marrer
le serveur si les param&#232;tres sont modifi&#233;s.</p>

<a name="fwffa"></a><h5>Expiration du d&#233;lai de lecture de la contrainte li&#233;e aux quotas</h5>
<p>D&#233;finit la dur&#233;e (en millisecondes) de validit&#233; avant expiration d'une interrogation du
r&#233;f&#233;rentiel de session sur le nombre de sessions utilisateur actives.</p><p>Une fois la dur&#233;e maximale de lecture atteinte, une erreur est renvoy&#233;e.
Cet attribut n'a d'effet que si la contrainte li&#233;e aux quotas de
session est activ&#233;e dans le d&#233;ploiement de reprise de session. La valeur
par d&#233;faut est de 6000 millisecondes. Vous devez red&#233;marrer le serveur si
les param&#232;tres sont modifi&#233;s.</p>

<a name="fwffb"></a><h5>Exempter les administrateurs de niveau sup&#233;rieur de la v&#233;rification des contraintes</h5>
<p>Indique si les utilisateurs dot&#233;s du r&#244;le d'administrateur de niveau sup&#233;rieur doivent
&#234;tre exempt&#233;s des v&#233;rifications de contraintes de session. Si OUI, m&#234;me si
les contraintes de sessions sont activ&#233;es, aucune v&#233;rification des contraintes li&#233;es aux
quotas de session n'est effectu&#233;e pour ces administrateurs.</p><p>Par d&#233;faut, cet attribut est r&#233;gl&#233; sur NO. Vous devez red&#233;marrer le
serveur si les param&#232;tres sont modifi&#233;s. Cet attribut s'appliquera uniquement si la
contrainte li&#233;e aux quotas de session est activ&#233;e.</p>
<hr><p><b>Remarque &#8211; </b>Le superutilisateur d&#233;fini pour OpenSSO dans <tt>AMConfig.properties</tt> (<tt>com.sun.identity.authentication.super.user</tt>) est toujours exempt&#233; des
v&#233;rifications de contraintes li&#233;es aux quotas de session. </p>
<hr>


<a name="fwffc"></a><h5>Comportement observ&#233; en cas d'&#233;puisement du quota de sessions</h5>
<p>Sp&#233;cifie le comportement r&#233;sultant lorsque le quota de sessions d'un utilisateur est
&#233;puis&#233;. Deux options peuvent &#234;tre s&#233;lectionn&#233;es pour cet attribut :</p><dl><dt>DESTROY_OLD_SESSION</dt>
<dd><p>La prochaine session arrivant &#224; expiration sera supprim&#233;e.</p></dd>
<dt>DENY_ACCESS</dt>
<dd><p>La prochaine demande de cr&#233;ation de session sera refus&#233;e.</p></dd>
</dl>
<p>Cet attribut n'a d'effet que si la contrainte li&#233;e aux quotas de
session est activ&#233;e et si la valeur par d&#233;faut de ce param&#232;tre
est DESTROY_OLD_SESSION.</p>

<a name="ggyer"></a><h5>Refuser la connexion de l'utilisateur lorsque le r&#233;f&#233;rentiel de session ne fonctionne pas</h5>
<p>S'il est activ&#233;, cet attribut verrouille les utilisateurs sur le serveur lorsque
le r&#233;f&#233;rentiel de session ne fonctionne pas. Cet attribut s'applique uniquement lorsque
la session Activer les contraintes li&#233;es aux quotas est s&#233;lectionn&#233;e.</p>

<a name="fwffd"></a><h5>Propri&#233;t&#233;s de notification</h5>
<p>Lorsqu'une modification intervient sur une propri&#233;t&#233; de session d&#233;finie dans la liste,
la notification est envoy&#233;e aux listeners enregistr&#233;s. Cet attribut n'a d'effet que
si la fonctionnalit&#233; de Notification de modification de propri&#233;t&#233; de session est
activ&#233;e.</p>

<a name="fwffe"></a><h5>Dur&#233;e maximale de session</h5>
<p>Cet attribut accepte une valeur en minutes pour exprimer la dur&#233;e maximale
avant qu'une session n'arrive &#224; expiration et que l'utilisateur doive se r&#233;authentifier
pour b&#233;n&#233;ficier &#224; nouveau d'un acc&#232;s. Une valeur sup&#233;rieure ou &#233;gale &#224;
1 est accept&#233;e. La valeur par d&#233;faut est 120. Pour trouver le
bon compromis entre s&#233;curit&#233; et confort, r&#233;glez l'intervalle de dur&#233;e maximale de
session sur une valeur sup&#233;rieure et l'intervalle de dur&#233;e maximale d'inactivit&#233; sur
une valeur relativement faible. La dur&#233;e maximale de session limite la validit&#233;
de la session dans le temps. Elle ne peut &#234;tre &#233;tendue au-del&#224;
de la valeur configur&#233;e.</p>

<a name="fwfff"></a><h5>Dur&#233;e maximale d'inactivit&#233;</h5>
<p>Cet attribut accepte une valeur en minutes pour exprimer la dur&#233;e maximale
d'inactivit&#233; avant qu'une session n'arrive &#224; expiration et que l'utilisateur doive se
r&#233;authentifier pour b&#233;n&#233;ficier &#224; nouveau d'un acc&#232;s. Une valeur sup&#233;rieure ou &#233;gale
&#224; 1 est accept&#233;e. La valeur par d&#233;faut est 30. Pour trouver
le bon compromis entre s&#233;curit&#233; et confort, r&#233;glez l'intervalle de dur&#233;e maximale
de session sur une valeur sup&#233;rieure et l'intervalle de dur&#233;e maximale d'inactivit&#233;
sur une valeur relativement faible.</p>

<a name="fwffh"></a><h5>Dur&#233;e maximale de mise en cache</h5>
<p>Cet attribut accepte une valeur en minutes correspondant &#224; l'intervalle maximal avant
que le client ne doive contacter OpenSSO pour rafra&#238;chir les informations de
session en m&#233;moire cache. Une valeur sup&#233;rieure ou &#233;gale &#224; 0 est
accept&#233;e. La valeur par d&#233;faut est 3. La dur&#233;e maximale de mise
en cache doit toujours &#234;tre inf&#233;rieure &#224; la dur&#233;e maximale d'inactivit&#233;.</p>

<a name="fwffi"></a><h5>Sessions utilisateur actives</h5>
<p>Indique le nombre maximal de sessions simultan&#233;es autoris&#233;es pour un utilisateur.</p>
<br/>

</body>
</html>
