<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@12751-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Gestionnaire de clients
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2005 Sun Microsystems, Inc. Tous droits r&eacute;serv&eacute;s." />
</head>

<body class="HlpBdy">

<A NAME="service.mapclientmanager"></A><h3>Gestionnaire de clients</h3>
<p><A NAME="indexterm-196"></A>Le Gestionnaire de clients est l'interface r&eacute;pertoriant les clients de base, leurs styles et leurs propri&eacute;t&eacute;s, et qui vous permet d'ajouter et de configurer des p&eacute;riph&eacute;riques. </p>
<A NAME="fxixg"></A><h4>Type de client de base</h4>
<p>Les types de client de base sont r&eacute;pertori&eacute;s en haut du gestionnaire de clients. Ces types de client contiennent les propri&eacute;t&eacute;s par d&eacute;faut dont peuvent h&eacute;riter tous les p&eacute;riph&eacute;riques faisant partie de ce type de client.</p>
<A NAME="fxixu"></A><h4>Type de client</h4>
<p>Profil de style : le Gestionnaire de clients regroupe tous les clients disponibles, y compris le client de base, dans la liste des types de client. Vous pouvez modifier les propri&eacute;t&eacute;s de chaque client en cliquant sur le nom du p&eacute;riph&eacute;rique. Les propri&eacute;t&eacute;s sont ensuite affich&eacute;es dans la fen&ecirc;tre &Eacute;diteur du client. Pour modifier les propri&eacute;t&eacute;s, s&eacute;lectionnez les classifications suivantes dans la liste d&eacute;roulante&nbsp;: </p>
<p><hr size="1" noshade><p><b>Remarque&nbsp;- </b>Pour les d&eacute;finitions sp&eacute;cifiques des propri&eacute;t&eacute;s, reportez-vous au document <i>Open Mobile Alliance Ltd. (OMA) Wireless Application Protocol, Version 20-Oct-2001</i> &agrave; l'adresse <A HREF="http://www1.wapforum.org/tech/terms.asp?doc=WAP-248-UAProf-20011020-a.pdf">http://www1.wapforum.org/tech/terms.asp?doc=WAP-248-UAProf-20011020-a.pdf</A>.
  </p>
<p>Pour pouvoir acc&eacute;der au document, vous devez au pr&eacute;alable vous enregistrer aupr&egrave;s de WAP Forum&#153;. Pour plus d'informations, consultez le site <A HREF="http://www.wapforum.org/faqs/index.htm">http://www.wapforum.org/faqs/index.htm</A>.</p>
<hr size="1" noshade></p><A NAME="fxizp"></A><h5>Plate-forme mat&eacute;rielle</h5>
<p>Contient les propri&eacute;t&eacute;s concernant le mat&eacute;riel du p&eacute;riph&eacute;rique, par exemple la taille de l'&eacute;cran, les jeux de caract&egrave;res pris en charge, etc.</p>
<A NAME="fxjay"></A><h5>Plate-forme logicielle</h5>
<p>Contient les propri&eacute;t&eacute;s de l'environnement d'application du p&eacute;riph&eacute;rique, du syst&egrave;me d'exploitation et des logiciels install&eacute;s. </p>
<A NAME="fxjaw"></A><h5>Caract&eacute;ristiques du r&eacute;seau</h5>
<p>Contient les propri&eacute;t&eacute;s d&eacute;crivant l'environnement r&eacute;seau, notamment les services support pris en charge.</p>
<A NAME="fxiyr"></A><h5>BrowserUA</h5>
<p>Contient les attributs li&eacute;s &agrave; l'agent utilisateur du navigateur ex&eacute;cut&eacute; sur le p&eacute;riph&eacute;rique. </p>
<A NAME="fxiwv"></A><h5>WapCharacteristics</h5>
<p>Contient les propri&eacute;t&eacute;s de l'environnement WAP (Wireless Application Protocol) pris en charge par le p&eacute;riph&eacute;rique. </p>
<A NAME="fxjal"></A><h5>PushCharacteristicNames</h5>
<p>Contient les propri&eacute;t&eacute;s de l'environnement WAP pris en charge par le p&eacute;riph&eacute;rique.</p>
<A NAME="fxjbu"></A><h5>Autres propri&eacute;t&eacute;s</h5>
<p>Autres propri&eacute;t&eacute;s Vous permet de d&eacute;finir d'autres propri&eacute;t&eacute;s pour le p&eacute;riph&eacute;rique.</p>

<br />

</body>
</html>
