<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Composants des t&#226;ches courantes - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="task.home"></a><h3>Composants des t&#226;ches courantes</h3>
<p>Consultez la documentation en ligne ou cliquez sur l'ic&#244;ne situ&#233;e en regard
de chaque t&#226;che courante pour en obtenir les informations sp&#233;cifiques.</p><p>OpenSSO comporte les flux de travaux suivants&#160;:</p><dl><dt>Cr&#233;er des fournisseurs SAMLv2</dt>
<dd><p>Ce flux de travaux vous permet de cr&#233;er des entit&#233;s de fournisseur de service et de fournisseur d'identit&#233; bas&#233;es sur le protocole SAMLv2. Les deux types de fournisseur peuvent &#234;tre h&#233;berg&#233;s ou distants. Pour les cr&#233;er, il est n&#233;cessaire de fournir les informations de bases relatives aux fournisseurs, telles que le cercle de confiance (COT, Circle of Trust) auquel le fournisseur appartient et les m&#233;tadonn&#233;es du fournisseur. Pour conna&#238;tre les informations g&#233;n&#233;rales sur les fournisseurs SAMLv2, voir <a href="ggwxp.html">Entit&#233; de fournisseur SAMLv2</a>. Sinon, suivez les instructions &#224; l'&#233;cran.</p></dd>
<dt>Cr&#233;er un Fedlet</dt>
<dd><p>Un Fedlet est un petit fichier ZIP pouvant &#234;tre transmis &#224; un fournisseur de services pour obtenir une f&#233;d&#233;ration imm&#233;diate &#224; un fournisseur d'identit&#233;s configur&#233; avec OpenSSO. C'est la solution id&#233;ale pour un fournisseur d'identit&#233;s qui doit activer un fournisseur de services sans aucune solution de f&#233;d&#233;ration. Le fournisseur de services ajoute simplement le Fedlet &#224; son application et d&#233;ploie cette derni&#232;re pour activer la f&#233;d&#233;ration. Veuillez consultez le manuel <a href="http://docs.sun.com/doc/820-3885"><i>Sun OpenSSO Enterprise&#160;8.0 Administration Guide</i></a> pour plus d'informations sur le d&#233;ploiement de cette application.</p></dd>
</dl>
<dl><dt>V&#233;rifier la connectivit&#233; de la f&#233;d&#233;ration</dt>
<dd><p>Ce test v&#233;rifie si les connexions de f&#233;d&#233;ration sont &#233;tablies et localise les probl&#232;mes &#233;ventuels.</p></dd>
<dt>Acc&#233;der &#224; la documentation</dt>
<dd><p>Cette t&#226;che courante ouvre la page de documentation sur OpenSSO. Celle-ci contient les questions les plus fr&#233;quemment pos&#233;es, la documentation sur les produits, la documentation d'ing&#233;nierie, ainsi que des liens pointant vers les blogs de la communaut&#233;.</p></dd>
<dt>Enregistrer votre produit</dt>
<dd><p>Ce lien vous permet d'enregistrer votre produit avec Sun Connection. Vous devez disposer d'un compte en ligne Sun pour effectuer l'enregistrement. Si vous n'en disposez pas, vous pouvez en demander un au cours de ce processus.</p></dd>
</dl>

<br/>

</body>
</html>
