#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amPasswordResetModuleMsgs_ja.properties,v 1.11 2009/12/26 03:51:45 cbasha Exp $
#
#

pwResetSuccess.title=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u78ba\u8a8d
pwConsole.title=OpenAM (\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8)
userValidate.title=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30ea\u30bb\u30c3\u30c8\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u306e\u691c\u8a3c
pwQuestion.title={0} \u3078\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u8cea\u554f

#
# buttons
#
next.button=\u6b21\u3078
previous.button=\u623b\u308b
ok.button=\u4e86\u89e3

#
# message titles
#
error.title=\u30a8\u30e9\u30fc
invalidURL.title=\u7121\u52b9\u306a URL
uncaughtException.title=\u30a8\u30e9\u30fc

#
# message and error
#
userNotExists.message=\u3053\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30ea\u30bb\u30c3\u30c8\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
logUserNotExists.message=\u7121\u52b9\u306a\u30e6\u30fc\u30b6\u30fc {0} \u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u304c\u8a66\u307f\u3089\u308c\u307e\u3057\u305f\u3002
multipleUsersExists.message=\u8907\u6570\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u6307\u5b9a\u306e\u5024\u3068\u4e00\u81f4\u3057\u307e\u3059\u3002\u5225\u306e\u5024\u3092\u5165\u529b\u3059\u308b\u304b\u3001\u7ba1\u7406\u8005\u306b\u76f8\u8ac7\u3057\u3066\u304f\u3060\u3055\u3044\u3002
passResetError.message=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002\u7ba1\u7406\u8005\u306b\u76f8\u8ac7\u3057\u3066\u304f\u3060\u3055\u3044\u3002
emailNotify.message=\u65b0\u898f\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u3064\u3044\u3066\u306e\u96fb\u5b50\u30e1\u30fc\u30eb\u304c\u30e6\u30fc\u30b6\u30fc\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u5b9b\u306b\u9001\u4fe1\u3055\u308c\u307e\u3057\u305f\u3002
wrongAnswer.message=\u9593\u9055\u3063\u305f\u7b54\u3048\u304c\u5165\u529b\u3055\u308c\u307e\u3057\u305f\u3002
resetPassMail.message=OpenAM \u30d1\u30b9\u30ef\u30fc\u30c9\u306f {0} \u306b\u5909\u66f4\u3055\u308c\u3066\u3044\u307e\u3059\u3002
noQuestions.message=\u30e6\u30fc\u30b6\u30fc\u7528\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u8cea\u554f\u306f\u3042\u308a\u307e\u305b\u3093\u3002
noAnswers.message=\u79d8\u5bc6\u306e\u8cea\u554f\u306e\u7b54\u3048\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
attemptEmail.message=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u304c\u8a66\u307f\u3089\u308c\u307e\u3057\u305f\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u30ea\u30bb\u30c3\u30c8\u3092\u884c\u3063\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
resetSubject.message=OpenAM \u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8
attemptSubject.message=OpenAM \u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8
pwResetDisabled.message=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u30b5\u30fc\u30d3\u30b9\u306f\u73fe\u5728\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
missingUserAttr.message=\u5024\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
missingAnswer.message=\u3059\u3079\u3066\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u5024\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
invalidURL.message=\u5165\u529b\u3057\u305f URL \u304c\u7121\u52b9\u3067\u3059\u3002
uncaughtException.message=\u3053\u306e\u8981\u6c42\u3092\u51e6\u7406\u3059\u308b\u969b\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
noEmail.message=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u9001\u4fe1\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
userNotActive.message=\u3053\u306e\u30e6\u30fc\u30b6\u30fc\u306f\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
userAccountExpired.message=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u671f\u9650\u5207\u308c\u3067\u3059\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
sendEmailFailed.message=\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u30ea\u30bb\u30c3\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u304c\u3001\u9001\u4fe1\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002

#
# labels
#
fromAddress.label=<Password-Administrator>
sunLogo.label=Sun Microsystems \u30ed\u30b4
product.label=OpenAM
javaLogo.label=Sun Java System \u30bd\u30d5\u30c8\u30a6\u30a7\u30a2

#
# copyright text
#
copyright.text=Copyright \u00a9 2008 Sun Microsystems, Inc. All rights reserved.  Sun Microsystems, Inc. \u306f\u3001\u3053\u306e\u88fd\u54c1\u306b\u542b\u307e\u308c\u308b\u30c6\u30af\u30ce\u30ed\u30b8\u306b\u95a2\u3059\u308b\u77e5\u7684\u6240\u6709\u6a29\u3092\u4fdd\u6301\u3057\u3066\u3044\u307e\u3059\u3002\u7279\u306b\u9650\u5b9a\u3055\u308c\u308b\u3053\u3068\u306a\u304f\u3001\u3053\u308c\u3089\u306e\u77e5\u7684\u6240\u6709\u6a29\u306f http://www.sun.com/patents \u306b\u8a18\u8f09\u3055\u308c\u3066\u3044\u308b 1 \u3064\u4ee5\u4e0a\u306e\u7c73\u56fd\u7279\u8a31\u304a\u3088\u3073\u7c73\u56fd\u304a\u3088\u3073\u305d\u306e\u4ed6\u306e\u56fd\u306b\u304a\u3051\u308b 1 \u3064\u4ee5\u4e0a\u306e\u8ffd\u52a0\u7279\u8a31\u307e\u305f\u306f\u7279\u8a31\u51fa\u9858\u4e2d\u306e\u3082\u306e\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002U.S. Government Rights - Commercial software. Government users are subject to the Sun Microsystems, Inc. standard license agreement and applicable provisions of the FAR and its supplements.  \u3054\u4f7f\u7528\u306f\u3001\u30e9\u30a4\u30bb\u30f3\u30b9\u6761\u9805\u306b\u5f93\u3063\u3066\u304f\u3060\u3055\u3044\u3002\u3053\u306e\u914d\u5e03\u306b\u306f\u3001\u30b5\u30fc\u30c9\u30d1\u30fc\u30c6\u30a3\u30fc\u306e\u958b\u767a\u3057\u305f\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002Sun\u3001Sun Microsystems \u304a\u3088\u3073\u30b5\u30f3\u306e\u30ed\u30b4\u30de\u30fc\u30af\u306f\u3001\u7c73\u56fd\u304a\u3088\u3073\u305d\u306e\u4ed6\u306e\u56fd\u306b\u304a\u3051\u308b Sun Microsystems, Inc. \u306e\u5546\u6a19\u3082\u3057\u304f\u306f\u767b\u9332\u5546\u6a19\u3067\u3059\u3002<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

################################################################################
#
# logging messages
#
accountInactive.message=\u30e6\u30fc\u30b6\u30fc {0} \u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
accountExpired.message=\u30e6\u30fc\u30b6\u30fc {0} \u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u671f\u9650\u5207\u308c\u3067\u3059\u3002
accountLocked.message=\u30e6\u30fc\u30b6\u30fc {0} \u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
accountLockout.message=\u9023\u7d9a\u3057\u3066\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306b\u5931\u6557\u3057\u305f\u305f\u3081\u3001{0} \u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306f\u975e\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u306a\u308a\u307e\u3057\u305f\u3002
pwResetSuccess.message=\u30e6\u30fc\u30b6\u30fc {0} \u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
pwResetFail.message=\u30e6\u30fc\u30b6\u30fc {0} \u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002

################################################################################
#
# Password Reset lockout messages
#
lockOutEmailFrom=<Password-Administrator>
lockOutEmailSub=\u8b66\u544a : \u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u901a\u77e5
lockoutMsg.message=\u9023\u7d9a\u3057\u3066\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306b\u5931\u6557\u3057\u305f\u305f\u3081\u3001\u3053\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306f\u975e\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u306a\u308a\u307e\u3057\u305f\u3002
lockOutEmailMsg=\u9023\u7d9a\u3057\u3066\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306b\u5931\u6557\u3057\u305f\u305f\u3081\u3001{0} \u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306f\u975e\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u306a\u308a\u307e\u3057\u305f\u3002
lockoutWarning.message=\u5165\u529b\u3057\u305f\u56de\u7b54\u306f\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002\u56de\u7b54\u3092\u3042\u3068 {0} \u56de\u5931\u6557\u3059\u308b\u3068\u3001\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3055\u308c\u307e\u3059\u3002
