#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2009 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: CoreToken_ja.properties,v 1.1 2009/12/26 03:51:43 cbasha Exp $
#
#

onlinehelp.doc=coretoken.html
sunCoreTokenConfigServiceDescription=\u30b3\u30a2\u30c8\u30fc\u30af\u30f3\u30b5\u30fc\u30d3\u30b9
a101=\u691c\u7d22\u53ef\u80fd\u306a\u5c5e\u6027\u306e\u30ea\u30b9\u30c8
a101.help=\u30c8\u30fc\u30af\u30f3\u691c\u7d22\u64cd\u4f5c\u3067\u4f7f\u7528\u3059\u308b\u5c5e\u6027\u540d\u306e\u30ea\u30b9\u30c8\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u691c\u7d22\u306e\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u3092\u5411\u4e0a\u3059\u308b\u305f\u3081\u306b\u5c5e\u6027\u306e\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u304c\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002\u30ea\u30b9\u30c8\u306b\u691c\u7d22\u5c5e\u6027\u304c\u306a\u3044\u5834\u5408\u3001\u30c8\u30fc\u30af\u30f3\u691c\u7d22\u64cd\u4f5c\u306f\u62d2\u5426\u3055\u308c\u307e\u3059\u3002 
a102=\u30c8\u30fc\u30af\u30f3\u306e\u671f\u9650\u5207\u308c\u306b\u5bfe\u3059\u308b\u30c8\u30fc\u30af\u30f3\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u9593\u9694 (\u79d2\u5358\u4f4d)
a102.help=0 \u3092\u6307\u5b9a\u3059\u308b\u3068\u3001\u30c8\u30fc\u30af\u30f3\u306e\u671f\u9650\u5207\u308c\u306b\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u306f\u5fc5\u8981\u3042\u308a\u307e\u305b\u3093\u3002
a103=ETag \u306e\u306a\u3044\u30c8\u30fc\u30af\u30f3\u30bf\u30a4\u30d7\u306e\u5f37\u5236

# Exception error code
10=\u7121\u52b9\u306a\u65e5\u4ed8\u5f62\u5f0f {0} \u3002
11=\u30c8\u30fc\u30af\u30f3\u306f {0} \u306b\u671f\u9650\u304c\u5207\u308c\u3066\u3044\u307e\u3059\u3002
20=\u7121\u52b9\u306a\u30c8\u30fc\u30af\u30f3\u30bf\u30a4\u30d7 {0} \u3002
#30=Invalid JSON encode attribute values.

201=\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u306b token.id \u5c5e\u6027\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\u3002\u30c8\u30fc\u30af\u30f3\u3092\u4f5c\u6210\u3059\u308b POST \u8981\u6c42\u306b\u6307\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
202=\u30c8\u30fc\u30af\u30f3\u30b9\u30c8\u30a2\u306b\u30c8\u30fc\u30af\u30f3\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
203=\u6307\u5b9a\u3057\u305f token.id \u3092\u6301\u3064\u30c8\u30fc\u30af\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
204=\u30c8\u30fc\u30af\u30f3\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002
205=\u30c8\u30fc\u30af\u30f3\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
206=\u30c8\u30fc\u30af\u30f3\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002
#207=Unable to parse JSON encoded attribute value from token {0}.
208=\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30bf\u30b0 {0} \u304c\u73fe\u5728\u306e\u30c8\u30fc\u30af\u30f3\u306e\u30bf\u30b0\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
209=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30c8\u30fc\u30af\u30f3\u3092\u8aad\u307f\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
210=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30c8\u30fc\u30af\u30f3\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002
211=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30c8\u30fc\u30af\u30f3\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
212=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30c8\u30fc\u30af\u30f3\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
215=\u30c8\u30fc\u30af\u30f3\u3092\u691c\u7d22\u3067\u304d\u307e\u305b\u3093\u3002
216=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30c8\u30fc\u30af\u30f3\u3092\u691c\u7d22\u3067\u304d\u307e\u305b\u3093\u3002
217=\u8981\u6c42\u306b {0} \u5c5e\u6027\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u64cd\u4f5c\u306b\u306f\u3053\u306e\u5c5e\u6027\u304c\u5fc5\u8981\u3067\u3059\u3002
218=\u691c\u7d22\u8981\u6c42\u306b\u30af\u30a8\u30ea\u30fc\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
219=\u691c\u7d22\u8981\u6c42\u306b\u6307\u5b9a\u3055\u308c\u305f\u30af\u30a8\u30ea\u30fc\u30d1\u30e9\u30e1\u30fc\u30bf\u306e {0} \u306f\u7121\u52b9\u3067\u3059\u3002

220=HTTP \u8981\u6c42\u306b If-Match \u30d8\u30c3\u30c0\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u64cd\u4f5c\u306b\u306f\u3053\u306e\u30d8\u30c3\u30c0\u30fc\u304c\u5fc5\u8981\u3067\u3059\u3002
221=token.id \u5c5e\u6027\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
222=\u8981\u6c42\u306b {0} \u5c5e\u6027\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u64cd\u4f5c\u306b\u306f\u3053\u306e\u5c5e\u6027\u304c\u5fc5\u8981\u3067\u3059\u3002
223=\u8981\u6c42\u306b\u6307\u5b9a\u3055\u308c\u305f\u5c5e\u6027 {0} \u306f\u3001\u691c\u7d22\u53ef\u80fd\u306a\u5c5e\u6027\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
224=token.type \u5c5e\u6027\u306f\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
225=\u30c8\u30fc\u30af\u30f3\u5c5e\u6027\u540d\u306e {0} \u306f\u7121\u52b9\u3067\u3059\u3002"token." \u306e\u30d7\u30ec\u30d5\u30a3\u30c3\u30af\u30b9\u304c\u4ed8\u3044\u305f\u5c5e\u6027\u540d\u306f\u3001\u30c8\u30fc\u30af\u30f3\u30b5\u30fc\u30d3\u30b9\u5c02\u7528\u3068\u3057\u3066\u4e88\u7d04\u3055\u308c\u3066\u3044\u307e\u3059\u3002
226=\u8981\u6c42\u306b\u542b\u307e\u308c\u308b\u5c5e\u6027 {0} \u306f\u3001\u5358\u4e00\u5024\u578b\u306e\u5c5e\u6027\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
227=\u30c8\u30fc\u30af\u30f3\u5c5e\u6027\u540d\u306e {0} \u306f\u7121\u52b9\u3067\u3059\u3002\u5c5e\u6027\u540d\u306b\u306f\u30c8\u30fc\u30af\u30f3\u30bf\u30a4\u30d7\u3092\u30d7\u30ec\u30d5\u30a3\u30c3\u30af\u30b9\u3068\u3057\u3066\u4ed8\u3051\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

301=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3042\u308b\u304b\u3001\u671f\u9650\u304c\u5207\u308c\u3066\u3044\u307e\u3059\u3002\u4e00\u822c\u7684\u306b\u3001\u3053\u306e\u72b6\u6cc1\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u30a2\u30a4\u30c9\u30eb\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u305f\u304b\u3001\u5225\u306e\u53c2\u52a0\u8005\u306b\u3088\u3063\u3066\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u5316\u3055\u308c\u305f\u5834\u5408\u306b\u767a\u751f\u3057\u307e\u3059\u3002
302=\u30b3\u30a2\u30c8\u30fc\u30af\u30f3\u30b9\u30c8\u30a2\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
