/**
 * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
 *
 * Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
 *
 * The contents of this file are subject to the terms
 * of the Common Development and Distribution License
 * (the License). You may not use this file except in
 * compliance with the License.
 *
 * You can obtain a copy of the License at
 * https://opensso.dev.java.net/public/CDDLv1.0.html or
 * opensso/legal/CDDLv1.0.txt
 * See the License for the specific language governing
 * permission and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL
 * Header Notice in each file and include the License file
 * at opensso/legal/CDDLv1.0.txt.
 * If applicable, add the following below the CDDL Header,
 * with the fields enclosed by brackets [] replaced by
 * your own identifying information:
 * "Portions Copyrighted [year] [name of copyright owner]"
 *
 * $Id: ServerConfigService_ja.properties,v 1.3 2009/12/26 03:51:44 cbasha Exp $
 *
 */

#General
service-start-msg=\u30b5\u30fc\u30d0\u30fc\u8a2d\u5b9a\u30b5\u30fc\u30d3\u30b9\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f...
service-done-msg=\u30b5\u30fc\u30d0\u30fc\u8a2d\u5b9a\u30b5\u30fc\u30d3\u30b9\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f...
invalid-bootstrap-location= \u7121\u52b9\u306a\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u4f4d\u7f6e:
cannot-bootstrap-system=\u30b7\u30b9\u30c6\u30e0\u3092\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
cannot-load-properties=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093: {0}
msg-fail=\u5931\u6557
msg-pass=\u6210\u529f
msg-ok=\u4e86\u89e3

svr-auth-msg=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f
#
#SAML general message
#
saml-validate-cfg=SAML \u306e\u8a2d\u5b9a\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059\u3002
saml-validate-cfg-prop=SAML \u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059\u3002
saml-file-loc=\u30d5\u30a1\u30a4\u30eb: {0}

#store password related 
saml-validate-storepwd-prop=\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
saml-invalid-storepwd-prop=\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
saml-storepwd-file-not-exist=\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093: {0}
saml-invalid-storepass-file=\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u307e\u305f\u306f\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u7121\u52b9\u3067\u3059: {0}
saml-invalid-storepassd=\u7121\u52b9\u306a\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9
saml-storepass-empty=\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002\u30d5\u30a1\u30a4\u30eb\u304c\u7a7a\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

#key password related 
saml-keypwd-file-not-exist=\u30ad\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093: {0}
saml-invalid-keypass-file=\u30ad\u30fc\u30d1\u30b9\u306e\u30d5\u30a1\u30a4\u30eb\u30d1\u30b9/\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u7121\u52b9\u3067\u3059: {0}
saml-validate-keypwd-prop=\u30ad\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
saml-invalid-keypwd-prop=\u30ad\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
saml-keypass-empty=\u30ad\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002\u30d5\u30a1\u30a4\u30eb\u304c\u7a7a\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
saml-invalid-keypassd=\u7121\u52b9\u306a\u30ad\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9

#key store related 
saml-validate-keystore-prop=\u30ad\u30fc\u30b9\u30c8\u30a2\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
saml-invalid-keystore-prop=\u30ad\u30fc\u30b9\u30c8\u30a2\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
saml-validate-keystore-pwd=\u30ad\u30fc\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
saml-invalid-keystore-file=\u30ad\u30fc\u30b9\u30c8\u30a2\u306e\u30d5\u30a1\u30a4\u30eb\u30d1\u30b9/\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u7121\u52b9\u3067\u3059: {0}
saml-keystore-file-not-exist=\u30ad\u30fc\u30b9\u30c8\u30a2\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093: {0}
saml-loading-keystore=\u30ad\u30fc\u30b9\u30c8\u30a2\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059
saml-open-ks-failed=\u6307\u5b9a\u3057\u305f\u30ad\u30fc\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u306f\u3001\u30ad\u30fc\u30b9\u30c8\u30a2\u3092\u958b\u3051\u307e\u305b\u3093\u3067\u3057\u305f\u3002
saml-loading-failed=\u6307\u5b9a\u3057\u305f\u30ad\u30fc\u30b9\u30c8\u30a2\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u306f\u3001\u30ad\u30fc\u30b9\u30c8\u30a2\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

#cert alias
saml-cannot-validate-ks-pwd=\u30ad\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u691c\u8a3c\u3067\u304d\u307e\u305b\u3093\u3002\u8a3c\u660e\u66f8\u306e\u5225\u540d\u304c\u7121\u52b9\u3067\u3059: {0}
saml-cert-alias-mismatch=\u6307\u5b9a\u3057\u305f\u5225\u540d\u306e\u4ed8\u3044\u305f\u8a3c\u660e\u66f8\u306f\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093: {0}
saml-validate-cert-alias=SAML \u8a3c\u660e\u66f8\u306e\u5225\u540d\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059\u3002

#xml signature
saml-validate-xml-sig=XML \u7f72\u540d\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059\u3002
saml-missing-prop=\u5fc5\u9808\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u3042\u308a\u307e\u305b\u3093: {0}
saml-empty-prop-val=\u6b21\u306e\u5c5e\u6027\u5024\u304c\u7a7a\u3067\u3059: {0}
saml-inv-xml-alg-val=XML \u7f72\u540d\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u306e\u5024\u304c\u7121\u52b9\u3067\u3059: {0}
saml-xml-alg-mismatch=\u6307\u5b9a\u3057\u305f\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 {0} \u306f\u3001\u8a3c\u660e\u66f8\u3068\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093: {1}
saml-cannot-validate-sig=\u7f72\u540d\u3092\u691c\u8a3c\u3067\u304d\u307e\u305b\u3093\u3002\u8a3c\u660e\u66f8\u306e\u5225\u540d\u304c\u7121\u52b9\u3067\u3059\u3002

saml-invalid-cfg-prop=SAML \u95a2\u9023\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u7121\u52b9\u306a\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
saml-prop-not-cfgd=SAML \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
saml-exp-cfg-info-validation=SAML \u8a2d\u5b9a\u60c5\u5831\u306e\u691c\u8a3c\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
saml-detect-prop=SAML \u95a2\u9023\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u691c\u51fa\u3092\u3057\u3066\u3044\u307e\u3059\u3002

#
# Server configuration 
#
#Server
svr-get-boot-corrupt=\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u307f\u53d6\u308a\u4e2d
svr-get-boot-info=\u30d6\u30fc\u30c8\u30b5\u30fc\u30d0\u30fc\u306e\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u3092\u8aad\u307f\u53d6\u3063\u3066\u3044\u307e\u3059\u3002
svr-boot-parse-err=\u6b21\u306e\u5834\u6240\u3067\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093: {0} 
svr-boot-not-found=\u6b21\u306e\u5834\u6240\u3067\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
svr-boot-read-err=\u6b21\u306e\u5834\u6240\u3067\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u307f\u53d6\u308a\u30a8\u30e9\u30fc: {0}
svr-all-boot-svr-dwn=\u6b21\u306e\u5834\u6240\u3067\u3059\u3079\u3066\u306e\u30d6\u30fc\u30c8\u30b5\u30fc\u30d0\u30fc\u304c\u505c\u6b62\u3057\u3066\u3044\u307e\u3059: {0}
svr-ins-prop-load-fail=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093: {0}
svr-prop-load-fail=\u81f4\u547d\u7684\u30a8\u30e9\u30fc\u3002\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002\u30c7\u30d0\u30c3\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
svr-ins-running=\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5b9f\u884c\u4e2d\u304b\u3069\u3046\u304b\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059\u3002
svr-ins-not-running=\u6b21\u306e\u5834\u6240\u3067\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u307e\u305b\u3093: {0}
svr-validate-ins-prop=\u6b21\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059: {0}
svr-no-svr-entry=\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30b5\u30fc\u30d0\u30fc\u30a8\u30f3\u30c8\u30ea\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
svr-glog-prop-chg=\u30b0\u30ed\u30fc\u30d0\u30eb\u5909\u66f4\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u691c\u51fa\u3057\u3066\u3044\u307e\u3059\u3002
svr-ins-prop-chg=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u5909\u66f4\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u691c\u51fa\u3057\u3066\u3044\u307e\u3059\u3002
svr-process-svr-ins=\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u51e6\u7406\u3057\u3066\u3044\u307e\u3059: {0} 
svr-prop-not-in-valid-list=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6709\u52b9\u306a\u30ea\u30b9\u30c8\u306b\u3042\u308a\u307e\u305b\u3093: {0} 
svr-invalid-prop=\u7121\u52b9\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc: {0}
svr-ins-prop-unswapped=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u5bfe\u3057\u3066\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u30b9\u30ef\u30c3\u30d7\u3055\u308c\u307e\u305b\u3093: {0}
svr-notify-url-validation=\u901a\u77e5 URL \u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
svr-invalid-value=\u7121\u52b9\u306a\u5024\u3067\u3059 - \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc: {0}\u3001\u5024: {1}  
svr-no-site-cfg=\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9 {0} \u306f\u3001\u3069\u306e\u30b5\u30a4\u30c8\u306b\u3082\u5c5e\u3057\u3066\u3044\u307e\u305b\u3093\u3002
svr-validate-site-cfg=\u30b5\u30fc\u30d0\u30fc\u30b5\u30a4\u30c8\u8a2d\u5b9a\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
svr-belongs-to-invalid-site=\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5c5e\u3057\u3066\u3044\u308b\u30b5\u30a4\u30c8\u306f\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093: {0}
svr-url-prop-mismatch=\u30b5\u30fc\u30d0\u30fc\u30a8\u30f3\u30c8\u30ea\u304c\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304b\u3089\u69cb\u6210\u3055\u308c\u305f URL \u306b\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093: {0}
svr-org-alias-entry=\u7d44\u7e54\u306e\u5225\u540d\u306b\u542b\u307e\u308c\u308b\u30b5\u30fc\u30d0\u30fc\u30a8\u30f3\u30c8\u30ea
svr-entry-not-in-org-alias=\u7d44\u7e54\u306e\u5225\u540d\u306b\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30a8\u30f3\u30c8\u30ea\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093: {0}
svr-validating-php-uri=protocol://host:port/uri \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u30b5\u30fc\u30d0\u30fc\u30a8\u30f3\u30c8\u30ea\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
svr-process-enc-key=\u3059\u3079\u3066\u306e\u6697\u53f7\u5316\u9375\u3092\u78ba\u8a8d\u3057\u3066\u3044\u307e\u3059\u3002
svr-validating-enc-key=\u6697\u53f7\u5316\u9375\u3092\u691c\u67fb\u3057\u3066\u3044\u307e\u3059\u3002
svr-entries-with-multiple-enc-key=\u30b5\u30fc\u30d0\u30fc\u30a8\u30f3\u30c8\u30ea\u306e\u30ad\u30fc\u304c\u885d\u7a81\u3057\u3066\u3044\u307e\u3059\u3002
svr-enc-key-list=\u30ad\u30fc: "{0}" : \u4f7f\u7528\u8005: "{1}" 
svr-print-prop={0} = {1}
svr-persist-prop=\u6301\u7d9a\u7684\u306a\u691c\u7d22\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
svr-persist-prop-err=
#Site
site-validate-cfg-prop=\u30b5\u30a4\u30c8\u8a2d\u5b9a\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
site-org-alias-check=\u7d44\u7e54\u306e\u5225\u540d\u306b\u5bfe\u3057\u3066\u30b5\u30a4\u30c8\u30a8\u30f3\u30c8\u30ea\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059 
site-org-alias-fail=\u5bfe\u8c61\u30b5\u30a4\u30c8\u306e\u7d44\u7e54\u306e\u5225\u540d\u306b\u30a8\u30f3\u30c8\u30ea\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093: {0}
site-invalid-url=\u7121\u52b9\u306a\u30b5\u30a4\u30c8 URL: {0}
site-url-syntax=\u30b5\u30a4\u30c8 URL \u306e\u30a8\u30f3\u30c8\u30ea\u69cb\u6587\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
site-host-validate=\u30b5\u30a4\u30c8\u306e\u30db\u30b9\u30c8\u540d\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059  
site-url-process-entry=\u30b5\u30a4\u30c8\u30a8\u30f3\u30c8\u30ea\u3092\u51e6\u7406\u3057\u3066\u3044\u307e\u3059: {0}
site-url-validate=\u30b5\u30a4\u30c8 URL \u540d\u306e\u66f8\u5f0f\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059 
site-invalid-site-host=\u30b5\u30a4\u30c8\u306e\u30db\u30b9\u30c8\u540d\u304c\u7121\u52b9\u3067\u3059: {0}
site-uri-misplace=\u30b5\u30a4\u30c8 URL \u5185\u306e URI \u304c\u6b63\u3057\u304f\u914d\u5099\u3055\u308c\u3066\u3044\u307e\u305b\u3093: {0}
site-url-syntax-err=\u30b5\u30a4\u30c8 URL \u69cb\u6587\u304c\u7121\u52b9\u3067\u3059\u3002\u914d\u5099 URI \u304c\u306a\u3044\u304b\u7121\u52b9\u3067\u3059: {0}
site-missing-svr-uri=\u30b5\u30fc\u30d0\u30fc\u914d\u5099 URI \u5024\u304c\u3042\u308a\u307e\u305b\u3093: {0}
site-svr-url-in-site=\u30b5\u30fc\u30d0\u30fc URL \u3092\u30b5\u30a4\u30c8\u30a8\u30f3\u30c8\u30ea\u3068\u3057\u3066\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093: {0}
site-in-svr-list=\u30b5\u30fc\u30d0\u30fc\u30a8\u30f3\u30c8\u30ea\u306b\u5bfe\u3057\u3066\u30b5\u30a4\u30c8\u30a8\u30f3\u30c8\u30ea\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059\u3002
site-not-configured=\u8a2d\u5b9a\u6e08\u307f\u306e\u30b5\u30a4\u30c8\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093\u3002

#
#Session Failover 
#
sfo-validate-cfg-prop=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
sfo-validate-jdbc-url=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 URL \u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059 
sfo-jdbc-url-empty=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 URL \u304c\u7a7a\u3067\u3059\u3002
sfo-jdbc-url=URL: {0}
sfo-jdbc-url-invalid=\u7121\u52b9\u306a URL: {0}
sfo-jdbc-url-single=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 URL \u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u30ad\u30e5\u30fc\u30b5\u30fc\u30d0\u30fc\u304c\u4e00\u3064\u3057\u304b\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
sfo-jdbc-url-no-port=\u7121\u52b9\u306a\u30db\u30b9\u30c8\u540d\u306e\u69cb\u6587\u3002\u30dd\u30fc\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
sfo-jdbc-url-invalid-host=\u7121\u52b9\u306a\u30db\u30b9\u30c8\u540d: {0}
sfo-jdbc-url-invalid-port=\u7121\u52b9\u306a\u30dd\u30fc\u30c8: {0}
sfo-cfg-enabled=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u5bfe\u3057\u3066\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u307e\u3059: {0}
sfo-cfg-not-enabled=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u5bfe\u3057\u3066\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093: {0}
sfo-cfg-prop-details=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u306e\u8a73\u7d30: 
sfo-cfg-prop-notfound=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
sfo-cfg-params=UserName = {0} \n clusterServerList = {1} \n connectionMaxWaitTime = {2} \n minPoolSize = {3} \n maxPoolSize = {4}

#
#Directory Server
#
ds-ins-validation=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u5bfe\u3057\u3066\u691c\u8a3c\u3092\u5b9f\u884c\u3057\u3066\u3044\u307e\u3059: {0} 
ds-ins-connect=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u4e2d\u3067\u3059\u3002
ds-connect-at-suffix=\u6b21\u306e\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u3067\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3057\u3066\u3044\u307e\u3059: {0}
ds-failed-connect-at-suffix=\u6b21\u306e\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u3067\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093: {0}
ds-sfx-connect=\u8a2d\u5b9a\u6e08\u307f\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u3092\u6307\u5b9a\u3057\u3066\u63a5\u7d9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ds-not-running=\u6b21\u306e\u5834\u6240\u3067\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u307e\u305b\u3093: {0}:{1}
ds-no-ins-to-connect=\u63a5\u7d9a\u306b\u4f7f\u7528\u53ef\u80fd\u306a\u8a2d\u5b9a\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
