/**
 * NO MODIFICAR O ELIMINAR LAS NOTAS DE COPYRIGHT NI ESTE ENCABEZADO.
 *
 * Copyright (c) 2008 Sun Microsystems, Inc. Todos los derechos reservados
 *
 * Los contenidos de este archivo est\u00e1n sujetos a los t\u00e9rminos estipulados
 * en la Licencia de desarrollo com\u00fan y distribuci\u00f3n 
 * (la Licencia). Este archivo s\u00f3lo puede utilizarse 
 * de conformidad con la Licencia.
 *
 * Puede obtener una copia de la Licencia en
 * https://opensso.dev.java.net/public/CDDLv1.0.html o en
 * opensso/legal/CDDLv1.0.txt.
 * Consulte la Licencia para conocer los permisos espec\u00edficos que rigen cada idioma y 
 * las limitaciones estipuladas en ella.
 *
 * Cuando se distribuya c\u00f3digo cubierto, es necesario incluir este 
 * encabezado de aviso de Licencia e incluir el archivo de la Licencia disponible en 
 * opensso/legal/CDDLv1.0.txt.
 * Si fuera necesario, a\u00f1ada lo siguiente bajo el encabezado, 
 * sustituyendo los campos entre corchetes [] 
 * por su informaci\u00f3n personal:
 * "Porciones protegidas por Copyright [a\u00f1o] [nombre del propietario del Copyright]"
 *
 * $Id: AgentConfiguration_es.properties,v 1.3 2009/12/26 03:55:07 cbasha Exp $
 *
 */

#General 
service-start-msg=Servicio de agente iniciado...
service-done-msg=Servicio de agente finalizado...
invalid-bootstrap-location= Localizaci\u00f3n de c\u00f3digo de inicio no v\u00e1lida:
cannot-bootstrap-system=No se puede ejecutar el c\u00f3digo de inicio del sistema.
cannot-load-boot-properties=No se pueden cargar las propiedades de inicio del archivo: {0}
cannot-load-properties=No se pueden cargar las propiedades de inicio del archivo: {0}
msg-fail=Fallido
msg-pass=Correcto
msg-ok=Correcto

#Agent related 
svr-report-print-prop={0}={1}
agt-loading-boot-prop=Cargando propiedades de c\u00f3digo de inicio desde: {0}
agt-cdc-check=Validando URL de CDSSO: {0}
agt-cdc-enable-check=CDSSO activado: {0}
agt-cdc-url-invalid=URL de CDSSO no v\u00e1lida: {0}
agt-cdc-url-validation=Validando URL de CDSSO
agt-get-agt-profile=Error en la validaci\u00f3n de propiedades.
agt-naming-url-corrupt=La URL de asignaci\u00f3n de nombres no es correcta: {0} 
agt-invalid-naming-url=URL de asignaci\u00f3n de nombres no v\u00e1lida en las propiedades de c\u00f3digo de inicio: {0}
agt-invalid-host-url=Nombre de host no v\u00e1lido en el nombre de la URL de asignaci\u00f3n de nombres: {0}
agt-host-name-validation=Validando el nombre de host del servidor: {0}
agt-naming-url-syntax=Validando la sintaxis de la URL de asignaci\u00f3n de nombres en las propiedades de c\u00f3digo de inicio
agt-svr-connect-status=Comprobando la conexi\u00f3n con el servidor: {0}
agt-naming-url-connect=Conectando utilizando la URL de asignaci\u00f3n de nombres: {0}
agt-fatal-connect-err=\u00a1\u00a1\u00a1Error grave!!! No se puede establecer contacto con el servicio de asignaci\u00f3n de nombres: {0} 
agt-fatal-err=No se puede continuar con las entradas del archivo de inicio: {0}
agt-auth-to-svr=Autenticando en el servidor con las credenciales de inicio
agt-auth-to-svr-fail=Fallo de autenticaci\u00f3n en el servidor con las credenciales de usuario para: {0}
agt-loading-cfg-prop=Cargando las propiedades del agente desde el servidor.
agt-time-diff-check=Comprobando la diferencia de horario entre servidor y cliente.
agt-time-on-svr=Fecha/Hora en el servidor: {0} 
agt-time-on-client=Fecha/Hora en el cliente: {0} 
agt-get-svr-time-fail=Obteniendo fecha y hora del servidor 
agt-time-diff-check-fail=La diferencia de horario entre el agente y el servidor no est\u00e1 sincronizada.
