/**
 * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
 *
 * Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
 *
 * The contents of this file are subject to the terms
 * of the Common Development and Distribution License
 * (the License). You may not use this file except in
 * compliance with the License.
 *
 * You can obtain a copy of the License at
 * https://opensso.dev.java.net/public/CDDLv1.0.html or
 * opensso/legal/CDDLv1.0.txt
 * See the License for the specific language governing
 * permission and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL
 * Header Notice in each file and include the License file
 * at opensso/legal/CDDLv1.0.txt.
 * If applicable, add the following below the CDDL Header,
 * with the fields enclosed by brackets [] replaced by
 * your own identifying information:
 * "Portions Copyrighted [year] [name of copyright owner]"
 *
 * $Id: AgentConfiguration_ja.properties,v 1.4 2009/12/26 03:51:43 cbasha Exp $
 *
 */

#General 
service-start-msg=\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u30b5\u30fc\u30d3\u30b9\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f...
service-done-msg=\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u30b5\u30fc\u30d3\u30b9\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f...
invalid-bootstrap-location= \u7121\u52b9\u306a\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u4f4d\u7f6e:
cannot-bootstrap-system=\u30b7\u30b9\u30c6\u30e0\u3092\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
cannot-load-boot-properties=\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u30d6\u30fc\u30c8\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093: {0}
cannot-load-properties=\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u30d6\u30fc\u30c8\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093: {0}
msg-fail=\u5931\u6557
msg-pass=\u6210\u529f
msg-ok=\u4e86\u89e3

#Agent related 
svr-report-print-prop={0} = {1}
agt-loading-boot-prop=\u6b21\u306e\u5834\u6240\u304b\u3089\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059: {0}
agt-cdc-check=CDSSO URL \u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059: {0}
agt-cdc-enable-check=\u4f7f\u7528\u53ef\u80fd\u306a CDSSO: {0}
agt-cdc-url-invalid=\u7121\u52b9\u306a CDSSO URL: {0}
agt-cdc-url-validation=CDSSO URL \u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
agt-get-agt-profile=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u691c\u8a3c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
agt-naming-url-corrupt=\u30cd\u30fc\u30df\u30f3\u30b0 URL \u304c\u9593\u9055\u3063\u3066\u3044\u307e\u3059: {0} 
agt-invalid-naming-url=\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30cd\u30fc\u30df\u30f3\u30b0 URL \u304c\u7121\u52b9\u3067\u3059: {0}
agt-invalid-host-url=\u30cd\u30fc\u30df\u30f3\u30b0 URL \u306e\u30db\u30b9\u30c8\u540d\u304c\u7121\u52b9\u3067\u3059: {0}
agt-host-name-validation=\u30b5\u30fc\u30d0\u30fc\u306e\u30db\u30b9\u30c8\u540d\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059: {0}
agt-naming-url-syntax=\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30cd\u30fc\u30df\u30f3\u30b0 URL \u69cb\u6587\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
agt-svr-connect-status=\u30b5\u30fc\u30d0\u30fc\u306e\u63a5\u7d9a\u3092\u691c\u67fb\u3057\u3066\u3044\u307e\u3059: {0}
agt-naming-url-connect=\u30cd\u30fc\u30df\u30f3\u30b0 URL \u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u3057\u3066\u3044\u307e\u3059: {0}
agt-fatal-connect-err=\u81f4\u547d\u7684\u30a8\u30e9\u30fc\u30cd\u30fc\u30e0\u30b5\u30fc\u30d3\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093: {0} 
agt-fatal-err=\u30d6\u30fc\u30c8\u30d5\u30a1\u30a4\u30eb\u30a8\u30f3\u30c8\u30ea\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093: {0}
agt-auth-to-svr=\u30d6\u30fc\u30c8\u8cc7\u683c\u306b\u3088\u308b\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u8a8d\u8a3c\u3092\u3057\u3066\u3044\u307e\u3059
agt-auth-to-svr-fail=\u6b21\u306e\u30e6\u30fc\u30b6\u30fc\u8cc7\u683c\u306b\u3088\u308b\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
agt-loading-cfg-prop=\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059\u3002
agt-time-diff-check=\u30b5\u30fc\u30d0\u30fc\u3068\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u9593\u306e\u6642\u5dee\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u3044\u307e\u3059\u3002
agt-time-on-svr=\u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u65e5\u4ed8/\u6642\u523b:  {0}  
agt-time-on-client=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u4e0a\u306e\u65e5\u4ed8/\u6642\u523b:  {0}  
agt-get-svr-time-fail=\u30b5\u30fc\u30d0\u30fc\u306e\u65e5\u6642\u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059 
agt-time-diff-check-fail=\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u3068\u30b5\u30fc\u30d0\u30fc\u9593\u306e\u6642\u5dee\u304c\u540c\u671f\u3057\u3066\u3044\u307e\u305b\u3093\u3002
