#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amLDAPv3Repo_es.properties,v 1.11 2009/12/26 03:55:08 cbasha Exp $
#
#

0=Error de LDAP 0: La operaci\u00f3n se complet\u00f3 con \u00e9xito.
1=Error de LDAP 1: Se ha producido un error interno en el servidor LDAP.
2=Error de LDAP 2: El servidor LDAP no pudo interpretar correctamente la solicitud enviada por el cliente porque \u00e9sta no se ajustaba totalmente al protocolo LDAP.
3=Error de LDAP 3: No se ha podido realizar la operaci\u00f3n de b\u00fasqueda dentro del l\u00edmite de tiempo m\u00e1ximo. 
4=Error de LDAP 4: La b\u00fasqueda ha encontrado un n\u00famero de resultados superior al n\u00famero m\u00e1ximo. 
5=Error de LDAP 5: Valor devuelto por una operaci\u00f3n de comparaci\u00f3n LDAP si el atributo y el valor especificados no se encuentran en la entrada (no se halla un valor coincidente). 
6=Error de LDAP 6: Valor devuelto por una operaci\u00f3n de comparaci\u00f3n LDAP si el atributo especificado y el valor se encuentran en la entrada (se halla un valor coincidente). 
7=Error de LDAP 7: El m\u00e9todo de autenticaci\u00f3n especificado no se admite por el servidor LDAP al que se est\u00e1 conectando. 
8=Error de LDAP 8: El servidor LDAP al que se est\u00e1 conectando requiere un m\u00e9todo de autenticaci\u00f3n m\u00e1s potente (m\u00e1s que LDAP_AUTH_SIMPLE).
9=Error de LDAP 9: El servidor LDAP remite al cliente a otro servidor LDAP y se produce un error durante el proceso de referencia.  
10=Error de LDAP 10: El servidor no contiene la entrada solicitada. 
11=Error de LDAP 11: Se ha excedido el l\u00edmite administrativo sobre el n\u00famero m\u00e1ximo de entradas que se deben devolver. 
12=Error de LDAP 12: El servidor ha recibido un control LDAP v3 que est\u00e1 marcado como cr\u00edtico y (1) puede que el servidor no lo reconozca o no lo admita, o (2) que no sea adecuado para la operaci\u00f3n solicitada. 
13=Error de LDAP 13: Se requiere una conexi\u00f3n segura para esta operaci\u00f3n.
14=Error de LDAP 14: Enlace SASL en curso.
15=Error de LDAP 15: 
16=Error de LDAP 16: No se ha encontrado el atributo especificado.
17=Error de LDAP 17: El atributo especificado no est\u00e1 definido.
18=Error de LDAP 18: Se ha usado un tipo de coincidencia que no es apropiado.
19=Error de LDAP 19: Se ha producido un error interno en el servidor LDAP.
20=Error de LDAP 20: El valor que est\u00e1 agregando a un atributo ya existe en el atributo
21=Error de LDAP 21: La solicitud contiene una sintaxis no v\u00e1lida.
22=LDAP Error: 22
23=LDAP Error: 23
24=LDAP Error: 24
25=LDAP Error: 25
26=LDAP Error: 26
27=LDAP Error: 27
28=LDAP Error: 28
29=LDAP Error: 29
30=LDAP Error: 30
31=LDAP Error: 31
32=Error de LDAP 32: La entrada especificada en la solicitud no existe.
33=Error de LDAP 33: Hay un problema con un alias.
34=Error de LDAP 34: El nombre distinguido (DN) especificado utiliza una sintaxis no v\u00e1lida.
35=Error de LDAP 35: La entrada especificada es una entrada "leaf".
36=Error de LDAP 36: Se ha producido un error al eliminar la referencia de un alias.
37=LDAP Error: 37
38=LDAP Error: 38
39=LDAP Error: 39
40=LDAP Error: 40
41=LDAP Error: 41
42=LDAP Error: 42
43=LDAP Error: 43
44=LDAP Error: 44
45=LDAP Error: 45
46=LDAP Error: 46
47=LDAP Error: 47
48=Error de LDAP 48: La autenticaci\u00f3n presentada al servidor no es apropiada.
49=Error de LDAP 49: Las credenciales presentadas al servidor para la autenticaci\u00f3n no son v\u00e1lidas.
50=Error de LDAP 50: El cliente se ha autenticado como un usuario que no tiene privilegios de acceso para realizar esta operaci\u00f3n.
51=Error de LDAP 51: El servidor LDAP est\u00e1 ocupado.
52=Error de LDAP 52: El servidor LDAP no est\u00e1 disponible.
53=Error de LDAP 53: El servidor LDAP no puede realizar la operaci\u00f3n especificada.
54=Error de LDAP 54: Se ha detectado un bucle.
56=LDAP Error: 56
57=LDAP Error: 57
58=LDAP Error: 58
59=LDAP Error: 59
60=Error de LDAP 60: El control "server-side sorting" no se ha incluido en el control "virtual list view" en la solicitud de b\u00fasqueda.
61=Error de LDAP 61: Se ha producido un error en el \u00edndice de intervalo.
62=LDAP Error: 62
63=LDAP Error: 63
64=Error de LDAP 64: Se ha producido una infracci\u00f3n de nomenclatura.
65=Error de LDAP 65: La operaci\u00f3n solicitada agregar\u00e1 o cambiar\u00e1 datos de forma que \u00e9stos ya no sean compatibles con el esquema.
66=Error de LDAP 66: La operaci\u00f3n solicitada s\u00f3lo se puede efectuar en una entrada que no tenga entradas por debajo en el \u00e1rbol de directorio (es decir, en una entrada "leaf").
67=Error de LDAP 67: La operaci\u00f3n especificada no se puede realizar en un nombre distinguido relativo (RDN).
68=Error de LDAP 68: Ya existe la entrada especificada.
69=Error de LDAP 69: No puede modificar la clase de objeto especificada.
70=LDAP Error: 70
71=Error de LDAP 71: El cliente intent\u00f3 mover una entrada de un servidor LDAP a otro usando una operaci\u00f3n "modify DN".
72=LDAP Error: 72
73=LDAP Error: 73
74=LDAP Error: 74
75=LDAP Error: 75
76=LDAP Error: 76
77=LDAP Error: 77
78=LDAP Error: 78
79=LDAP Error: 79
80=Error de LDAP 80: C\u00f3digo de resultados generales para otros tipos de errores que se pueden producir.
81=Error de LDAP 81: No se puede establecer contacto con el servidor LDAP.
82=LDAP Error: 82
83=LDAP Error: 83
84=LDAP Error: 84
85=Error de LDAP 85: No se ha podido realizar la operaci\u00f3n dentro del l\u00edmite de tiempo m\u00e1ximo.
86=LDAP Error: 86
87=LDAP Error: 87
88=LDAP Error: 88
89=Error de LDAP 89: Al intentar ejecutar un constructor o m\u00e9todo de su cliente, uno o varios de los par\u00e1metros estaban especificados incorrectamente.
90=LDAP Error: 90
91=Error de LDAP 91: El cliente LDAP no pudo conectarse con el servidor LDAP.
92=Error de LDAP 92: Esta versi\u00f3n del protocolo LDAP no admite esta solicitud.
93=Error de LDAP 93: No se ha encontrado el control solicitado. 
94=Error de LDAP 94: El servidor no ha devuelto ning\u00fan resultado.
95=Error de LDAP 95: El servidor est\u00e1 devolviendo m\u00e1s resultados.
96=Error de LDAP 96: El cliente LDAP ha detectado un bucle en la referencia.
97=Error de LDAP 97: El n\u00famero de referencias secuenciales (por ejemplo, el cliente puede hacer referencia, en primer lugar, del servidor A al servidor LDAP B y, despu\u00e9s, del servidor LDAP B al servidor LDAP C, etc.) ha excedido el n\u00famero m\u00e1ximo de referencias.
