#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amPasswordResetModuleMsgs_es.properties,v 1.12 2009/12/26 03:55:08 cbasha Exp $
#
#

pwResetSuccess.title=Confirmaci\u00f3n de restablecimiento de contrase\u00f1a
pwConsole.title=OpenAM (Restablecimiento de contrase\u00f1a)
userValidate.title=Validaci\u00f3n del usuario para el restablecimiento de contrase\u00f1a
pwQuestion.title=Pregunta de contrase\u00f1a para {0}

#
# buttons
#
next.button=Siguiente
previous.button=Anterior
ok.button=Aceptar

#
# message titles
#
error.title=Error
invalidURL.title=URL no v\u00e1lida
uncaughtException.title=Error

#
# message and error
#
userNotExists.message=No se puede restablecer la contrase\u00f1a para este usuario.
logUserNotExists.message=Se ha intentado restablecer la contrase\u00f1a de un usuario no v\u00e1lido, {0}.
multipleUsersExists.message=Hay varios usuarios que coinciden con el valor especificado. Introduzca un valor diferente o p\u00f3ngase en contacto con el administrador para obtener m\u00e1s ayuda.
passResetError.message=No puede cambiar la contrase\u00f1a. P\u00f3ngase en contacto con el administrador para obtener m\u00e1s informaci\u00f3n.
emailNotify.message=Se ha enviado un mensaje de correo electr\u00f3nico a su cuenta con la nueva contrase\u00f1a.
wrongAnswer.message=Se introdujo una contrase\u00f1a incorrecta.
resetPassMail.message=Su contrase\u00f1a de OpenAM se ha cambiado a: {0}
noQuestions.message=No hay preguntas configuradas para usted.
noAnswers.message=La respuesta para las preguntas secretas no existe.
attemptEmail.message=Se ha realizado un intento de restablecimiento de la contrase\u00f1a. Si no lo hizo usted, p\u00f3ngase en contacto con el administrador.
resetSubject.message=Restablecimiento de contrase\u00f1a de OpenAM
attemptSubject.message=Restablecimiento de contrase\u00f1a de OpenAM
pwResetDisabled.message=El servicio de restablecimiento de contrase\u00f1a est\u00e1 desactivado actualmente. P\u00f3ngase en contacto con el administrador.
missingUserAttr.message=Escriba un valor.
missingAnswer.message=Introduzca valores para todos los campos.
invalidURL.message=Ha introducido una URL no v\u00e1lida.
uncaughtException.message=Se ha producido un error al procesar esta solicitud. P\u00f3ngase en contacto con el administrador.
noEmail.message=No es posible enviarle la contrase\u00f1a. P\u00f3ngase en contacto con el administrador.
userNotActive.message=Este usuario no est\u00e1 activo. P\u00f3ngase en contacto con el administrador.
userAccountExpired.message=La cuenta de usuario ha caducado. P\u00f3ngase en contacto con el administrador.
sendEmailFailed.message=La contrase\u00f1a se ha restablecido pero no podemos envi\u00e1rsela. P\u00f3ngase en contacto con el administrador.

#
# labels
#
fromAddress.label=<Administrador de contrase\u00f1as>
sunLogo.label=Logotipo de Sun Microsystems
product.label=OpenAM
javaLogo.label=Sun Java System Software

#
# copyright text
#
copyright.text=Copyright \u00a9 2008 Sun Microsystems, Inc.  Reservados todos los derechos.  Sun Microsystems, Inc. tiene derechos de propiedad intelectual relacionados con la tecnolog\u00eda del producto que se describe en este documento. Especialmente, aunque sin limitarse a ellos, dichos derechos de propiedad intelectual pueden incluir una o varias de las patentes de EE.UU. que aparecen en http://www.sun.com/patents, as\u00ed como otras patentes adicionales o solicitudes de patentes en EE.UU. y otros pa\u00edses. Derechos del gobierno de EE.UU: software comercial.  Los usuarios gubernamentales est\u00e1n sujetos al acuerdo de licencia est\u00e1ndar de Sun Microsystems, Inc. y a las disposiciones aplicables de la regulaci\u00f3n FAR y sus suplementos. El uso est\u00e1 sujeto a las condiciones de la licencia.  Esta distribuci\u00f3n puede incluir materiales desarrollados por terceras partes. Sun, Sun Microsystems y el logotipo de Sun son marcas comerciales o marcas comerciales registradas de Sun Microsystems, Inc. en los EE.UU. y en otros pa\u00edses.&nbsp;   &nbsp; &nbsp; &nbsp;  &nbsp;    &nbsp;  &nbsp; &nbsp;

################################################################################
#
# logging messages
#
accountInactive.message=La cuenta no est\u00e1 activa para el usuario {0}
accountExpired.message=La cuenta ha caducado para el usuario {0}.
accountLocked.message=La cuenta est\u00e1 bloqueada para el usuario {0}.
accountLockout.message=Se ha desactivado el restablecimiento de contrase\u00f1a para {0} debido a sucesivos fallos durante este proceso.
pwResetSuccess.message=Se ha cambiado la contrase\u00f1a para el usuario {0}.
pwResetFail.message=No se pudo restablecer la contrase\u00f1a para el usuario {0}.

################################################################################
#
# Password Reset lockout messages
#
lockOutEmailFrom=<Administrador de contrase\u00f1as>
lockOutEmailSub=AVISO: Aviso de bloqueo de restablecimiento de contrase\u00f1a
lockoutMsg.message=Se ha desactivado el restablecimiento de contrase\u00f1a para esta cuenta debido a sucesivos fallos durante este proceso.
lockOutEmailMsg=Se ha desactivado el restablecimiento de contrase\u00f1a para {0} debido a sucesivos fallos durante este proceso.
lockoutWarning.message=Se introdujo una contrase\u00f1a incorrecta. Se proceder\u00e1 al bloqueo de la cuenta despu\u00e9s de {0} fallos de respuesta.
