<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>So erstellen Sie eine neue Authentifizierungskette - Online-Hilfe zur Sun OpenSSO 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="authentication.newauthconfig"></a><h4>So erstellen Sie eine neue Authentifizierungskette</h4><ol>
<li><b><a name="indexterm-7"></a>Klicken Sie auf den Namen des Bereichs, f&#252;r den Sie eine neue
Authentifizierungskette hinzuf&#252;gen m&#246;chten.</b></li>
<li><b>W&#228;hlen Sie die Registerkarte "Authentifizierung".</b></li>
<li><b>Klicken Sie in der Liste "Authentifizierungsverkettung" auf "Neu".</b></li>
<li><b>Geben Sie einen Namen f&#252;r die Authentifizierungskette ein.</b></li>
<li><b>Klicken Sie auf &#8222;OK&#8220;.</b></li>
<li><b>Klicken Sie auf "Hinzuf&#252;gen", um die Authentifizierungsmodulinstanz festzulegen, die Sie der Kette
hinzuf&#252;gen m&#246;chten. W&#228;hlen Sie dazu den Namen der Modulinstanz aus der Instanzenliste
aus. Die in dieser Liste angezeigten Modulinstanzen wurden &#252;ber das Attribut "Modulinstanz"
erstellt. </b></li>
<li><b>W&#228;hlen Sie das Kriterium f&#252;r diese Kette aus. Diese Flags stellen Durchf&#252;hrungskriterien
f&#252;r das Authentifizierungsmodul dar, f&#252;r das sie definiert wurden. F&#252;r deren Durchsetzung
gilt eine hierarchisch festgelegte Reihenfolge. "Erforderlich" hat die h&#246;chste Priorit&#228;t und "Optional"
hat die niedrigste Priorit&#228;t:</b><dl><dt>Obligatorisch</dt>
<dd><p>Der Erfolg der Modulinstanz muss gew&#228;hrleistet sein. Bei einem Erfolg wird die Authentifizierung in der Liste Authentifizierungsverkettung nach unten hin fortgesetzt. Bei einem Fehlschlag erfolgt die sofortige R&#252;ckkehr zur Anwendung (die Authentifizierung wird nicht in der Liste Authentifizierungsverkettung nach unten hin fortgesetzt).</p></dd>
<dt>Erforderlich</dt>
<dd><p>Die Authentifizierung bei diesem Modul muss gew&#228;hrleistet sein. Wenn ein erforderliches Modul der Kette fehlschl&#228;gt, gilt dies als Fehlschlag der gesamten Authentifizierungskette. Dennoch wird die Authentifizierung auch beim Fehlschlag eines erforderlichen Moduls mit dem n&#228;chsten Modul der Kette fortgef&#252;hrt.</p></dd>
<dt>Ausreichend</dt>
<dd><p>Der Erfolg der Modulinstanz muss nicht gew&#228;hrleistet sein. Bei einem Erfolg erfolgt die sofortige R&#252;ckkehr zur Anwendung (die Authentifizierung wird nicht in der Liste der Modulinstanzen nach unten hin fortgesetzt). Bei einem Fehlschlag wird die Authentifizierung in der Liste Authentifizierungsverkettung nach unten hin fortgesetzt.</p></dd>
<dt>Optional</dt>
<dd><p>Der Erfolg der Modulinstanz muss nicht gew&#228;hrleistet sein. Sowohl bei einem Erfolg als auch bei einem Fehlschlag wird die Authentifizierung in der Liste Authentifizierungsverkettung nach unten hin fortgesetzt.</p></dd>
</dl>
</li>
<li><b>Legen Sie die Optionen f&#252;r die Kette fest. Hier k&#246;nnen Sie weitere
Optionen f&#252;r das Modul in der Form "Schl&#252;ssel=Wert" festlegen. Mehrfach-Optionen werden durch
einen Leerschritt getrennt.</b></li>
<li><b>Legen Sie die folgenden Attribute fest:</b><dl><dt>URL f&#252;r erfolgreiche Anmeldung</dt>
<dd><p>Legt den URL fest, zu dem der Benutzer nach erfolgreicher Authentifizierung weitergeleitet wird.</p></dd>
<dt>URL f&#252;r fehlgeschlagene Anmeldung</dt>
<dd><p>Legt den URL fest, zu dem der Benutzer nach fehlgeschlagener Authentifizierung weitergeleitet wird.</p></dd>
<dt>Authentication Post Processing Class</dt>
<dd><p>Legt die Java-Klasse fest, die zur Anpassung des Weiterverarbeitungsprozesses nach einer erfolgreichen oder fehlgeschlagenen Anmeldung dient.</p></dd>
</dl>
</li>
<li><b>Klicken Sie auf Speichern.</b></li></ol>
<br/>

</body>
</html>
