<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Online-Hilfe zur Sun Java System Access Manager 7.1-Konsole
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<p>Teilenr.: 819-6621</p><p></p>Sun Microsystems, Inc. <p><br>4150 Network Circle<br>Santa Clara, CA  95054 <br>U.S.A.</p><p>Copyright 2006, Sun Microsystems, Inc.</p><p>Sun Microsystems, Inc. hat Rechte in Bezug auf geistiges Eigentum an der Technologie, die in dem in diesem Dokument beschriebenen Produkt enthalten ist. Im Besonderen und ohne Einschr&#228;nkung umfassen diese Anspr&#252;che in Bezug auf geistiges Eigentum eines oder mehrere  Patente und eines oder mehrere Patente oder Anwendungen mit laufendem Patent in den USA und in anderen L&#228;ndern.</pr><p>Rechte der US-Regierung  &#8211; Kommerzielle Software. Regierungsbenutzer unterliegen der standardm&#228;&#223;igen Lizenzvereinbarung von Sun Microsystems, Inc. sowie den anwendbaren Bestimmungen der FAR und ihrer Zus&#228;tze. </pr><p>Diese Ausgabe kann von Drittanbietern entwickelte Bestandteile enthalten.</pr><p>Teile dieses Produkts k&#246;nnen von Berkeley BSD Systems abgeleitet und durch die University of California lizenziert sein. UNIX ist ein eingetragenes Warenzeichen in den USA und anderen L&#228;ndern und exklusiv durch X/Open Company, Ltd. lizenziert.</pr><p>Sun, Sun Microsystems, das Sun-Logo,
das Solaris-Logo, das Java Kaffeetassen-Logo, docs.sun.com, 


Java und
Solaris sind Marken oder eingetragene Marken von Sun Microsystems, Inc., in den USA und anderen L&#228;ndern. Alle SPARC-Marken werden unter Lizenz verwendet und sind Marken oder eingetragene Marken von SPARC International, Inc. in den USA und anderen L&#228;ndern. Produkte, die SPARC-Marken aufweisen, basieren auf einer von Sun Microsystems, Inc.


, entwickelten Architektur.</pr><p>Die grafische Benutzeroberfl&#228;che von OPEN LOOK und  Sun&#153; wurden von Sun Microsystems, Inc., f&#252;r die entsprechenden Benutzer und Lizenznehmer entwickelt. Sun erkennt die Pionierleistung von Xerox bei der Ausarbeitung und Entwicklung des Konzepts von visuellen oder grafischen Benutzeroberfl&#228;chen f&#252;r die Computerindustrie an. Sun ist Inhaber einer einfachen Lizenz von Xerox f&#252;r die Xerox Graphical User Interface (grafische Benutzeroberfl&#228;che von Xerox). Mit dieser Lizenz werden auch die Sun-Lizenznehmer abgedeckt, die grafische OPEN LOOK-Benutzeroberfl&#228;chen implementieren und sich ansonsten an die schriftlichen Sun-Lizenzvereinbarungen halten.</pr><p>Produkte, die in dieser Ver&#246;ffentlichung beschrieben sind, und die in diesem Handbuch enthaltenen Informationen unterliegen den Gesetzen der US-Exportkontrolle und k&#246;nnen den Export- oder Importgesetzen anderer L&#228;nder unterliegen.. Die Verwendung im Zusammenhang mit Nuklear-, Raketen-, chemischen und biologischen Waffen, im nuklear-maritimen Bereich oder durch in diesem Bereich t&#228;tige Endbenutzer, direkt oder indirekt, ist strengstens untersagt. Der Export oder R&#252;ckexport in L&#228;nder, die einem US-Embargo unterliegen, oder an Personen und K&#246;rperschaften, die auf der US-Exportausschlussliste stehen, einschlie&#223;lich (jedoch nicht beschr&#228;nkt auf) der Liste nicht zul&#228;ssiger Personen und speziell ausgewiesener Staatsangeh&#246;riger, ist strengstens untersagt.</pr><p>DIE DOKUMENTATION WIRD IN DER VERF&#220;GBAREN FORM ZUR VERF&#220;GUNG GESTELLT UND ALLE AUSDR&#220;CKLICHEN ODER STILLSCHWEIGENDEN BEDINGUNGEN, ANGABEN UND GARANTIEN, INKLUSIVE ALLER STILLSCHWEIGENDEN GARANTIEN BEZ&#220;GLICH HANDELS&#220;BLICHKEIT, EIGNUNG ZU EINEM BESTIMMTEN ZWECK ODER M&#196;NGELGEW&#196;HR, SIND VON DER HAFTUNG AUSGESCHLOSSEN, AUSSER EIN SOLCHER AUSSCHLUSS WIRD ALS RECHTSWIDRIG BEFUNDEN.</pr>
<br />

</body>
</html>
