<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Dokument-Informationen - Online-Hilfe zur Sun OpenSSO 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">

<a name="documentinfo"></a><p>Teilenr.: 820-4360</p>8.0<p></p><p>4150 Network Circle<br>Santa Clara,  CA 95054<br>U.S.A.</p><p>Copyright 2008 Sun Microsystems, Inc.</p><p>Die
Online-Hilfe zur Sun<sup>TM</sup>OpenSSO 8.0-Konsole bietet Informationen zu Verwaltungsaufgaben hinsichtlich Zugriffssteuerung, Verbund- und
Webdiensten und enth&#228;lt Attributdefinitionen f&#252;r die OpenSSO-Standarddienste.</p><p>Sun Microsystems, Inc. ist Inhaber der
Urheberrechte der Technologien, die in den in diesem Dokument beschriebenen Produkten verwendet
wird. Im Besonderen und ohne Einschr&#228;nkungen k&#246;nnen diese Eigentumsrechte ein oder mehrere
der unter http://www.sun.com/patents aufgef&#252;hrten US-Patente und ein oder mehrere zus&#228;tzliche Patente bzw.
Patentantr&#228;ge in den USA oder anderen L&#228;ndern umfassen.</p><p>Rechte der Regierung der USA
&#8211; Kommerzielle Software. Bei einer Regierung besch&#228;ftige Benutzer unterliegen der standardm&#228;&#223;igen Lizenzvereinbarung
von Sun Microsystems, Inc. sowie den anwendbaren Bestimmungen der FAR und ihrer
Zus&#228;tze.</p><p>Diese Produktausgabe kann von Drittanbietern entwickelte Bestandteile enthalten.</p><p>Teile des Produkts k&#246;nnen aus
Berkeley BSD-Systemen stammen, die von der University of California lizenziert sind. UNIX
ist eine eingetragene Marke in den USA und in anderen L&#228;ndern und
exklusiv durch X/Open Company, Ltd. lizenziert.</p><p>Sun, Sun Microsystems, das Sun-Logo, das Solaris-Logo,
das Java-Kaffeetasse-Logo, docs.sun.com,        Java und Solaris sind in den USA und anderen
L&#228;ndern eingetragene Marken von Sun Microsystems Inc. Alle SPARC-Marken werden unter Lizenz
verwendet und sind in den USA und anderen L&#228;ndern Marken oder eingetragene
Marken von SPARC International, Inc. Produkte, die SPARC-Marken tragen, basieren auf einer
von Sun Microsystems, Inc. entwickelten Architektur.    </p><p>Die grafischen Benutzeroberfl&#228;chen OPEN LOOK und
Sun wurden von Sun Microsystems, Inc. f&#252;r seine Benutzer und Lizenznehmer entwickelt.
Sun erkennt dabei die von Xerox geleistete Forschungs- und Entwicklungsarbeit auf dem
Gebiet der visuellen oder grafischen Benutzeroberfl&#228;chen f&#252;r die Computerindustrie an. Sun verf&#252;gt
&#252;ber eine nicht-exklusive Lizenz von Xerox &#252;ber die grafische Benutzeroberfl&#228;che von Xerox.
Diese Lizenz gilt auch f&#252;r die Lizenznehmer von Sun, die OPEN LOOK-GUIs
implementieren und sich an die schriftlichen Lizenzvereinbarungen von Sun halten.</p><p>Produkte, die in
dieser Publikation beschrieben sind, und die in diesem Handbuch enthaltenen Informationen unterliegen
den Gesetzen der US-Exportkontrolle und k&#246;nnen den Export- oder Importgesetzen anderer L&#228;nder
unterliegen. Die Verwendung im Zusammenhang mit Nuklear-, Raketen-, chemischen und biologischen Waffen,
im nuklear-maritimen Bereich oder durch in diesem Bereich t&#228;tige Endbenutzer, direkt oder
indirekt, ist strengstens untersagt. Der Export oder R&#252;ckexport in L&#228;nder, die einem
US-Embargo unterliegen, oder an Personen und K&#246;rperschaften, die auf der US-Exportausschlussliste stehen,
einschlie&#223;lich (jedoch nicht beschr&#228;nkt auf) der Liste nicht zul&#228;ssiger Personen und speziell
ausgewiesener Staatsangeh&#246;riger, ist strengstens untersagt.</p><p>DIE DOKUMENTATION WIRD &#8222;IN DER VORLIEGENDEN FORM&#8220; BEREITGESTELLT
UND ALLE AUSDR&#220;CKLICHEN ODER STILLSCHWEIGENDEN BEDINGUNGEN, ZUSICHERUNGEN UND GARANTIEN, EINSCHLIESSLICH EINER STILLSCHWEIGENDEN
GARANTIE DER HANDELS&#220;BLICHEN QUALIT&#196;T, DER EIGNUNG F&#220;R EINEN BESTIMMTEN ZWECK ODER DER
NICHTVERLETZUNG VON RECHTEN WERDEN IN DEM RECHTLICH ZUL&#196;SSIGEN UMFANG AUSGESCHLOSSEN.</p>
<br/>

</body>
</html>
