<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Entities: Anbieter und Partner - Online-Hilfe zur Sun Java System Federated Access Manager 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fsentitydescriptors"></a><h3>Entities: Anbieter und Partner</h3>
<a name="indexterm-62"></a><a name="indexterm-63"></a><a name="indexterm-64"></a><a name="indexterm-65"></a><p>Eine <b>Entity</b> kann mit <b>Metadaten </b> (Konfigurationsinformationen, die eine bestimmte Identit&#228;tsdienstarchitektur definieren) f&#252;r
einen einzelnen Identity-Anbieter, einen einzelnen Dienstanbieter oder jeweils einen davon konfiguriert werden.
Im Gegensatz dazu kann eine Entity als Partner konfiguriert werden, eine ausgew&#228;hlte
Gruppe mit beiden Arten von Anbietern. Sowohl Anbieter- als auch Partner-Entities k&#246;nnen
&#252;ber die Federation Access Manager-Konsole konfiguriert werden.</p>
<hr><p><b>Hinweis &#8211; </b>Eine Entity kann zwar erstellt werden, aber sie kann erst dann einem
Circle of Trust zugewiesen werden, wenn sie Anbieter enth&#228;lt.</p>
<hr>
<p>Die beiden m&#246;glichen Entity-Typen werden in der folgenden Tabelle beschrieben.</p><a name="gbxxa"></a><h6>Tabelle&#160;1 Entity-Typen</h6><table><col width="50%"><col width="50%"><tr><td align="left" valign="top" scope="row"><p><b>Anbieter-Entity</b></p></td>
<td align="left" valign="top" scope="row"><p>Eine <b>Anbieter-Entity</b> enth&#228;lt
die Metadaten f&#252;r einzelne Anbieter eines der beiden Typen. Alle Identity- und
Dienstanbieter m&#252;ssen innerhalb einer Anbieter-Entity konfiguriert werden, bevor sie einem Circle of
Trust zugeordnet werden oder f&#252;r die Aufnahme in eine <b>Partner-Entity</b> ausgew&#228;hlt werden
k&#246;nnen. Mithilfe der in der Access Manager-Konsole angegebenen Attribute k&#246;nnen ein einzelner
Identity-Anbieter, ein einzelner Dienstanbieter oder je einer davon innerhalb einer Anbieter-Entity definiert
werden. Das Profil einer Anbieter-Entity enth&#228;lt die folgenden Attributgruppen:</p>
<ul><li><p><a href="federation.fsentitydescriptorsprofile.html">General Attributes</a></p></li>
<li><p><a href="federation.fsidentityprovider.html">Identity Provider</a></p></li>
<li><p><a href="federation.fsserviceprovider.html">Service Provider</a></p></li></ul>
</td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><b>Partner-Entity</b></p></td>
<td align="left" valign="top" scope="row"><p>Mithilfe einer konfigurierten <b>Partnerschaft</b>
kann sich ein Benutzer mit einer Gruppe von zugeordneten Sites  zusammenschlie&#223;en.
Wenn ein Dienstanbieter beispielsweise eine Authentifizierungsanforderung f&#252;r einen Benutzer im Namen einer
 Partnerschaft ausgibt und die Authentifizierung gesichert ist, ist f&#252;r den Benutzer
Single Sign-On mit allen Mitgliedern der Partnerschaft m&#246;glich. Partnerschaften werden ohne R&#252;cksicht
auf die Grenzen eines Circle of Trust gebildet.</p><p>Eine <b>Partner-Entity</b> enth&#228;lt die Metadaten,
die die Zusammenstellung einer oder mehrerer Anbieter-Entities definieren, aus denen die Partnerschaft
besteht. Sie enthalten keine Konfigurationsinformationen f&#252;r Anbieter, nur die Konfigurationsinformationen f&#252;r die
Partnerschaft selbst. Das Profil einer Partner-Entity enth&#228;lt die folgenden Attributgruppen:</p>
<ul><li><p><a href="federation.fsentitydescriptorsprofile.html">General Attributes</a></p></li>
<li><p><a href="federation.fsentitydescriptorsaffiliate.html">Affiliate</a></p></li></ul>

<hr><p><b>Hinweis &#8211; </b>Die  Mitglieder
einer Partnerschaft k&#246;nnen Dienste entweder als Mitglieder der Partnerschaft oder einzeln aufrufen.</p>
<hr>
</td>
</tr>
</table><p>S&#228;mtliche konfigurierten Entities beider Typen werden unter "Entities" aufgef&#252;hrt. In Verbindung mit
Entities m&#252;ssen die folgenden Aufgaben ausgef&#252;hrt werden:</p>
<ul><li><p><a href="federation.fsentitydescriptorsadd.html">So erstellen Sie eine Anbieter-Entity oder eine Partner-Entity</a></p></li>
<li><p><a href="federation.fsentitydescriptorsprofile.html">So &#228;ndern Sie die allgemeinen Attribute einer Anbieter-Entity oder einer Partner-Entity</a></p></li>
<li><p><a href="federation.fsidentityprovider.html">So f&#252;gen Sie einer Anbieter-Entity einen Identity-Anbieter hinzu</a></p></li>
<li><p><a href="federation.fsidentityproviderhostedadd.html">So f&#252;gen Sie einer Anbieter-Entity einen neuen Host-Identity-Anbieter hinzu</a></p></li>
<li><p><a href="federation.fsidentityproviderremoteadd.html">So f&#252;gen Sie einer Anbieter-Entity einen neuen Remote-Identity-Anbieter hinzu</a></p></li>
<li><p><a href="federation.fsserviceprovider.html">So f&#252;gen Sie einer Anbieter-Entity einen Dienstanbieter hinzu</a></p></li>
<li><p><a href="federation.fsserviceproviderhostedadd.html">So f&#252;gen Sie einer Anbieter-Entity einen neuen Host-Dienstanbieter hinzu</a></p></li>
<li><p><a href="federation.fsserviceproviderremoteadd.html">So f&#252;gen Sie einer Anbieter-Entity einen neuen Remote-Dienstanbieter hinzu</a></p></li>
<li><p><a href="federation.fsidentityproviderhostedprofile.html">So &#228;ndern Sie einen Host-Identity-Anbieter in einer Anbieter-Entity</a></p></li>
<li><p><a href="federation.fsidentityproviderremoteprofile.html">So &#228;ndern Sie einen Remote-Identity-Anbieter in einer Anbieter-Entity</a></p></li>
<li><p><a href="federation.fsserviceproviderhostedprofile.html">So &#228;ndern Sie einen Host-Dienstanbieter in einer Anbieter-Entity</a></p></li>
<li><p><a href="federation.fsserviceproviderremoteprofile.html">So &#228;ndern Sie einen Remote-Dienstanbieter in einer Anbieter-Entity</a></p></li>
<li><p><a href="federation.fscreatecontactperson.html">So f&#252;gen Sie einem Anbieter in einer Anbieter-Entity eine Kontaktperson hinzu</a></p></li>
<li><p><a href="federation.fseditcontactperson.html">So &#228;ndern Sie das Profil einer Kontaktperson in einer Anbieter-Entity</a></p></li>
<li><p><a href="federation.fsentitydescriptorsaffiliate.html">So f&#252;gen Sie Mitglieder zu einer Partner-Entity hinzu</a></p></li></ul>

<br/>

</body>
</html>
