<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Generische LDAPv3-Attribute - Online-Hilfe zur Sun Java System Federated Access Manager 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="gdoto"></a><h4>Generische LDAPv3-Attribute</h4>
<p><a name="indexterm-14"></a>Folgende Attribute werden zur Konfiguration eines LDAPv3-Repository-Plugins verwendet:</p>

<a name="gdoug"></a><h5>LDAP-Server</h5>
<p>Geben Sie den Namen des LDAP-Servers ein, mit dem Sie eine Verbindung
herstellen. Das Format ist <tt>hostname.domainname:portnumber</tt>. </p><p>Wenn mehrere <tt>host:portnumber</tt>-Eintr&#228;ge vorhanden sind, wird eine Verbindung mit dem ersten Host
der Liste hergestellt. Schl&#228;gt die Verbindung fehl, wird der n&#228;chste Hosteintrag verwendet.</p>

<a name="gdotj"></a><h5>LDAP-BIND-DN</h5>
<p>Gibt den DN-Namen an, den Federated Access Manager zur Authentifizierung bei dem
LDAP-Server verwendet, mit dem Sie zurzeit verbunden sind. Der Benutzer mit dem
DN-Namen der Bindung sollte &#252;ber die Berechtigungen zum Hinzuf&#252;gen, &#196;ndern und L&#246;schen
verf&#252;gen, die im Attribut <a href="adattrs.html#fyffb">LDAPv3 Plugin-unterst&#252;tzte Typen und Vorg&#228;nge</a> festgelegt sind.</p>

<a name="gdoss"></a><h5>LDAP-BIND-Passwort</h5>
<p>Gibt das DN-Passwort an, das Federated Access Manager zur Authentifizierung bei dem
LDAP-Server verwendet, mit dem Sie zurzeit verbunden sind.</p>

<a name="gdotv"></a><h5>LDAP-BIND-Passwort (Best&#228;tigen)</h5>
<p> Best&#228;tigen Sie das Passwort.</p>

<a name="gdoth"></a><h5>LDAP-Organisations-DN</h5>
<p>Gibt den DN an, dem dieses Data Store-Repository zugeordnet ist. Dieser DN
wird als Basis-DN f&#252;r alle in diesem Data Store ausgef&#252;hrten Vorg&#228;nge verwendet.
</p>

<a name="gdotb"></a><h5>LDA-SSL</h5>
<p>Wenn aktiviert, stellt Federated Access Manager &#252;ber das HTTPS-Protokoll eine Verbindung mit
dem prim&#228;ren Server her.</p>

<a name="gdotw"></a><h5>LDAP-Verbindung Pool-Mindestgr&#246;&#223;e</h5>
<p>Gibt die anf&#228;ngliche Anzahl an Verbindungen im Verbindungspool an. Wenn Sie einen
Verbindungspool verwenden, m&#252;ssen Sie nicht jedes Mal eine neue Verbindung herstellen.</p>

<a name="gdosz"></a><h5>Maximalgr&#246;&#223;e des LDAP-Verbindungs-Pools</h5>
<p>Gibt die maximale Anzahl der zul&#228;ssigen Verbindungen an.</p>

<a name="gdota"></a><h5>Maximale Ergebnisse aus Suchlauf</h5>
<p>Gibt die maximale Anzahl der bei einem Suchvorgang zur&#252;ckgegebenen Eintr&#228;ge an. Wenn
die Grenze erreicht ist, gibt Directory Server alle Eintr&#228;ge zur&#252;ck, die mit
der Suchanforderung &#252;bereinstimmen.</p>

<a name="gdott"></a><h5>Timeout f&#252;r Suche</h5>
<p>Gibt die maximal zul&#228;ssige Zeit f&#252;r eine Suchanforderung an. Wenn die Grenze
erreicht ist, gibt Directory Server alle Eintr&#228;ge zur&#252;ck, die mit der Suchanforderung
&#252;bereinstimmen.</p>

<a name="gdotk"></a><h5>LDAP richtet sich nach Bezug</h5>
<p>Wenn aktiviert, werden Bez&#252;ge zu anderen LDAP-Servern automatisch verfolgt.</p>

<a name="gdoud"></a><h5>LDAPv3 Repository Plugin-Klassenname</h5>
<p>Gibt den Speicherort der Klassendatei an, die das LDAPv3-Repository implementiert.</p>

<a name="gdosu"></a><h5>Allgemeine Attributnamenzuordnung</h5>
<p>Aktiviert allgemeine Attribute, von denen dem Framework bekannt ist, dass sie dem
nativen Data Store zugeordnet sind. Beispiel: F&#252;r das Attribut  <tt>inetUserStatus </tt>, das
das Framework zur Ermittlung des Benutzerstatus verwendet, verwendet der native Data Store
m&#246;glicherweise das Attribut <tt>userStatus</tt>. Bei den Attributdefinitionen muss die Gro&#223;-/Kleinschreibung beachtet werden.</p>

<a name="gdots"></a><h5>LDAPv3 Plugin-unterst&#252;tzte Typen und Vorg&#228;nge</h5>
<p>Gibt die Vorg&#228;nge an, die f&#252;r diesen LDAP-Server zugelassen sind. Die Standardvorg&#228;nge
sind die einzigen Vorg&#228;nge, die von diesem LDAPv3-Repository-Plugin unterst&#252;tzt werden. Folgende Vorg&#228;nge
werden vom LDAPv3-Repository-Plugin unterst&#252;tzt:</p>
<ul><li><p>Agent: Lesen, Erstellen, Bearbeiten, L&#246;schen</p></li>
<li><p>Gruppe: Lesen, Erstellen, Bearbeiten, L&#246;schen</p></li>
<li><p>Bereich: Lesen, Erstellen, Bearbeiten, L&#246;schen, Dienst</p></li>
<li><p>Benutzer: Lesen, Erstellen, Bearbeiten, L&#246;schen, Dienst</p></li></ul>
<p>Basierend auf Ihren LDAP-Servereinstellungen und den entsprechenden Aufgaben k&#246;nnen Sie Berechtigungen aus
der obigen Liste entfernen, jedoch keine weiteren Berechtigungen hinzuf&#252;gen. </p><p>Wenn das konfigurierte LDAPv3-Repository-Plugin auf eine Instanz von Sun Java Systems Directory
Server verweist, k&#246;nnen Berechtigungen f&#252;r den Typ <tt>role</tt> hinzugef&#252;gt werden. Anderenfalls kann
diese Berechtigung nicht hinzugef&#252;gt werden, da Rollen von anderen Data Stores m&#246;glicherweise
nicht unterst&#252;tzt werden. Die Berechtigungen f&#252;r den Typ "role" lauten wie folgt:</p>
<ul><li><p>Rolle: Lesen, Erstellen, Bearbeiten, L&#246;schen </p></li></ul>
<p>Wenn <tt>user</tt> ein unterst&#252;tzer Typ f&#252;r das LDAPv3-Repository ist, sind die Vorg&#228;nge
Lesen, Erstellen, Bearbeiten und L&#246;schen f&#252;r diesen Benutzer m&#246;glich. Anders ausgedr&#252;ckt: Wenn
<tt>user</tt> ein unterst&#252;tzter Typ ist, k&#246;nnen Sie dank der Vorg&#228;nge zum Lesen,
Bearbeiten, Erstellen und L&#246;schen Benutzereintr&#228;ge im Identit&#228;ts-Repository lesen, bearbeiten, erstellen und l&#246;schen.
&#220;ber den Vorgang <tt>user=service</tt> k&#246;nnen Federated Access Manager-Dienste auf Attribute in Benutzereintr&#228;gen
zugreifen. Zudem darf der Benutzer auf die dynamischen Dienstattribute zugreifen, wenn der
Dienst dem Bereich bzw. der Rolle zugewiesen ist, der der Benutzer zugeh&#246;rig
ist. </p><p>Der Benutzer darf auch die Benutzerattribute s&#228;mtlicher zugewiesener Dienste verwalten. Wenn der
Vorgang des Benutzers <tt>service</tt> lautet (<tt>user=service</tt>), gibt dies an, dass s&#228;mtliche dienstbezogene
Vorg&#228;nge unterst&#252;tzt werden. Diese Vorg&#228;nge sind <tt>assignService,</tt> <tt>unassignService,</tt> <tt> getAssignedServices,</tt> <tt>getServiceAttributes, removeServiceAttributes</tt> und <tt>modifyService.</tt></p>

<a name="gdosx"></a><h5>LDAPv3-Plugin Suchbereich</h5>
<p>Definiert den Bereich, der nach LDAPv3-Plugin-Eintr&#228;gen durchsucht wird. Der Bereich muss einer
der folgenden Werte sein:</p>
<ul><li><p>SCOPE_BASE</p></li>
<li><p>SCOPE_ONE</p></li>
<li><p>SCOPE_SUB (Standardwert)</p></li></ul>


<a name="gdotm"></a><h5>Suchattribut (LDAP-Benutzer)</h5>
<p>&#220;ber dieses Attribut wird die Art des Attributs festgelegt, nach dem eine
Suche nach einem Benutzer durchgef&#252;hrt wird. Wenn der DN des Benutzers beispielsweise
<tt>uid=user1,ou=people,dc=iplanet,dc=com </tt> lautet, ist <tt>uid</tt> das Namensattribut. </p>

<a name="gdotz"></a><h5>Suchfilter (LDAP-Benutzer)</h5>
<p>Gibt den Suchfilter an, der bei der Suche nach Benutzereintr&#228;gen verwendet wird.</p>

<a name="gdouv"></a><h5>LDAP-Benutzerobjektklasse</h5>
<p>Gibt die Objektklassen eines Benutzers an. Bei der Erstellung eines Benutzers wird
diese Liste mit Benutzerobjektklassen der Attributliste des Benutzers hinzugef&#252;gt.</p>

<a name="gdovh"></a><h5>LDAP-Benutzerattribute</h5>
<p>Legt die einem Benutzer zugeordnete Attributliste fest. Das Lesen und Schreiben von
Benutzerattributen, die sich nicht in dieser Liste befinden, ist unzul&#228;ssig. Bei den
Attributen muss die Gro&#223;-/Kleinschreibung beachtet werden. Die Objektklassen und das Attributschema m&#252;ssen
in Directory Server definiert sein, bevor Sie sie in diesem Attribut festlegen.</p>

<a name="gdovx"></a><h5>Zuordnungen des LDAP-Benutzererstellungsattributs</h5>
<p>Gibt an, welche Attribute bei der Erstellung eines Benutzers erforderlich sind. Bei
diesem Attribut wird folgende Syntax verwendet:</p><p><tt>DestinationAttributeName=SourceAttributeName</tt></p><p>Wenn der Name des Quellattributs fehlt, ist die Benutzer-ID (<tt>uid</tt>) der Standard.
Beispiel:</p>cn sn=givenName<p>Zur Erstellung eines Benutzerprofils ist sowohl <tt>cn</tt> als auch <tt>sn</tt> erforderlich. F&#252;r
<tt>cn</tt> wird der Wert des Attributs namens <tt>uid</tt> verwendet und f&#252;r <tt> sn</tt>
wird der Wert des Attributs namens <tt>givenName</tt> verwendet.</p>

<a name="gdovm"></a><h5>Benutzerstatusattribut</h5>
<p>Gibt den Attributnamen zur Angabe des Status des Benutzers an. </p>

<a name="gdoup"></a><h5>Aktiv-Wert f&#252;r Benutzerstatus</h5>
<p>Gibt den Attributnamen f&#252;r einen aktiven Benutzerstatus an. Der Standardwert ist <tt>active</tt>.</p>

<a name="gdouu"></a><h5>Inaktiv-Wert f&#252;r Benutzerstatus</h5>
<p>Gibt den Attributnamen f&#252;r einen inaktiven Benutzerstatus an. Der Standardwert ist <tt>inactive</tt>.</p>

<a name="gdowa"></a><h5>Suchattribut (LDAP-Gruppen)</h5>
<p>&#220;ber dieses Attribut wird die Art des Attributs festgelegt, nach dem eine
Suche nach einer Gruppe durchgef&#252;hrt wird. Der Standardwert ist <tt>cn</tt>.</p>

<a name="gdovs"></a><h5>Suchfilter (LDAP-Gruppen)</h5>
<p>Gibt den Suchfilter an, der bei der Suche nach Gruppeneintr&#228;gen verwendet wird.
Der Standardwert ist <tt>(objectclass=groupOfUniqueNames)</tt>.</p>

<a name="gdoun"></a><h5>Namensattribut f&#252;r LDAP-Gruppen-Container</h5>
<p>Gibt das Namensattribut eines Gruppen-Containers an, falls die Gruppe einem Container zugeordnet
ist. Anderenfalls bleibt dieses Attribut leer. Beispiel: Wenn sich der Gruppen-DN <tt>cn=group1,ou=groups,dc=iplanet,dc=com</tt>
in <tt>ou=groups</tt> befindet, lautet das Namensattribut des Gruppen-Containers <tt>ou</tt>.</p>

<a name="gdoux"></a><h5>LDAP-Gruppen-Containerwert</h5>
<p>Gibt den Wert des Gruppen-Containers an. Beispiel: Wenn sich der Gruppe-DN <tt>cn=group1,ou=groups,dc=iplanet,dc=com</tt>
im Container <tt>ou=groups</tt> befindet, lautet der Gruppen-Containerwert <tt>groups</tt>.</p>

<a name="gdovk"></a><h5>LDAP-Gruppenobjektklassen</h5>
<p>Gibt die Objektklassen f&#252;r Gruppen an. Bei der Erstellung einer Gruppe wird
diese Liste mit Gruppenobjektklassen der Attributliste der Gruppe hinzugef&#252;gt.</p>

<a name="gdouq"></a><h5>LDAP-Gruppenattribute</h5>
<p>Legt die einer Gruppe zugeordnete Attributliste fest. Das Lesen und Schreiben von
Gruppenattributen, die sich nicht in dieser Liste befinden, ist unzul&#228;ssig. Bei den
Attributen muss die Gro&#223;-/Kleinschreibung beachtet werden. Die Objektklassen und das Attributschema m&#252;ssen
in Directory Server definiert sein, bevor Sie sie in diesem Attribut festlegen.</p>

<a name="gdovn"></a><h5>Gruppenmitgliedschaftsattribut</h5>
<p>Gibt den Namen des Attributs an, dessen Wert eine Liste mit den
Namen aller Gruppen ist, denen der DN zugeordnet ist. Der Standardwert ist
<tt>memberOf</tt>. </p>

<a name="gdour"></a><h5>Eindeutiges Mitgliedsattribut</h5>
<p>Gibt den Namen des Attributs an, dessen Wert ein DN ist, der
dieser Gruppe zugeordnet ist. Der Standardwert ist <tt>uniqueMember</tt>.</p>

<a name="gdovi"></a><h5>Gruppenmitglied-URL-Attribut</h5>
<p>Gibt den Namen des Attributs an, dessen Wert ein LDAP-URL ist, der
zu Mitgliedern dieser Gruppe aufgel&#246;st wird. Der Standardwert ist <tt>memberUrl</tt>.</p>

<a name="gdout"></a><h5>Namensattribut f&#252;r LDAP-Personen-Container</h5>
<p>Gibt das Namensattribut des Personen-Containers an, falls der Benutzer einem Personen-Container zugeordnet
ist. Wenn sich der Benutzer nicht in einem Personen-Container befindet, bleibt das
Feld leer.</p>

<a name="gdovo"></a><h5>LDAP-Personen-Containerwert</h5>
<p>Gibt den Wert des Personen-Containers an. Der Standardwert ist <tt>people</tt>.</p>

<a name="gdovy"></a><h5>Suchattribut (LDAP-Agenten)</h5>
<p>&#220;ber dieses Attribut wird die Art des Attributs festgelegt, nach dem eine
Suche nach einem Agenten durchgef&#252;hrt wird. Der Standardwert ist <tt>uid</tt>.</p>

<a name="gdovj"></a><h5>LDAP-Agentencontainer-Namensattribut</h5>
<p>Gibt das Namensattribut des Agentencontainers an, falls der Agent einem Agentencontainer zugeordnet
ist. Wenn sich der Agent nicht in einem Agentencontainer befindet, bleibt das
Feld leer.</p>

<a name="gdowg"></a><h5>LDAP-Agentencontainerwert</h5>
<p>Gibt den Wert des Agentencontainers an. Der Standardwert ist <tt> agents</tt>.</p>

<a name="gdouz"></a><h5>Suchfilter (LDAP-Agenten)</h5>
<p>Definiert den Filter f&#252;r die Suche nach einem Agenten. Diesem Feld wird
das Suchattribut (LDAP-Agenten) vorangestellt. Es bildet den eigentlichen Agenten-Suchfilter.</p><p>Beispiel: Wenn das Suchattribut (LDAP-Agenten) den Wert <tt>uid</tt> enth&#228;lt und der Suchfilter
(LDAP-Benutzer) den Wert <tt>(objectClass=sunIdentityServerDevice)</tt>, lautet der tats&#228;chliche Benutzersuchfilter wie folgt: <tt>(&#38;(uid=*)(objectClass=sunIdentityServ erDevice))</tt></p>

<a name="gdove"></a><h5>LDAP-Agentenobjektklasse</h5>
<p>Gibt die Objektklassen f&#252;r Agenten an. Bei der Erstellung eines Agenten wird
diese Liste mit Agentenobjektklassen der Attributliste des Agenten hinzugef&#252;gt.</p>

<a name="gdous"></a><h5>LDAP-Agentenattribute</h5>
<p>Legt die einem Agenten zugeordnete Attributliste fest. Das Lesen und Schreiben von
Agentenattributen, die sich nicht in dieser Liste befinden, ist unzul&#228;ssig. Bei den
Attributen muss die Gro&#223;-/Kleinschreibung beachtet werden. Die Objektklassen und das Attributschema m&#252;ssen
in Directory Server definiert sein, bevor Sie sie in diesem Attribut festlegen.</p>

<a name="gdovt"></a><h5>Authentifizierbare Identity-Typen</h5>
<p>Gibt an, dass dieser Data Store Benutzer- und/oder Agenten-Identity-Typen authentifizieren kann, wenn
das Authentfizierungsmodul f&#252;r den Bereich auf "Data Store" eingestellt ist.</p>

<a name="gdouh"></a><h5>Permanente Suchbasis-DN</h5>
<p>Legt den Basis-DN f&#252;r die permanente Suche fest. Einige LDAPv3-Server unterst&#252;tzen die
permanente Suche nur auf Root-Suffix-Ebene.</p>

<a name="gdovu"></a><h5>Persistenter Suchfilter</h5>
<p>Definiert den Filter, der spezifische &#196;nderungen an Directory Server-Eintr&#228;gen zur&#252;ckgibt. Der Data
Store erh&#228;lt lediglich die &#196;nderungen, die dem definierten Filter entsprechen.</p>

<a name="gdouw"></a><h5>Durchgehende maximale Leerlaufzeit bei Suche bevor ein Neustart durchgef&#252;hrt wird</h5>
<p>Legt die maximale Leerlaufzeit fest, bevor die permanente Suche neu gestartet wird.
Der Wert muss gr&#246;&#223;er als 1 sein. Bei Werten kleiner oder gleich
1 wird die Suche unabh&#228;ngig von der Leerlaufzeit der Verbindung neu gestartet.</p><p>Ein besonderer Fall sind Federated Access Manager-Implementierungen mit Lastenausgleich. Manche Lastenausgleichsysteme werden
nach einer gewissen Leerlaufzeit wegen Zeit&#252;berschreitung beendet. In diesem Fall sollten Sie
Durchgehende maximale Leerlaufzeit bei Suche bevor ein Neustart durchgef&#252;hrt wird auf einen
geringeren Wert setzen als den f&#252;r den Lastenausgleich angegebenen Zeit&#252;berschreitungswert.</p>

<a name="gdowh"></a><h5>Maximale Anzahl der Versuche nach einem Fehler</h5>
<p>Legt die maximale Anzahl der Wiederholungsversuche f&#252;r permanente Suchvorg&#228;nge fest, wenn einer
der in LDAPException-Fehlercodes beim Wiederholen auf angegebenen Fehler auftritt.</p>

<a name="gdouj"></a><h5>Zeit zwischen zwei Versuchen</h5>
<p>Gibt die Zeit zwischen den einzelnen Wiederholungsversuchen an. Dieses Attribut gilt nur
f&#252;r permanente Suchverbindungen.</p>

<a name="gdovf"></a><h5>LDAPException-Fehlercodes beim Wiederholen auf</h5>
<p>Legt die Fehlercodes fest, bei denen ein permanenter Suchvorgang wiederholt wird. Dieses
Attribut gilt nur f&#252;r die permanente Suche (nicht f&#252;r die anderen LDAP-Vorg&#228;nge).</p>

<a name="gdovb"></a><h5>Zwischenspeicherung</h5>
<p>Wenn diese Option aktiviert ist, kann Federated Access Manager aus dem Data
Store abgerufene Daten zwischenspeichern.</p>

<a name="gdovc"></a><h5>Maximale Lebensdauer zwischengespeicherter Elemente</h5>
<p>Gibt an, wie lange Daten maximal im Cache verbleiben, bevor sie entfernt
werden. Die Werte werden in Sekunden definiert.</p>

<a name="gdowi"></a><h5>Maximale Cache-Gr&#246;&#223;e</h5>
<p>Gibt die maximale Gr&#246;&#223;e des Cache an. Je h&#246;her der Wert, desto
mehr Daten k&#246;nnen gespeichert werden (hierf&#252;r ist jedoch auch entsprechend mehr Speicher
erforderlich). Die Werte werden in Byte definiert.</p>
<br/>

</body>
</html>
