<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Agenten-Authentifizierer - Online-Hilfe zur Sun OpenSSO 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="ghfif"></a><h4>Agenten-Authentifizierer</h4>
<p>Ein Agenten-Authentifizierer ist ein Agenttyp, der nach seiner Authentifizierung die schreibgesch&#252;tzten Daten
von Agentenprofilen abrufen kann, die zum Lesen durch den Agenten-Authentifizierer ausgew&#228;hlt sind.
Die Agentenprofile k&#246;nnen einen beliebigen Typ (J2EE, WSP, Discovery usw.) aufweisen, m&#252;ssen
jedoch im selben Bereich vorhanden sein. Benutzer, die die Berechtigungsnachweise (Benutzername und
Passwort) des Agenten-Authentifizierers kennen, k&#246;nnen die Daten des Agentenprofils lesen, verf&#252;gen jedoch
nicht &#252;ber die Berechtigungen eines Agentenadministrators zum Erstellen, Aktualisieren oder L&#246;schen. </p><p>Der Agenten-Authentifizierer enth&#228;lt die folgenden Attribute:</p>

<a name="ghfjj"></a><h5>Password</h5>
<p>Das Passwort wurde bei der Erstellung des Agenten-Authentifiziererprofils festgelegt. Sie k&#246;nnen das
Passwort jedoch jederzeit sp&#228;ter &#228;ndern.</p>

<a name="ghfiu"></a><h5>Passwortbest&#228;tigung</h5>
<p>Die Best&#228;tigung des Passworts wurde bei der Erstellung des Agenten-Authentifiziererprofils durchgef&#252;hrt. Wenn
Sie das Passwort &#228;ndern, m&#252;ssen Sie die &#196;nderung best&#228;tigen.</p>

<a name="ghfka"></a><h5>Status</h5>
<p>Die Option <tt>Active</tt> (Aktiv) wird bei der Erstellung des Agenten-Authentifizierers ausgew&#228;hlt. W&#228;hlen
Sie <tt>Inactive</tt> (Inaktiv) nur aus, wenn Sie den Schutz, den der Agent
bietet, aufheben m&#246;chten.</p>

<a name="ghfig"></a><h5>Agentenprofile mit Lesezugriff</h5>
<p>Mit diesem Attribut wird eine Liste von OpenSSO-Agenten definiert, deren Profildaten vom
Agenten-Authentifizierer gelesen werden. Die Agenten k&#246;nnen einen beliebigen Typ (J2EE, WSP, Discovery
usw.) aufweisen, m&#252;ssen jedoch im selben Bereich vorhanden sein. Um der Liste
einen Agenten hinzuzuf&#252;gen, w&#228;hlen Sie dessen Namen aus, und klicken Sie auf
&#8222;Hinzuf&#252;gen&#8220;.</p>
<br/>

</body>
</html>
