<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>So f&#252;gen Sie einer Richtlinie einen Betreff hinzu. - Online-Hilfe zur Sun OpenSSO 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="policy.subjectadd"></a><h5>So f&#252;gen Sie einer Richtlinie einen Betreff hinzu.</h5>
<ol>
<li><b><a name="indexterm-28"></a>Wenn Sie die Richtlinie bereits erstellt haben, klicken Sie auf den Namen
der Richtlinie, f&#252;r die Sie den Betreff hinzuf&#252;gen m&#246;chten. Wenn die Richtlinie
noch nicht erstellt wurde, ziehen Sie <a href="policy.policynormaladd.html">So erstellen Sie eine neue normale Richtlinie</a> zurate.</b></li>
<li><b>Klicken Sie unter der Liste "Betreff" auf "Neu".</b></li>
<li><b>W&#228;hlen Sie einen der Standard-Betrefftypen aus. Eine Beschreibung der Betrefftypen finden Sie
unter <a href="policy.selectsubjecttype.html">Betreffe</a></b></li>
<li><b>Klicken Sie auf "Weiter".</b></li>
<li><b>Geben Sie einen Namen f&#252;r den Betreff ein.</b></li>
<li><b>Aktivieren bzw. deaktivieren Sie das Feld "Exklusiv".</b><p>Falls dieses Feld nicht aktiviert ist (Standard), wird die Richtlinie auf die
Identity angewendet, die Mitglied des Betreffs ist. Falls dieses Feld aktiviert ist,
wird die Richtlinie auf die Identi&#228;t angewendet, die <b>kein</b> Mitglied des Betreffs
ist.</p><p>Falls in der Richtlinie mehrere Betreffe vorhanden sind, wird die Richtlinie auf
die Identit&#228;t angewendet, wenn mindestens einer der Betreffe impliziert, dass die Richtlinie
auf die angegebene Identity zutrifft.</p></li>
<li><b>F&#252;hren Sie eine Suche durch, um die Identit&#228;ten anzuzeigen, die Sie dem
Betreff hinzuf&#252;gen m&#246;chten. Dieser Schritt gilt nicht f&#252;r die Betreffe "Authentifizierte Benutzer"
und "Webdienste-Clients".</b><p>Das Standard-Suchmuster (&#42;) zeigt alle qualifizierten Eintr&#228;ge an.</p></li>
<li><b>W&#228;hlen Sie die einzelnen Identit&#228;ten, die Sie dem Betreff hinzuf&#252;gen m&#246;chten, und
klicken Sie auf "Alle hinzuf&#252;gen", um alle Identit&#228;ten gleichzeitig hinzuzuf&#252;gen. Klicken Sie
auf "Hinzuf&#252;gen", um die Identit&#228;ten der Liste der ausgew&#228;hlten Identit&#228;ten hinzuzuf&#252;gen. Dieser
Schritt trifft nicht f&#252;r den Betreff "Authentifizierte Benutzer" zu.</b></li>
<li><b>Klicken Sie auf "Fertig stellen".</b></li>
<li><b>Zum Entfernen eines Betreffs aus einer Richtlinie w&#228;hlen Sie den Betreff aus
und klicken Sie auf "L&#246;schen". Zum Bearbeiten einer Betreffdefinition klicken Sie auf
den Namen des Betreffs.</b></li></ol>
<br/>

</body>
</html>
