<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Benutzer - Online-Hilfe zur Sun OpenSSO 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.scserviceprofile.iplanetamuserservice"></a><h4>Benutzer</h4>
<p><a name="indexterm-198"></a>Die Standard-Benutzereinstellungen sind &#252;ber den Benutzerdienst vordefiniert. Dazu z&#228;hlen Zeitzone, L&#228;ndereinstellung und
DN-Startansicht. Die Benutzerdienstattribute sind dynamische Attribute.</p>
<ul><li><p><a href="#fxckn">Von Benutzer bevorzugte Sprache</a></p></li>
<li><p><a href="#fxcnb">Von Benutzer bevorzugte Zeitzone</a></p></li>
<li><p><a href="#fxcte">Vererbte L&#228;ndereinstellungen</a></p></li>
<li><p><a href="#fxcpk">Admin-DN-Startansicht</a></p></li>
<li><p><a href="#fxciz">Standard-Benutzerstatus</a></p></li></ul>


<a name="fxckn"></a><h5>Von Benutzer bevorzugte Sprache</h5>
<p>Dieses Feld gibt die vom Benutzer ausgew&#228;hlte Sprache f&#252;r den in der
OpenSSO-Konsole angezeigten Text an. Der Standardwert ist ";en". Mit diesem Wert wird
der Benutzersitzung ein Lokalisierungsschl&#252;sselsatz zugeordnet, so dass der am Bildschirm angezeigten Text
in der vom Benutzer bevorzugten Sprache angzeigt wird.</p>

<a name="fxcnb"></a><h5>Von Benutzer bevorzugte Zeitzone</h5>
<p>Dieses Feld gibt die Zeitzone an, in der sich der Benutzer befindet,
wenn er auf die OpenSSO-Konsole zugreift. Es gibt keinen Standardwert.</p>

<a name="fxcte"></a><h5>Vererbte L&#228;ndereinstellungen</h5>
<p>Dieses Feld gibt die L&#228;ndereinstellung f&#252;r den Benutzer an. Der Standardwert ist
en_US. Eine Liste der L&#228;ndereinstellungen finden Sie unter  <a href="supportedlang.html">Unterst&#252;tzte Sprach- bzw. L&#228;ndereinstellungen</a>.</p>

<a name="fxcpk"></a><h5>Admin-DN-Startansicht</h5>
<p>Wenn der Benutzer ein OpenSSO-Administrator ist, gibt dieses Feld den Knoten an,
der bei der Benutzeranmeldung als Startpunkt f&#252;r die Anzeige in der OpenSSO-Konsole
verwendet wird. Es gibt keinen Standardwert. Es kann ein g&#252;ltiger DN verwendet
werden, auf den der Benutzer mindestens Lesezugriff haben muss.</p>

<a name="fxciz"></a><h5>Standard-Benutzerstatus</h5>
<p>Diese Option gibt den Standardstatus f&#252;r alle neu erstellten Benutzer an. Dieser
Status wird durch den Status des Benutzereintrags ersetzt. Nur aktive Benutzer k&#246;nnen
sich &#252;ber OpenSSO authentifizieren. Der Standardwert ist ";Aktiv". W&#228;hlen Sie eine der
folgenden Optionen aus dem Pulldown-Men&#252; aus:</p><dl><dt>Aktiv</dt>
<dd><p>Der Benutzer kann sich &#252;ber OpenSSO authentifizieren.</p></dd>
<dt>Inaktiv</dt>
<dd><p>Der Benutzer kann nicht durch OpenSSO authentifiziert werden, das Benutzerprofil verbleibt jedoch im Verzeichnis.</p></dd>
</dl>
<p>Der individuelle Benutzerstatus wird in vier Schritten eingerichtet: Zun&#228;chst wird der Benutzerdienst
registriert und der zu verwendende Wert ausgew&#228;hlt. Anschlie&#223;end wird dieser Wert auf
eine Rolle bezogen und diese wiederum dem Benutzerprofil hinzugef&#252;gt.</p>
<br/>

</body>
</html>
