<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Passwortzur&#252;cksetzung - Online-Hilfe zur Sun OpenSSO 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.scserviceprofile.iplanetampasswordresetservice"></a><h4>Passwortzur&#252;cksetzung</h4>
<p><a name="indexterm-190"></a>OpenSSO bietet einen Passwortzur&#252;cksetzungsdienst, mit dem die Benutzer eine E-Mail-Nachricht mit einem
neuen Passwort erhalten oder ihr Passwort zum Zugriff auf einen bestimmten Dienst
oder eine bestimmte Anwendung zur&#252;cksetzen k&#246;nnen, die durch OpenSSO gesch&#252;tzt wird. Bei
den Passwortzur&#252;cksetzungsattributen handelt es sich um Bereichsattribute. Es existieren folgende Attribute:</p>
<ul><li><p><a href="#fsuwe">Benutzervalidierung</a></p></li>
<li><p><a href="#fsuwd">Geheime Frage</a></p></li>
<li><p><a href="#fsuwh">Suchfilter</a></p></li>
<li><p><a href="#fsuwi">Basis-DN</a></p></li>
<li><p><a href="#fsuwj">Verbindungs-DN</a></p></li>
<li><p><a href="#fsuwl">Verbindungs-Passwort</a></p></li>
<li><p><a href="#fsuwk">Option f&#252;r Passwortzur&#252;cksetzung</a></p></li>
<li><p><a href="#fsuwq">Benachrichtigungsfunktion f&#252;r Passwort&#228;nderung</a></p></li>
<li><p><a href="#fsuwp">Passwortzur&#252;cksetzung</a></p></li>
<li><p><a href="#fsuwm">Pers&#246;nliche Frage</a></p></li>
<li><p><a href="#fsuwo">Maximale Anzahl an Fragen</a></p></li>
<li><p><a href="#fsuwn">&#196;nderung des Passworts bei n&#228;chster Anmeldung erzwingen</a></p></li>
<li><p><a href="#fsuwr">Passwortzur&#252;cksetzungfehler Sperre</a></p></li>
<li><p><a href="#fsuxh">Passwortzur&#252;cksetzungsfehler Sperrz&#228;hlung</a></p></li>
<li><p><a href="#fsuww">Passwortzur&#252;cksetzungsfehler Sperrintervall</a></p></li>
<li><p><a href="#fsuxg">E-Mail-Adresse f&#252;r das Versenden der Sperrbenachrichtigung</a></p></li>
<li><p><a href="#fsuwt">Benutzer nach n Fehlern warnen</a></p></li>
<li><p><a href="#fsuxa">Passwortzur&#252;cksetzungsfehler Sperrdauer </a> </p></li>
<li><p><a href="#fsuxb">Passwortzur&#252;cksetzung Sperrattributname</a></p></li>
<li><p><a href="#fsuxt">Passwortzur&#252;cksetzung Sperrattributwert</a></p></li></ul>


<a name="fsuwe"></a><h5>Benutzervalidierung</h5>
<p>Dieses Attribut gibt den Namen des Benutzerattributs an, das f&#252;r die Suche
nach dem Benutzer verwendet wird, dessen Passwort zur&#252;ckgesetzt werden soll. </p>

<a name="fsuwd"></a><h5>Geheime Frage</h5>
<p>Dieses Feld erm&#246;glicht es Ihnen, eine Liste mit Fragen hinzuzuf&#252;gen, die der
Benutzer f&#252;r das Zur&#252;cksetzen des Passworts verwenden kann. To add a question,
type it in the Secret Question filed and click Add. The selected
questions will appear in the user's User Profile page. Der Benutzer kann
die Frage anschlie&#223;end f&#252;r die Passwortzur&#252;cksetzung ausw&#228;hlen. Wenn Sie das Attribut ";Pers&#246;nliche
Frage aktivieren" ausw&#228;hlen, kann der Benutzer eine eigene Frage formulieren.</p>

<a name="fsuwh"></a><h5>Suchfilter</h5>
<p>Dieses Attribut gibt den f&#252;r die Suche nach Benutzereintr&#228;gen verwendeten Filter an.</p>

<a name="fsuwi"></a><h5>Basis-DN</h5>
<p>Dieses Attribut gibt die DN f&#252;r den Startpunkt f&#252;r die Benutzersuche an.
Wenn kein DN angegeben ist, wird der Startpunkt f&#252;r die Suche &#252;ber
den Bereichs-DN festgelegt. Um Proxy-Authentifizierungsprobleme zu vermeiden, sollten Sie folgenden Wert nicht
als Basis-DN verwenden:<tt>cn=directorymanager</tt>.</p>

<a name="fsuwj"></a><h5>Verbindungs-DN</h5>
<p>Dieser Wert wird zusammen mit dem Attribut ";Verbindungs-Passwort" f&#252;r das Zur&#252;cksetzen des
Benutzerpassworts verwendet.</p>

<a name="fsuwl"></a><h5>Verbindungs-Passwort</h5>
<p>Dieser Wert wird zusammen mit dem Attribut ";Verbindungs-DN" f&#252;r das Zur&#252;cksetzen des
Benutzerpassworts verwendet.</p>

<a name="fsuwk"></a><h5>Option f&#252;r Passwortzur&#252;cksetzung</h5>
<p>Dieses Attribut legt den Klassennamen f&#252;r die Passwortzur&#252;cksetzung fest. The default classname
is <tt>com.sun.identity.password.RandomPasswordGenerator </tt> . Die Passwortzur&#252;cksetzungsklasse kann &#252;ber ein Plugin angepasst werden. Diese
Klasse muss &#252;ber die Schnittstelle <tt>PasswordGenerator </tt> implementiert werden.</p>

<a name="fsuwq"></a><h5>Benachrichtigungsfunktion f&#252;r Passwort&#228;nderung</h5>
<p>Dieses Attribut bestimmt die Methode, die f&#252;r die Benutzerbenachrichtigung bei der Passwortzur&#252;cksetzung
angewendet wird. The default classname is: <tt>com.sun.identity.password.EmailPassword </tt> The password notification class can
be customized through a plug-in. Diese Klasse muss &#252;ber die Schnittstelle <tt>NotifyPassword </tt>
implementiert werden. Weitere Informationen finden Sie im Handbuch f&#252;r Entwickler zu OpenSSO.</p>

<a name="fsuwp"></a><h5>Passwortzur&#252;cksetzung</h5>
<p>Wenn Sie dieses Attribut ausw&#228;hlen, wird die Funktion zur Passwortzur&#252;cksetzung aktiviert.</p>

<a name="fsuwm"></a><h5>Pers&#246;nliche Frage</h5>
<p>Wenn Sie dieses Attribut ausw&#228;hlen, wird allen Benutzern das Formulieren einer eigenen
Frage f&#252;r die Passwortzur&#252;cksetzung erlaubt.</p>

<a name="fsuwo"></a><h5>Maximale Anzahl an Fragen</h5>
<p>Dieser Wert gibt die maximale Anzahl an Fragen an, die auf der
Seite zur Passwortzur&#252;cksetzung gestellt werden sollen.</p>

<a name="fsuwn"></a><h5>&#196;nderung des Passworts bei n&#228;chster Anmeldung erzwingen</h5>
<p>Wenn Sie diese Option aktivieren, muss der Benutzer bei der n&#228;chsten Anmeldung
sein Passwort &#228;ndern. Wenn Sie festlegen m&#246;chten, dass au&#223;er den Administratoren auf
erster Ebene auch andere Administratoren die Option zum Erzwingen einer Passwort&#228;nderung festlegen
d&#252;rfen, m&#252;ssen Sie die Standardberechtigungs-ACIs so &#228;ndern, dass der Zugriff auf das
Attribut erlaubt ist.</p>

<a name="fsuwr"></a><h5>Passwortzur&#252;cksetzungfehler Sperre</h5>
<p>Dieses Attribut gibt an, ob Benutzern das Zur&#252;cksetzen des Passworts verweigert wird,
wenn die Passwortzur&#252;cksetzung mithilfe der Anwendung zur Passwortzur&#252;cksetzung zuvor fehlgeschlagen ist. Standardm&#228;&#223;ig
ist diese Funktion deaktiviert.</p>

<a name="fsuxh"></a><h5>Passwortzur&#252;cksetzungsfehler Sperrz&#228;hlung</h5>
<p>Dieses Attribut legt die Anzahl der Versuche fest, &#252;ber die ein Benutzer
innerhalb des im Attribut ";Passwortzur&#252;cksetzungsfehler Sperrintervall" festgelegten Zeitraums f&#252;r die Zur&#252;cksetzung des
Passwort verf&#252;gt, bevor der Benutzer gesperrt wird. Beispiel: Wenn f&#252;r ";Passwortzur&#252;cksetzungsfehler Sperrz&#228;hlung"
der Wert 5 und f&#252;r "Passwortzur&#252;cksetzungsfehler Sperrintervall" 5 Minuten festgelegt ist, hat
der Benutzer f&#252;nf Versuche, um innerhalb eines Zeitraums von 5 Minuten sein
Passwort zur&#252;ckzusetzen, bevor er gesperrt wird.</p>

<a name="fsuww"></a><h5>Passwortzur&#252;cksetzungsfehler Sperrintervall</h5>
<p>Dieses Attribut gibt die Zeit (in Minuten) an, die dem Benutzer zur
Verf&#252;gung steht, um die Versuche zur Passwortzur&#252;cksetzung (wie in ";Passwortzur&#252;cksetzungfehler Sperrz&#228;hler" festgelegt)
durchzuf&#252;hren, bevor er gesperrt wird.</p>

<a name="fsuxg"></a><h5>E-Mail-Adresse f&#252;r das Versenden der Sperrbenachrichtigung</h5>
<p>Dieses Attribut gibt eine E-Mail-Adresse an, an die eine Benachrichtigung gesendet wrid,
wenn ein Benutzer vom Passwortzur&#252;cksetzungsdienst gesperrt wird. Geben Sie mehrere E-Mail-Adressen durch
ein Leerzeichen voneinander getrennt ein.</p>

<a name="fsuwt"></a><h5>Benutzer nach n Fehlern warnen</h5>
<p>Dieses Attribut gibt die Anzahl der Passwortzur&#252;cksetzungsfehler an, die auftreten k&#246;nnen, bevor
OpenSSO eine Meldung mit einer Benutzersperrwarnung sendet.</p>

<a name="fsuxa"></a><h5>Passwortzur&#252;cksetzungsfehler Sperrdauer </h5>
<p>Dieses Attribut gibt die Dauer (in Minuten) an, die der Benutzer warten
muss, um eine Passwortzur&#252;cksetzung nach einer Sperre durchf&#252;hren zu k&#246;nnen.</p>

<a name="fsuxb"></a><h5>Passwortzur&#252;cksetzung Sperrattributname</h5>
<p>Dieses Attribut enth&#228;lt den <i>inetuserstatus</i>-Wert, der in ";Passwortzur&#252;cksetzung Sperrattributwert" festgelegt ist. Wenn
die Passwortzur&#252;cksetzung f&#252;r einen Benutzer gesperrt wurde und die Variable ";Passwortzur&#252;cksetzungsfehler Sperrdauer
(Minuten)" auf 0 gesetzt ist, wird <i>inetuserstatus</i> auf  "deaktiviert" gesetzt, sodass
der Benutzer keine weiteren Versuche zur Passwortzur&#252;cksetzung unternehmen kann.</p>

<a name="fsuxt"></a><h5>Passwortzur&#252;cksetzung Sperrattributwert</h5>
<p>Dieses Attribut gibt den (in ";Passwortzur&#252;cksetzung Sperrattributname" festgelegten) Wert <i>inetuserstatus</i> des Benutzerstatus
an ("aktiviert" oder "deaktiviert"). Wenn die Passwortzur&#252;cksetzung f&#252;r einen Benutzer gesperrt wurde
und die Variable ";Passwortzur&#252;cksetzungsfehler Sperrdauer (Minuten)" auf 0 gesetzt ist, wird <i>inetuserstatus</i>
auf  "deaktiviert" gesetzt, sodass der Benutzer keine weiteren Versuche zur Passwortzur&#252;cksetzung
unternehmen kann.</p>
<br/>

</body>
</html>
