<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>LDAP - Online-Hilfe zur Sun OpenSSO 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.scserviceprofile.iplanetamauthldapservice"></a><h4>LDAP</h4>
<p><a name="indexterm-175"></a>Dieses Modul erm&#246;glicht die Authentifzierung mithilfe von LDAP-Bind, einem Directory Server-Vorgang, bei
dem ein Benutzer-ID-Passwort einem bestimmten LDAP-Eintrag zugeordnet wird. F&#252;r einen Bereich k&#246;nnen
mehrere LDAP-Authentifizierungskonfigurationen eingerichtet werden. Bei den Attributen f&#252;r die LDAP-Authentifizierung handelt es
sich um Bereichsattribute. Es existieren folgende Attribute:</p>
<ul><li><p><a href="#fwazv">Prim&#228;rer LDAP-Server</a></p></li>
<li><p><a href="#fwbac">Sekund&#228;rer LDAP-Server</a></p></li>
<li><p><a href="#fwazx">DN zum Starten von Benutzersuche</a></p></li>
<li><p><a href="#fwazz">DN f&#252;r Root-Benutzer-BIND</a></p></li>
<li><p><a href="#fwazq">Passwort f&#252;r Root-Benutzer-BIND</a></p></li>
<li><p><a href="#fwazu">Passwort f&#252;r Root-Benutzer-Bind (Best&#228;tigung)</a></p></li>
<li><p><a href="#fwazs">Zum Abrufen des Benutzerprofils verwendetes Attribut</a></p></li>
<li><p><a href="#fwazy">Zum Suchen nach einem zu authentifizierenden Benutzer verwendete Attribute</a></p></li>
<li><p><a href="#fwazw">Benutzer-Suchfilter</a></p></li>
<li><p><a href="#fwbai">Suchbereich</a></p></li>
<li><p><a href="#fwbal">SSL-Zugriff auf LDAP-Server aktivieren</a></p></li>
<li><p><a href="#fwbak">Benutzer-DN zur Authentifizierung zur&#252;ckgeben</a></p></li>
<li><p><a href="#fwbaf">Intervall der LDAP-Server&#252;berpr&#252;fung</a></p></li>
<li><p><a href="#fwbah">Attributliste f&#252;r Benutzererstellung</a></p></li>
<li><p><a href="#fwbaj">Authentifizierungsebene</a></p></li></ul>


<a name="fwazv"></a><h5>Prim&#228;rer LDAP-Server</h5>
<p>Gibt den Hostnamen und die Anschlussnummer des w&#228;hrend der OpenSSO-Installation festgelegten prim&#228;ren
LDAP-Servers an. Es handelt sich hierbei um den Server, auf den bei
der Authentifizierung zuerst zugegriffen wird. Das Format lautet <tt></tt><i> hostname:port </i><tt></tt>. Wenn keine Portnummer
angegeben wurde, kann in der Regel <tt>389</tt> verwendet werden .</p><p>Wenn Sie OpenSSO in mehreren Dom&#228;nen bereitstellen, k&#246;nnen Sie den Kommunikationslink zwischen
bestimmten Instanzen von OpenSSO und Directory Server in folgendem Format angeben (bei
Mehrfacheingaben muss der Name des lokalen Servers vorangestellt werden):</p><p><tt>local_servername|server:port local_servername2|server2:port2 ...</tt></p><p>Wenn beispielsweise zwei OpenSSO-Instanzen an unterschiedlichen Standorten bereitgestellt wurden (L1-machine1-IS und L2-
machine2-IS), die mit unterschiedlichen Instanzen von Directory Server kommunizieren (L1-machine1-DS und L2-machine2-DS),
w&#252;rde dies wie folgt aussehen:</p><p><tt>L1-machine1-IS.example.com|L1-machine1-DS.example.com:389 </tt></p><p><tt>L2-machine2-IS.example.com|L2-machine2-DS.example.com:389 </tt></p>

<a name="fwbac"></a><h5>Sekund&#228;rer LDAP-Server</h5>
<p>Gibt den Hostnamen und die Anschlussnummer eines zweiten f&#252;r die OpenSSO-Plattform verf&#252;gbaren
LDAP-Servers an. Wenn der prim&#228;re LDAP-Server nicht auf eine Authentifizierungsanforderung reagiert, wird
auf den zweiten Server zugegriffen. Sobald der prim&#228;re Server wieder l&#228;uft, kehrt
OpenSSO zu diesem Server zur&#252;ck. Das Format lautet ebenfalls <tt></tt><i>hostname:port </i><tt></tt>. Bei Mehrfacheingaben
muss der lokale Servername vorangestellt werden.</p>
<hr><p><b>Achtung &#8211; </b>Bei einer Authentifizierung von Benutzern an einem Directory Server, der sich als
Remote-Server an einem anderen Standort als OpenSSO befindet, ist es wichtig, dass
sowohl die prim&#228;ren als auch die sekund&#228;ren LDAP-Server-Anschl&#252;sse &#252;ber Werte verf&#252;gen. Die
Wert f&#252;r einen Directory Server-Standort kann f&#252;r beide Felder verwendet werden.</p>
<hr>


<a name="fwazx"></a><h5>DN zum Starten von Benutzersuche</h5>
<p>Gibt den DN des Knotens an, bei dem die Suche nach einem
Benutzer beginnen soll. (Um die Systemleistung nicht zu beeintr&#228;chtigen, sollte dieser DN
den Startpunkt so genau wie m&#246;glich angeben.) Der Standardwert ist die Root-Ebene
des Verzeichnisbaums. Es wird jeder g&#252;ltige DN erkannt. Wenn im Suchbereich-Attribut ";OBJECT"
ausgew&#228;hlt ist, sollte der DN die Ebene angeben, die unmittelbar &#252;ber der
Ebene liegt, in der sich das Profil befindet. Bei Mehrfacheingaben muss der
lokale Servername vorangestellt werden. Das Format lautet <tt></tt><i>servername|search dn</i><tt></tt>.</p><p>F&#252;r Mehrfacheingaben:</p><p><tt></tt><i>servername1|search dn servername2|search dn servername3|search dn</i><tt>...</tt></p><p>Wenn unter der Root-Organisation mehrere Eintr&#228;ge mit derselben Benutzer-ID vorhanden sind, sollte
dieser Parameter so festgelegt werden, dass nur nach einem einzigen Eintrag zur
Authentifizierung gesucht bzw. nur ein einziger gefunden werden kann. Wenn beispielsweise die
Agenten-ID und die Benutzer-ID unter der Root-Organisation identisch sind, sollte dieser Parameter
<tt>ou=Agents</tt> (f&#252;r die Authentifizierung der Root-Organisation mithilfe der Agenten-ID) und <tt>ou=People, </tt> (f&#252;r
die Authentifizierung der Root-Organisation mithilfe der Benutzer-ID) lauten.</p>

<a name="fwazz"></a><h5>DN f&#252;r Root-Benutzer-BIND</h5>
<p>Gibt den DN des Benutzers an, der als Administrator den BIND-Vorgang mit
dem im Feld ";Primary LDAP-Server und -Anschluss" angegebenen Directory Server durchf&#252;hren soll.
Der BIND-Vorgang f&#252;r den Authentifizierungsdienst muss mit diesem DN erfolgen, um die
Suche nach einem mit der Anmeldungs-ID &#252;bereinstimmenden Benutzer-DN zu erm&#246;glichen. Der Standardwert
lautet <tt>amldapuser.</tt> Jeder g&#252;ltige DN wird erkannt.</p>

<a name="fwazq"></a><h5>Passwort f&#252;r Root-Benutzer-BIND</h5>
<p>Gibt das Passwort des im Feld ";DN f&#252;r Root-Benutzer-BIND" festgelegten Administratorprofils an.
Es gibt keinen Standardwert. Nur das g&#252;ltige LDAP-Passwort des Administrators ist zul&#228;ssig.</p>

<a name="fwazu"></a><h5>Passwort f&#252;r Root-Benutzer-Bind (Best&#228;tigung)</h5>
<p> Best&#228;tigen Sie das Passwort.</p>

<a name="fwazs"></a><h5>Zum Abrufen des Benutzerprofils verwendetes Attribut</h5>
<p>Gibt das zur Benennung von Benutzereintr&#228;gen verwendete Attribut an. In OpenSSO wird
standardm&#228;&#223;ig davon ausgegangen, dass Benutzereintr&#228;ge durch das Attribut "uid" identifiziert werden. Wenn
auf Ihrem Directory Server ein anderes Attribut verwendet wird (z. B. <i>givenname</i>),
geben Sie den Namen des verwendeten Attributs in diesem Feld ein.</p>

<a name="fwazy"></a><h5>Zum Suchen nach einem zu authentifizierenden Benutzer verwendete Attribute</h5>
<p>Listet die Attribute auf, die vom Suchfilter f&#252;r einen zu authentifizierenden Benutzer
zu verwenden sind und die es dem Benutzer erm&#246;glichen, eine Authentifizierung mit
mehreren Attributen im Benutzereintrag durchzuf&#252;hren. Wird dieses Feld beispielsweise auf  <i>uid</i>,
<i>employeenumber </i> und <i>mail</i> eingestellt, kann der Benutzer jeden dieser Namen f&#252;r die
Authentifizierung verwenden. Diese Attribute m&#252;ssen getrennt eingestellt werden. </p>

<a name="fwazw"></a><h5>Benutzer-Suchfilter</h5>
<p>Gibt ein Attribut an, das f&#252;r die Suche nach dem im Feld
";DN zum Starten von Benutzersuche" festgelegten Benutzer verwendet wird. Dieses Feld wird
gemeinsam mit dem Benutzer-Namensattribut eingesetzt. Es gibt keinen Standardwert. Alle g&#252;ltigen Benutzereintragsattribute
werden erkannt.</p>

<a name="fwbai"></a><h5>Suchbereich</h5>
<p>Gibt an, wie viele Ebenen des Directory Servers bei der Suche nach
einem &#252;bereinstimmenden Benutzerprofil durchsucht werden sollen. Die Suche beginnt bei dem im
Attribut  <a href="#fwazx">DN zum Starten von Benutzersuche</a> angegebenen Knoten. Der Standardwert ist SUBTREE. In der Liste
stehen folgende Auswahlm&#246;glichkeiten zur Verf&#252;gung:</p><dl><dt>OBJEKT</dt>
<dd><p>Die Suche beschr&#228;nkt sich auf den angegebenen Knoten.</p></dd>
<dt>EINEEBENE</dt>
<dd><p>Die Suche beginnt auf der Ebene des angegebenen Knotens und wird auf die unmittelbar darunter liegende Ebene ausgeweitet.</p></dd>
<dt>UNTERSTRUKTUR</dt>
<dd><p>Die Suche umfasst den angegebenen Knoten sowie alle Ebenen unterhalb dieses Knotens.</p></dd>
</dl>


<a name="fwbal"></a><h5>SSL-Zugriff auf LDAP-Server aktivieren</h5>
<p>Aktiviert den SSL-Zugriff auf die in den Feldern ";Primary LDAP-Server und -Anschluss"
und "Secondary LDAP-Server und -Anschluss" angegebenen Directory Server. Das Kontrollk&#228;stchen ist standardm&#228;&#223;ig
nicht markiert und das SSL-Protokoll wird f&#252;r den Zugriff auf den Directory
Server nicht verwendet.</p><p>Wenn der LDAP-Server mit aktiviertem SSL (LDAPS) ausgef&#252;hrt wird, muss OpenSSO mit
den entsprechenden vertrauensw&#252;rdigen SSL-Zertifikaten konfiguriert sein, damit Access Manager &#252;ber das LDAPS-Protokoll
eine Verbindung zum Directory Server herstellen kann.</p>

<a name="fwbak"></a><h5>Benutzer-DN zur Authentifizierung zur&#252;ckgeben</h5>
<p>Wenn das OpenSSO-Verzeichnis mit dem f&#252;r LDAP konfigurierten Verzeichnis &#252;bereinstimmt, ist diese
Option m&#246;glicherweise aktiviert. Wenn diese Option aktiviert ist, l&#228;sst das LDAP-Authentifizierungsmodul die
R&#252;ckgabe des DN anstelle der Benutzer-ID zu, sodass kein Suchlauf erforderlich ist.
Normalerweise gibt ein Authentifizierungsmodul nur die Benutzer-ID zur&#252;ck, und der Authentifizierungsdienst sucht
im lokalen OpenSSO-LDAP nach dem Benutzer. Bei Verwendung eines externen LDAP-Verzeichnisses wird
diese Option normalerweise nicht aktiviert.</p>

<a name="fwbaf"></a><h5>Intervall der LDAP-Server&#252;berpr&#252;fung</h5>
<p>Dieses Attribut wird f&#252;r das LDAP Server-Failback verwendet. Es legt die Anzahl
der Minuten fest, in denen ein Thread ?inaktiv&#8220; ist, bevor er &#252;berpr&#252;ft,
ob der prim&#228;re LDAP-Server ausgef&#252;hrt wird.</p>

<a name="fwbah"></a><h5>Attributliste f&#252;r Benutzererstellung</h5>
<p>Dieses Attribut wird vom LDAP-Authentifizierungsmodul verwendet, wenn der LDAP-Server als externer LDAP-Server
konfiguriert ist. Es enth&#228;lt Attributzuordnungen zwischen einem lokalen und einem externen Directory
Server. Das Attribut hat folgendes Format:</p><p><i>attr1|externesattr1</i></p><p><i>attr2|externalattr2</i></p><p>Wenn dieses Attribut angegeben wird, werden die Werte der externen Attribute vom
externen Directory Server gelesen und f&#252;r die Konfiguration der internen Directory Server-Attribute
verwendet. Die Werte der externen Attribute werden nur dann internen Attributen zugeordnet,
wenn das Attribut <tt>Benutzerprofil</tt> (im Modul ";Kern-Authentifizierung") auf "Dynamisch erstellt" gesetzt wurde
und der Benutzer in der lokalen Directory Server-Instanz nicht vorhanden ist. Der
neu erstellte Benutzer enth&#228;lt die Wert der internen Attribute, gem&#228;&#223; der Benutzererstellungsattributsliste,
und die jeweils zugeordneten externen Attributwerte.</p>

<a name="fwbaj"></a><h5>Authentifizierungsebene</h5>
<p>Die Authentifizierungsebene wird f&#252;r jede Authentifizierungsmethode einzeln festgelegt. Mit diesem Wert wird
angegeben, wie stark einem Authentifizierungsmechanismus vertraut wird. Sobald ein Benutzer authentifiziert wurde,
wird der Wert im SSO-Token der aktuellen Sitzung gespeichert. Wird der SSO-Token
einer Anwendung, auf die der Benutzer zugreifen m&#246;chte, vorgelegt, bestimmt die Anwendung
anhand des gespeicherten Werts, ob die Ebene ausreicht, um den Benutzer Zugriff
zu gew&#228;hren. Wenn die im SSO-Token gespeicherte Authentifizierungsebene nicht den erforderlichen Mindestwert
aufweist, wird der Benutzer aufgefordert, sich erneut &#252;ber einen Dienst mit einer
h&#246;heren Authentifizierungsebene zu authentifizieren. Der Standardwert ist 0.</p>
<hr><p><b>Hinweis &#8211; </b>Hinweis: Wenn keine Authentifizierungsebene angegeben wird, wird im SSO-Token der im Kern-Authentifizierungsattribut
<a href="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Standard-Authentifizierungsebene</a> angegebene Wert verwendet.</p>
<hr>

<br/>

</body>
</html>
