#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: workflowMessages_es.properties,v 1.6 2009/12/26 03:50:36 cbasha Exp $
#
#
# Portions Copyrighted 2015 ForgeRock AS.
# Portions Copyrighted 2015 Nomura Research Institute, Ltd.

ajax.user.privilege.invalid=El usuario carece de privilegios para realizar esta tarea.
file.upload.size.limit.exceeded=Se ha superado el l\u00edmite de tama\u00f1o. Verifique su archivo de metadatos e int\u00e9ntelo de nuevo.
button.backtoLogin=Volver a inicio de sesi\u00f3n
meta-data-required=Es necesario especificar el archivo de metadatos.
both-meta-extended-data-required=Se debe especificar tanto los archivos de datos ampliados como de metadatos.
missing-realm=Es necesario un dominio.
missing-cot=Se debe especificar el c\u00edrculo de confianza.
missing-metaalias=Se debe especificar el metalias.
missing-entity-id=Se debe especificar el Id. de entidad.
metaalias-no-prefix-with-realm=Metalias; {0} necesita incluir como prefijo el dominio.
invalid-metaalias-slash=El metalias no es v\u00e1lido.
unable-get-cot=No se ha podido obtener el c\u00edrculo de confianza.
import-entity-exception-invalid-descriptor=Metadatos no v\u00e1lidos.
meta-data-required=Es necesario especificar los metadatos.
import-entity-exception-invalid-descriptor=Metadatos no v\u00e1lidos.
meta-data-required=Es necesario especificar los metadatos.
entityId-required=Es necesario especificar el identificador de entidad.
assertion.consumer-required=Es necesario especificar la URL del consumidor de la aserci\u00f3n.
assertion.consumer-invalid=La URL del consumidor de la aserci\u00f3n no es v\u00e1lida.
file-not-found=No se ha encontrado el archivo, {0}.
domain.is.empty =El nombre de dominio est\u00e1 vac\u00edo.
google.apps.configured.success=Correcto
attributemapping.is.empty=\u00a1La tabla de asignaci\u00f3n de atributos est\u00e1 vac\u00eda!
salesforce.apps.configured.success=Correcto


idp.configured=El proveedor de identidades est\u00e1 configurado.<br />Puede modificar el perfil del proveedor en la ficha Federaci\u00f3n.
sp.configured=El proveedor de servicios est\u00e1 configurado.<br />Puede modificar el perfil del proveedor en la ficha Federaci\u00f3n.
invalid-extended-data-cot=No se ha podido obtener un conjunto v\u00e1lido de c\u00edrculo de confianza porque los metadatos ampliados no son v\u00e1lidos. 
unable.to.reach.url=No se ha podido alcanzar, {0}.
malformedurl={0} no es una URL con formato correcto.

cannot.locate.idp=No se puede encontrar el proveedor de identidades, {0}.
cannot.locate.idp.loginURL=No se puede encontrar la URL de inicio de sesi\u00f3n para el proveedor de identidades, {0}.
cannot.locate.sp=No se puede encontrar el proveedor de servicios, {0}.
cannot.locate.sp.loginURL=No se puede encontrar la URL de inicio de sesi\u00f3n para el proveedor de servicios, {0}.

federation.connectivity.test=Prueba de la conectividad de federaci\u00f3n
button.cancel=Cancelar
validate.initializing=Espere a que inicialicemos esta prueba.
validate.title.setup.failed=No se puede probar la conectividad de federaci\u00f3n.
validate.title.auth.idp=Introduzca la informaci\u00f3n de autenticaci\u00f3n para el proveedor de identidades, {0}.
validate.help.auth.idp.passed=Se ha autenticado en el proveedor de identidades.
validate.help.auth.idp.failed=No se puede realizar la autenticaci\u00f3n en el proveedor de identidades.
validate.auth.idp.again=Intente realizar de nuevo la autenticaci\u00f3n.
validate.title.auth.sp=Introduzca la informaci\u00f3n de autenticaci\u00f3n para el proveedor de servicios. {0}
validate.help.auth.sp.passed=Se ha autenticado en el proveedor de servicios.
validate.help.auth.sp.failed=No se puede realizar la autenticaci\u00f3n en el proveedor de servicios.
validate.auth.sp.again=Intente realizar de nuevo la autenticaci\u00f3n.

validate.title.account.linking=El sistema est\u00e1 probando la capacidad para vincular cuentas.
validate.wait.account.linking=Probando la capacidad para vincular cuentas
validate.help.account.linking.passed=Se ha vinculado la cuenta.
validate.help.account.linking.failed=No se puede vincular la cuenta.

validate.title.single.logout=El sistema est\u00e1 probando el cierre de sesi\u00f3n \u00fanico.
validate.wait.single.logout=Probando el cierre de sesi\u00f3n \u00fanico
validate.help.single.logout.passed=El cierre de sesi\u00f3n \u00fanico se ha realizado satisfactoriamente.
validate.help.single.logout.failed=Error en el cierre de sesi\u00f3n \u00fanico

validate.title.single.login_hosted=Probando inicio de sesi\u00f3n \u00fanico Introduzca la informaci\u00f3n de autenticaci\u00f3n para el proveedor de identidades.
validate.title.single.login_remote=Probando inicio de sesi\u00f3n \u00fanico Introduzca la informaci\u00f3n de autenticaci\u00f3n para el proveedor de identidades.
validate.wait.single.login=Probando el inicio de sesi\u00f3n \u00fanico
validate.help.single.login.passed=El inicio de sesi\u00f3n \u00fanico funciona correctamente.
validate.help.single.login.failed=El inicio de sesi\u00f3n \u00fanico no funciona.
validate.help.single.login.again=Intente iniciar una sesi\u00f3n de nuevo.

validate.title.account.termination=Probando la finalizaci\u00f3n de la cuenta
validate.help.account.termination.passed=La finalizaci\u00f3n de la cuenta funciona correctamente.
validate.help.account.termination.failed=La finalizaci\u00f3n de la cuenta no funciona.
validate.wait.account.termination=Probando la finalizaci\u00f3n de la cuenta

validate.report.title=Resultados de la prueba de conectividad
validate.report.task.label.idp=Proveedor de identidades
validate.report.task.label.sp=Proveedor de servicios
validate.report.task.label.fedlet=Fedlet
validate.report.tbl.hdr.test=Prueba
validate.report.tbl.hdr.result=Resultado
validate.report.task.auth.idp=Autenticaci\u00f3n en el proveedor de identidades
validate.report.task.auth.sp=Autenticaci\u00f3n en el proveedor de servicios
validate.report.task.account.linking=Vinculaci\u00f3n de cuentas
validate.report.task.single.logout=Cierre de sesi\u00f3n \u00fanico
validate.report.task.single.login=Inicio de sesi\u00f3n \u00fanico
validate.report.task.account.termination=Desvinculaci\u00f3n de cuentas

validator.report.auth.idp.not.tested=No se ha probado.
validator.report.auth.idp.passed=Se puede realizar la autenticaci\u00f3n en IDP (proveedor de identidades).
validator.report.auth.idp.failed=No se puede realizar la autenticaci\u00f3n en el proveedor de identidades. Los motivos m\u00e1s habituales que provocan este error son los siguientes:<ol><li>Es posible que haya introducido una contrase\u00f1a o un nombre de usuario no v\u00e1lido. Si no se ha cambiado la configuraci\u00f3n predeterminada, debe poder usar "demo" como nombre de usuario y "changeit" como contrase\u00f1a.</li><li>Es posible que se haya producido un error de configuraci\u00f3n. Si es el administrador, puede consultar el archivo de depuraci\u00f3n "amAuth" y el archivo de registro "amAuthentication.error" para obtener m\u00e1s informaci\u00f3n.</li></ol>

validator.report.auth.sp.not.tested=No se ha probado.
validator.report.auth.sp.passed=Se puede realizar la autenticaci\u00f3n en SP.
validator.report.auth.sp.failed=No se puede realizar la autenticaci\u00f3n en el proveedor de servicios. Los motivos m\u00e1s habituales que provocan este error son los siguientes:<ol><li>Es posible que haya introducido una contrase\u00f1a o un nombre de usuario no v\u00e1lido. Si no se ha cambiado la configuraci\u00f3n predeterminada, debe poder usar "demo" como nombre de usuario y "changeit" como contrase\u00f1a.</li><li>Es posible que se haya producido un error de configuraci\u00f3n. Si es el administrador, puede consultar el archivo de depuraci\u00f3n "amAuth" y el archivo de registro "amAuthentication.error" para obtener m\u00e1s informaci\u00f3n.</li></ol>

validator.report.account.linking.not.tested=No se ha probado.
validator.report.account.linking.passed=Vinculaci\u00f3n de cuentas satisfactoria.
validator.report.account.linking.failed=No se pueden vincular las cuentas.  Los motivos m\u00e1s habituales que provocan este error son los siguientes:<ol><li>Es posible que no se haya cargado el esquema de atributos de SAMLv2. Para solucionar este error, deber\u00e1 cargar el archivo de esquema de atributos de SAMLv2 y utilizar el comando "ldapmodify" para cargar el archivo que se encuentra dentro de opensso.war como "WEB-INF/template/openfm/fam_sds_schema.ldif"</li><li>Es posible que no disponga de permisos para realizar esta tarea.  Debe ponerse en contacto con el administrador para cambiar su nivel de permisos.</li><li>El posible que el almac\u00e9n de datos de usuarios no se haya configurado correctamente. Para solucionar este error, vaya a la consola, Control de acceso -> Dominios -> Almacenes de datos para asegurarse de que el almac\u00e9n de datos se haya configurado correctamente. Para obtener informaci\u00f3n adicional sobre la configuraci\u00f3n del almac\u00e9n de datos, consulte la gu\u00eda de administraci\u00f3n.</li><li>Si es el administrador, puede consultar el archivo de depuraci\u00f3n "libSAML2" y el archivo de registro "SAML2.error" para obtener m\u00e1s informaci\u00f3n.</li></ol>

validator.report.single.logout.not.tested=No se ha probado. 
validator.report.single.logout.passed=Cierre de sesi\u00f3n \u00fanico satisfactorio
validator.report.single.logout.failed=Error del cierre de sesi\u00f3n \u00fanico<ol><li>Se ha agotado el tiempo de espera de la sesi\u00f3n en el otro extremo; deber\u00eda acceder al punto final remoto para comprobar si hay una sesi\u00f3n v\u00e1lida.</li><li>Hay un problema de conectividad. Verifique que el punto final (la URL para acceder a la solicitud) se encuentre activo y en ejecuci\u00f3n. Se ha especificado la URL de cierre de sesi\u00f3n \u00fanico en los metadatos.</li></ol><span style="background-color:#333333">Si es el administrador, puede consultar el archivo de depuraci\u00f3n "libSAML2" y el archivo de registro "SAML2.error" para obtener m\u00e1s informaci\u00f3n.</span>

validator.report.single.login.not.tested=No se ha probado.
validator.report.single.login.passed=Cierre de sesi\u00f3n \u00fanico satisfactorio
validator.report.single.login.failed=Error en el inicio de sesi\u00f3n \u00fanico Los motivos m\u00e1s habituales que provocan este error son los siguientes:<ol><li>No se ha configurado ninguna clave de firma en el proveedor de identidades. Debe volver a configurar los metadatos del proveedor de identidades para que incluyan la clave de firma. NOTE: esto s\u00f3lo hace referencia a los perfiles POST. Si no se trata de un perfil POST, no hay ning\u00fan motivo para que se produzca este error.</li><li>El proveedor de servicios no puede establecer una conexi\u00f3n con el proveedor de identidades mediante un canal SOAP. Si se trata de un perfil de artefacto, deber\u00e1 asegurarse de que el host del proveedor de servicios pueda establecer una conexi\u00f3n con el host del proveedor de identidades. Se trata de una situaci\u00f3n habitual en una configuraci\u00f3n de equilibrador de carga en la que hay varios proveedores de servicios configurados detr\u00e1s de un equilibrador de carga.</li></ol><span style="background-color:#333333">Si es el administrador, puede consultar el archivo de depuraci\u00f3n "libSAML2" y el archivo de registro "SAML2.error" para obtener m\u00e1s informaci\u00f3n.</span>

validator.report.account.termination.not.tested=No se ha probado.
validator.report.account.termination.passed=Desvinculaci\u00f3n de cuentas satisfactoria
validator.report.account.termination.failed=Error en la desvinculaci\u00f3n de cuentas. Los motivos m\u00e1s habituales que provocan este error son los siguientes:<ol><li>Hay un problema de conectividad. Verifique que el punto final (la URL para acceder a la solicitud) est\u00e9 activo y que la URL de inicio de sesi\u00f3n \u00fanico se haya especificado en los metadatos.</li><li>La cuenta de usuario no se ha vinculado en el proveedor remoto; compruebe que se haya realizado la vinculaci\u00f3n de cuentas en el proveedor remoto. Acceda al almac\u00e9n de datos para comprobar si los atributos "sun-fm-saml2-nameid-infokey" y "sun-fm-saml2-nameid-info" est\u00e1n presentes en sus entradas.</li></ol><span style="background-color:#333333">Si es el administrador, puede consultar el archivo de depuraci\u00f3n "libSAML2" y el archivo de registro "SAML2.error" para obtener m\u00e1s informaci\u00f3n.</span>

validate.footer.auth.idp=Sugerencia: el nombre de usuario puede ser "demo" y la contrase\u00f1a "changeit", a menos que se modifique la configuraci\u00f3n predeterminada despu\u00e9s de configurar el producto.
validate.footer.auth.sp=Sugerencia: el nombre de usuario puede ser "demo" y la contrase\u00f1a "changeit", a menos que se modifique la configuraci\u00f3n predeterminada despu\u00e9s de configurar el producto.
validate.footer.account.linking=Espere; se est\u00e1n intentando vincular las cuentas de usuario.
validate.footer.single.logout=Espere; se est\u00e1 intentando realizar el cierre de sesi\u00f3n \u00fanico.
validate.footer.single.login=Inicie una sesi\u00f3n dentro de 30 segundos. Sugerencia: el nombre de usuario puede ser "demo" y la contrase\u00f1a "changeit", a menos que se modifique la configuraci\u00f3n predeterminada despu\u00e9s de configurar el producto.
validate.footer.account.termination=Espere; se est\u00e1n intentando desvincular las cuentas.

validator.title.auth.failed=Fallo de autenticaci\u00f3n.
validator.message.auth.failed=Los motivos m\u00e1s habituales que provocan este error son los siguientes:<ol><li>Es posible que haya introducido una contrase\u00f1a o un nombre de usuario no v\u00e1lido. Si no se ha cambiado la configuraci\u00f3n predeterminada, debe poder usar "demo" como nombre de usuario y "changeit" como contrase\u00f1a.</li><li>Es posible que se haya producido un error de configuraci\u00f3n. Si es el administrador, puede consultar el archivo de depuraci\u00f3n "amAuth" y el archivo de registro "amAuthentication.error" para obtener m\u00e1s informaci\u00f3n.</li></ol>
validator.link.auth.failed=Volver a la autenticaci\u00f3n

Fedlet.created=El archivo se ha guardado en la carpeta opensso: {0}.<p>Puede enviar este archivo al proveedor de servicios (o utilizarlo localmente a efectos de demostraci\u00f3n). El archivo .zip permitir\u00e1 que se realice la federaci\u00f3n de SP tan pronto como puedan implementar Fedlet en su aplicaci\u00f3n.</p>

directory.already.exist=El directorio {0} ya existe.

reg-no-service=No hay ning\u00fan servicio de registro disponible.
reg-create-soa-err=Error al crear la cuenta de Sun en l\u00ednea: {0}
reg-process-exc=Excepci\u00f3n en el proceso de registro: {0}
reg-no-service-waccount=No hay ning\u00fan servicio de registro (con una cuenta existente).
reg-execute-registration-exc=Error al ejecutar el registro: {0}
reg-execute-no-domains=No se ha encontrado ning\u00fan dominio en el que efectuar el registro.
reg-to-domain-error=Error al realizar el registro en el dominio {0}
reg-domain-not-found=No se ha encontrado el dominio {0}.
reg-no-domains=No se ha encontrado ning\u00fan dominio.
reg-to-def-domain-error=Error al realizar el registro en el dominio predeterminado; mensaje: {0}
reg-usrname-pswd-rqd=Es necesario especificar el nombre de usuario y la contrase\u00f1a.
reg-emailadr-no-username=Es necesario especificar una direcci\u00f3n de correo electr\u00f3nico si no se ha especificado ning\u00fan nombre de usuario.
reg-pswd-req=Es necesario especificar una contrase\u00f1a.
reg-cfm-pswd-req=Es necesario confirmar la contrase\u00f1a.
reg-pswd-no-match=Las contrase\u00f1as no coinciden
reg-get-reg-svc-error=Error al obtener el servicio de registro: {0}
reg-get-reg-svc-proxy-error=Error al obtener el servicio de registro mediante el proxy {0}: {1}
