#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2009 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: CoreToken_fr.properties,v 1.1 2009/12/26 03:53:25 cbasha Exp $
#
#

onlinehelp.doc=coretoken.html
sunCoreTokenConfigServiceDescription=Service de jetons de base
a101=Liste des attributs de recherche
a101.help=D\u00e9finit la liste des noms d\u2019attributs qui sont utilis\u00e9s dans l\u2019op\u00e9ration de recherche de jetons. Les attributs seront index\u00e9s pour am\u00e9liorer les performances de recherche. L\u2019op\u00e9ration de recherche de jetons sera refus\u00e9e si un ou plusieurs attributs de recherche ne figurent pas dans la liste. 
a102=Intervalle de nettoyage des jetons pour l\u2019expiration des jetons (en secondes)
a102.help=Une valeur de 0 indique qu\u2019aucun nettoyage n\u2019est n\u00e9cessaire pour l\u2019expiration des jetons.
a103=Types de jetons sans mise en \u0153uvre des ETag

# Exception error code
10=Format de date non valide {0}.
11=Jeton ayant d\u00e9j\u00e0 expir\u00e9 \u00e0 {0}.
20=Type de jeton non valide {0}.
#30=Invalid JSON encode attribute values.

201=L\u2019entit\u00e9 contenait un attribut d\u2019ID de jeton, qui ne doit pas \u00eatre fourni dans une demande POST de cr\u00e9ation de jeton.
202=Impossible de cr\u00e9er un jeton dans le magasin de jetons.
203=Impossible de trouver un jeton ayant l\u2019ID de jeton sp\u00e9cifi\u00e9.
204=Impossible de lire le jeton.
205=Impossible de supprimer le jeton.
206=Impossible de mettre \u00e0 jour le jeton.
#207=Unable to parse JSON encoded attribute value from token {0}.
208=La balise d\u2019entit\u00e9 {0} ne correspond pas \u00e0 celle figurant dans ce jeton.
209=Impossible de lire le jeton car le jeton de connexion unique de l\u2019administrateur est absent.
210=Impossible de mettre \u00e0 jour le jeton car le jeton de connexion unique de l\u2019administrateur est absent.
211=Impossible de supprimer le jeton car le jeton de connexion unique de l\u2019administrateur est absent.
212=Impossible de cr\u00e9er le jeton car le jeton de connexion unique de l\u2019administrateur est absent.
215=Impossible de rechercher des jetons. 
216=Impossible de rechercher le jeton car le jeton de connexion unique de l\u2019administrateur est absent.
217=La demande ne contenait pas l\u2019attribut {0} obligatoire pour l\u2019op\u00e9ration.
218=Aucun param\u00e8tre d\u2019interrogation n\u2019a \u00e9t\u00e9 sp\u00e9cifi\u00e9 dans la demande de recherche.
219=Un param\u00e8tre d\u2019interrogation non valide {0} a \u00e9t\u00e9 sp\u00e9cifi\u00e9 dans la demande de recherche.

220=La demande HTTP ne contenait pas l\u2019en-t\u00eate If-Match qui est obligatoire pour l\u2019op\u00e9ration.
221=L\u2019attribut d\u2019ID de jeton ne peut pas \u00eatre modifi\u00e9.
222=La demande ne contenait pas l\u2019attribut {0}, qui est obligatoire pour l\u2019op\u00e9ration.
223=L\u2019attribut {0} sp\u00e9cifi\u00e9 dans la demande n\u2019est pas un attribut de recherche.
224=L\u2019attribut de type de jeton ne peut pas \u00eatre modifi\u00e9.
225=Nom d\u2019attribut de jeton non valide {0}, le nom d\u2019attribut comportant le pr\u00e9fixe "token." est strictement r\u00e9serv\u00e9 au service de jetons.
226=L\u2019attribut {0} inclus dans la demande doit \u00eatre un attribut \u00e0 une seule valeur.
227=Nom d\u2019attribut de jeton non valide {0}, le nom d\u2019attribut doit avoir pour pr\u00e9fixe le type de jeton.

301=La session est non valide ou a expir\u00e9. Cela se produit en g\u00e9n\u00e9ral lorsqu\u2019une session reste inactive trop longtemps ou qu\u2019une tierce partie en annule la validit\u00e9.
302=\u00c9chec de l\u2019instanciation du magasin de jetons de base.
