#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: agentService_es.properties,v 1.15 2009/12/26 03:55:07 cbasha Exp $
#
# Portions Copyrighted 2015 ForgeRock AS.
# Portions Copyrighted 2015 Nomura Research Institute, Ltd.

label.Empty=---VACIO----
a10=USER_ID
a11=PROFILE_ATTRIBUTE
a12=HTTP_HEADER
a13=SESSION_PROPERTY
a14=LOG_NONE
a15=LOG_ALLOW
a16=LOG_DENY
a17=LOG_BOTH
a18=REMOTA
a19=TODAS
a20=NINGUNO
a21=HTTP_HEADER
a22=REQUEST_ATTRIBUTE
a23=COOKIE_HTTP
a24=LOCAL
a25=3DES
a26=AES
a27=sub\u00e1rbol
a28=self
a29=1.3
a30=1.0
a100=Contrase\u00f1a
a100.confirm=Contrase\u00f1a (confirmar)
a101=Estado
a101.help=Estado de la configuraci\u00f3n del agente.
a102=Activo
a103=Inactivo
a105=verdadero  
a106=falso
a109=URL de notificaci\u00f3n de agente
a109.help=URL utilizada por el agente para registrar escuchas de notificaci\u00f3n. (nombre de com.sun.identity.client.notification.url) <br>Intercambio directo: No
a110=Ubicaci\u00f3n del dep\u00f3sito de configuraci\u00f3n de agente
a110.help=Indica la configuraci\u00f3n del agente ubicada en el host del agente o centralizada en el servidor OpenAM.
a111=centralizado
a112=local

# J2EE Agent properties
a113=Modo de filtro de agente
a113.help=Especifica el modo de operaci\u00f3n del filtro. (nombre de propiedad: com.sun.identity.agents.config.filter.mode) <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valores v\u00e1lidos: ALL, J2EE_POLICY, URL_POLICY, SSO_ONLY, NONE <br>Para esta propiedad, se puede definir un valor global en todas las aplicaciones que no tengan su propio modo de filtro espec\u00edfico. <br>Intercambio directo: No <br>Ejemplos: <br>Para establecer ALL (Todo) como el modo de filtro global: deje el campo Asignar clave vac\u00edo e introduzca ALL (Todo) en el campo Valor de asignaci\u00f3n correspondiente. <br>Para establecer URL_POLICY como modo de filtro para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave, e introduzca URL_POLICY en el campo Valor de asignaci\u00f3n correspondiente.
a114=Modo de asignaci\u00f3n de usuario
a114.help=Especifica el mecanismo que el agente utiliza para determinar el Id. de usuario. (nombre de la propiedad: com.sun.identity.agents.config.user.mapping.mode) <br>Intercambio directo: S\u00ed
a115=Nombre de atributo de usuario
a115.help=Nombre del atributo que contiene el Id. de usuario. (nombre de la propiedad: com.sun.identity.agents.config.user.attribute.name) <br>Intercambio directo: S\u00ed
a116=Indicador principal de usuario
a116.help=Utilice el principal en lugar de s\u00f3lo el Id. de usuario para autenticar el usuario. (nombre de la propiedad: com.sun.identity.agents.config.user.principal) <br>Intercambio directo: S\u00ed
a117=Nombre de token de usuario
a117.help=Nombre de la propiedad de sesi\u00f3n para el Id. del usuario autenticado en la sesi\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.user.token) <br>Intercambio directo: S\u00ed
a118=Encabezado de la direcci\u00f3n IP del cliente
a118.help=Nombre del encabezado HTTP que contiene la direcci\u00f3n IP del cliente. (nombre de la propiedad: com.sun.identity.agents.config.client.ip.header) <br>Intercambio directo: S\u00ed
a119=Encabezado de nombre de host del cliente
a119.help=Nombre del encabezado HTTP que contiene el nombre de host del cliente. (nombre de la propiedad: com.sun.identity.agents.config.client.hostname.header) <br>Intercambio directo: S\u00ed
a121=Intervalo de recarga de configuraci\u00f3n
a121.help=Intervalo en segundos entre las recargas de configuraci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.load.interval) <br>Intercambio directo: S\u00ed
a122=Configuraci\u00f3n regional 
a122.help=(nombre de la propiedad: com.sun.identity.agents.config.locale.language) <br>Intercambio directo: No
a123=Pa\u00eds
a123.help=(nombre de la propiedad: com.sun.identity.agents.config.locale.country) <br>Intercambio directo: No
a124=Tipos de acceso de auditor\u00eda
a124.help=Tipos de mensajes para registrar en funci\u00f3n de los intentos de acceso de URL del usuario. (nombre de la propiedad: com.sun.identity.agents.config.audit.accesstype) <br>Intercambio directo: S\u00ed
a125=Ubicaci\u00f3n del registro de auditor\u00eda
a125.help=Especifica el lugar donde deben registrarse los mensajes de auditor\u00eda. (nombre de la propiedad: com.sun.identity.agents.config.log.disposition) <br>Intercambio directo: S\u00ed
a126=Nombre de archivo de registro remoto
a126.help=Nombre del archivo almacenado en el servidor OpenAM que contiene los mensajes de auditor\u00eda del agente. (nombre de la propiedad: com.sun.identity.agents.config.remote.logfile) <br>Intercambio directo: S\u00ed
a128=Rotar registro de auditor\u00eda local
a128.help=Marque para indicar que los archivos de registro de auditor\u00eda se deben rotar cuando alcancen un determinado tama\u00f1o. (nombre de la propiedad: com.sun.identity.agents.config.local.log.rotate) <br>Intercambio directo: S\u00ed
a129=Tama\u00f1o de rotaci\u00f3n de registro de auditor\u00eda local
a129.help=L\u00edmite de tama\u00f1o cuando se rota un archivo de registro de auditor\u00eda local en un nuevo archivo. (nombre de la propiedad: com.sun.identity.agents.config.local.log.size) <br>Intercambio directo: S\u00ed
a131=Habilitar servicio web
a131.help=Indicador que especifica si se ha habilitado el procesamiento del servicio web. (nombre de la propiedad: com.sun.identity.agents.config.webservice.enable) <br>Intercambio directo: Yes (S\u00ed)
a132=Puntos finales del servicio web
a132.help=Una lista de los puntos finales de la aplicaci\u00f3n web que representa los servicios web. (nombre de la propiedad: com.sun.identity.agents.config.webservice.endpoint) <br>Intercambio directo: Yes (S\u00ed)
a133=Habilitar proceso GET del servicio web
a133.help=Indicador que especifica si se ha habilitado el procesamiento de las solicitudes HTTP GET de los puntos finales del servicio web. (nombre de la propiedad: com.sun.identity.agents.config.webservice.process.get.enable) <br>Intercambio directo: Yes (S\u00ed)
a134=Autenticador de servicio web
a134.help=Una clase de implementaci\u00f3n de la interfaz com.sun.identity.agents.filter.IWebServiceAuthenticator que puede utilizarse para autenticar las solicitudes de servicios web. (nombre de la propiedad: com.sun.identity.agents.config.webservice.authenticator) <br>Intercambio directo: Yes (S\u00ed)
a134a=Procesador de respuesta del servicio web
a134a.help=Una clase de implementaci\u00f3n de la interfaz com.sun.identity.agents.filter.IWebServiceResponseProcessor que se puede utilizar para procesar las respuestas del servicio web. (nombre de la propiedad: com.sun.identity.agents.config.webservice.responseprocessor) <br>Intercambio directo: S\u00ed 
a135=Archivo de contenido de error interno del servicio web
a135.help= El nombre del archivo que incluye el contenido utilizado por el agente para generar un error interno para los clientes. (nombre de la propiedad: com.sun.identity.agents.config.webservice.internalerror.content) <br>Intercambio directo: Yes (S\u00ed)
a136=Archivo de contenido de error de autorizaci\u00f3n del servicio web
a136.help=El nombre del archivo que incluye el contenido utilizado por el agente para generar un error de autorizaci\u00f3n para los clientes. (nombre de la propiedad: com.sun.identity.agents.config.webservice.autherror.content) <br>Intercambio directo: Yes (S\u00ed)
a137=URI de acceso denegado a recurso
a137.help=Una asignaci\u00f3n espec\u00edfica de la aplicaci\u00f3n que identifica un URI de la p\u00e1gina personalizada de acceso denegado. (nombre de propiedad: com.sun.identity.agents.config.access.denied.uri) <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valor v\u00e1lido: el URI de la p\u00e1gina personalizada de acceso denegado de la aplicaci\u00f3n. <br>Para esta propiedad, se puede definir un valor global en todas las aplicaciones que no tengan su propia p\u00e1gina de acceso denegado espec\u00edfica. <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br>Para establecer una p\u00e1gina global de acceso denegado: deje vac\u00edo el campo Asignar clave e introduzca el URI /sample/accessdenied.html de la p\u00e1gina de acceso denegado global en el campo Valor de asignaci\u00f3n correspondiente. <br> Para establecer el URI de la p\u00e1gina de acceso denegado para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave e introduzca la URI de la p\u00e1gina de acceso denegado de la aplicaci\u00f3n /BankApp/accessdenied.html  en el campo Valor de asignaci\u00f3n correspondiente
a138=URI de formulario de inicio de sesi\u00f3n
a138.help=Lista de URI absolutas correspondientes al elemento de p\u00e1gina de inicio de sesi\u00f3n del formulario web.xml de una aplicaci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.login.form) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> /BankApp/jsp/login.jsp
a139=URI de error de inicio de sesi\u00f3n
a139.help=Lista de URI absolutas correspondientes al elemento de p\u00e1gina de error del formulario web.xml de una aplicaci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.login.error.uri) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> /BankApp/jsp/error.jsp
a141=Utilizar inicio de sesi\u00f3n interno 
a141.help=Establezca esta opci\u00f3n en \u2019false\u2019 falso si desea personalizar el archivo de contenido de inicio de sesi\u00f3n en lugar del contenido interno predeterminado proporcionado. (nombre de la propiedad: com.sun.identity.agents.config.login.use.internal) <br>Intercambio directo: S\u00ed
a142=Nombre de archivo de contenido de inicio de sesi\u00f3n
a142.help=Nombre y ruta completa del archivo de contenido de inicio de sesi\u00f3n personalizado. (nombre de la propiedad: com.sun.identity.agents.config.login.content.file) <br>Intercambio directo: S\u00ed
a143=Controlador de autenticaci\u00f3n personalizado
a143.help=Controlador de autenticaci\u00f3n espec\u00edfico de aplicaciones para autenticar el usuario de inicio de sesi\u00f3n con el servidor de aplicaciones. (nombre de la propiedad: com.sun.identity.agents.config.auth.handler)  <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valor v\u00e1lido: el nombre de clase del controlador de autenticaci\u00f3n. <br>Intercambio directo: Yes (S\u00ed)  <br>Ejemplo: <br>Para establecer el controlador de autenticaci\u00f3n para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave e introduzca el nombre de la clase de controlador BankAuthHandler en el campo Valor de asignaci\u00f3n correspondiente.
a144=Controlador de cierre de sesi\u00f3n personalizado
a144.help=Controlador de cierre de sesi\u00f3n espec\u00edfico de las aplicaciones para cerrar una sesi\u00f3n de un usuario con el servidor de aplicaciones. (nombre de propiedad: com.sun.identity.agents.config.logout.handler)  <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valor v\u00e1lido: el nombre de clase del controlador de cierre de sesi\u00f3n. <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br>Para establecer el controlador de cierre de sesi\u00f3n para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave e introduzca el nombre de clase de controlador de cierre de sesi\u00f3n en el campo Valor de asignaci\u00f3n correspondiente.
a145=Controlador de verificaci\u00f3n personalizado
a145.help=Controlador de verificaci\u00f3n espec\u00edfico de las aplicaciones para validar las credenciales de usuario con el dep\u00f3sito local. (nombre de propiedad: com.sun.identity.agents.config.verification.handler) <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valor v\u00e1lido: el nombre de clase del controlador de verificaci\u00f3n. <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> Para establecer el controlador de verificaci\u00f3n para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave e introduzca el nombre de clase del controlador de verificaci\u00f3n BankVerificationHandler en el campo Valor de asignaci\u00f3n correspondiente.
a146=Enlace de sesi\u00f3n HTTP
a146.help=Si se establece en "true" (verdadero) no se validar\u00e1 la sesi\u00f3n http cuando se produzca un error de inicio de sesi\u00f3n, el usuario no tenga sesi\u00f3n SSO (Single Sign-On, Inicio de sesi\u00f3n \u00fanico), o el nombre de usuario principal no coincida con el nombre de usuario SSO. (nombre de la propiedad: com.sun.identity.agents.config.httpsession.binding) <br>Intercambio directo: S\u00ed
a147=Nombre del par\u00e1metro Goto
a147.help=Propiedad que se utiliza \u00fanicamente cuando la CDSSO est\u00e1 activada. Se debe cambiar el valor predeterminado s\u00f3lo cuando la direcci\u00f3n URL de inicio de sesi\u00f3n tiene una p\u00e1gina de destino espec\u00edfica <br> Ejemplo: com.sun.identity.agents.config.cdsso.cdcservlet.url = http://host:port/opensso/cdcservlet?goto=http://agent:port/landing.jsp <br> El agente utiliza el par\u00e1metro para a\u00f1adir la URL solicitada originalmente a esta URL cdcserlet. La p\u00e1gina de destino consume este par\u00e1metro para redirigir a la direcci\u00f3n URL original. (nombre de propiedad: com.sun.identity.agents.config.redirect.param) <br>Intercambio directo: S\u00ed <br> Ejemplo: com.sun.identity.agents.config.redirect.param = goto2<br> La direcci\u00f3n URL completa que se mande para la autenticaci\u00f3n ser\u00e1 <br> http://host:port/opensso/cdcservlet?goto=http://agent:port/landing.jsp?goto2=http://agent.port/original.jsp
a148=URL de inicio de sesi\u00f3n de OpenAM
a148.help=URL de p\u00e1gina de inicio de sesi\u00f3n de OpenAM. (nombre de la propiedad: com.sun.identity.agents.config.login.url) <br>Intercambio directo: Yes (S\u00ed)<br>Ejemplo: <br> http://host:puerto/opensso/UI/Login
a149=URL de inicio de sesi\u00f3n por orden de prioridad
a149.help=Especifica si la secuencia de conmutaci\u00f3n por error para las URL de inicio de sesi\u00f3n o URL de CDSSO (Cross Domain Single Sign On, Inicio de sesi\u00f3n \u00fanico entre dominios) debe priorizarse como se define en la lista de URL de inicio de sesi\u00f3n de OpenAM.  (nombre de la propiedad: com.sun.identity.agents.config.login.url.prioritized) <br>Intercambio directo: S\u00ed
a151=An\u00e1lisis de URL de inicio de sesi\u00f3n
a151.help=Especifica si el agente comprobar\u00e1 la disponibilidad de estas URL antes de redireccionarlas. (nombre de la propiedad: com.sun.identity.agents.config.login.url.probe.enabled) <br>Intercambio directo: S\u00ed
a152=Tiempo de espera del an\u00e1lisis de URL de inicio de sesi\u00f3n
a152.help=El valor de tiempo de espera de conexi\u00f3n en milisegundos, si el an\u00e1lisis de URL de inicio de sesi\u00f3n tambi\u00e9n se ha establecido en \u2019true\u2019 verdadero. (nombre de la propiedad: com.sun.identity.agents.config.login.url.probe.timeout) <br>Intercambio directo: S\u00ed
a153=Nombre de host alternativo del agente
a153.help=Nombre de host que identifica el servidor protegido por el agente en los navegadores cliente si es diferente del nombre de host real. (nombre de la propiedad: com.sun.identity.agents.config.agent.host) <br>Intercambio directo: S\u00ed
a154=Nombre alternativo de puerto del agente
a154.help=N\u00famero de puerto que identifica el puerto de escucha del servidor protegido por el agente en los navegadores cliente si es diferente del puerto de escucha real. (nombre de la propiedad: com.sun.identity.agents.config.agent.port) <br>Intercambio directo: S\u00ed
a155=Protocolo de agente alternativo
a155.help=Protocolo que utilizan (http/https) los navegadores cliente para comunicarse con el servidor protegido por el agente si es diferente del protocolo real utilizado por el servidor. (nombre de la propiedad: com.sun.identity.agents.config.agent.protocol) <br>Intercambio directo: S\u00ed
a156=L\u00edmite de intentos de inicio de sesi\u00f3n
a156.help=L\u00edmite de intentos err\u00f3neos de inicio de sesi\u00f3n para la sesi\u00f3n de navegador \u00fanica de un usuario hasta que se active el bloqueo de la solicitud de usuario. El valor 0 deshabilita esta funci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.login.attempt.limit) <br>Intercambio directo: S\u00ed
a158=Habilitar cach\u00e9 de SSO (Single Sign-On, Inicio de sesi\u00f3n \u00fanico)
a158.help=Especifica si la cach\u00e9 de SSO est\u00e1 activa para el agente. La cach\u00e9 se utiliza mediante API expuestas por el agente SDK. (nombre de la propiedad: com.sun.identity.agents.config.amsso.cache.enable) <br>Intercambio directo: S\u00ed
a159=Restablecimiento de cookies
a159.help=El agente restablece las cookies en la respuesta antes de redireccionar a la autenticaci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.cookie.reset.enable) <br>Intercambio directo: S\u00ed
a161=Lista de nombres de restablecimiento de cookies
a161.help=Los nombres de cookies que el agente restablecer\u00e1 si se habilita el restablecimiento de cookies. (nombre de la propiedad: com.sun.identity.agents.config.cookie.reset.name) <br>Intercambio directo: S\u00ed
a162=Asignaci\u00f3n de dominios de restablecimiento de cookies
a162.help=Asigna nombres de cookies especificadas en la lista de nombres de restablecimiento de cookies al valor que es el dominio de esta cookie y que se utilizar\u00e1 cuando se produzca un evento de restablecimiento. (nombre de la propiedad: com.sun.identity.agents.config.cookie.reset.domain) <br>Intercambio directo: S\u00ed
a163=Asignaci\u00f3n de rutas de restablecimiento de cookies
a163.help=Asigna nombres de cookies especificadas en la lista de nombres de restablecimiento de cookies al valor que es la ruta de esta cookie y que se utilizar\u00e1 cuando se produzca un evento de restablecimiento. (nombre de la propiedad: com.sun.identity.agents.config.cookie.reset.path) <br>Intercambio directo: S\u00ed
a164=SSO entre dominios
a164.help=Habilita el inicio de sesi\u00f3n \u00fanico (SSO) entre dominios. (nombre de la propiedad: com.sun.identity.agents.config.cdsso.enable) <br>Intercambio directo: S\u00ed
a165=URI de redireccionamiento de CDSSO
a165.help= Un URI intermedio que utiliza el agente para procesar solicitudes de CDSSO. (nombre de la propiedad: com.sun.identity.agents.config.cdsso.redirect.uri) <br>Intercambio directo: S\u00ed
a166=URL de Servlet de CDSSO
a166.help=Lista de URL de controladores de CDSSO disponibles que puede utilizar el agente para procesamiento de CDSSO. (nombre de la propiedad: com.sun.identity.agents.config.cdsso.cdcservlet.url) <br>Clave v\u00e1lida: Yes (S\u00ed) <br> Ejemplo <br>http://host:puerto/opensso/cdcservlet
a167=Desfase del reloj de CDSSO
a167.help=Tiempo en segundos que utilizar\u00e1 el agente para determinar la validez de la aserci\u00f3n AuthnResponse de CDSSO. (nombre de la propiedad: com.sun.identity.agents.config.cdsso.clock.skew) <br>Intercambio directo: S\u00ed
a168=Proveedor de Id. de confianza de CDSSO
a168.help=Lista de proveedores de servidores/Id. de OpenAM en los que debe confiar el agente cuando se eval\u00faan las respuestas de Liberty de CDC. (nombre de la propiedad: com.sun.identity.agents.config.cdss.trusted.id.provider) <br>Intercambio v\u00e1lido: Yes (S\u00ed) <br> Ejemplo: <br> http://host:puerto/opensso/cdcservlet
a169=Habilitaci\u00f3n segura de CDSSO
a169.help=La cookie de token de SSO establecida por el agente en los distintos dominios en modo de CDSSO se marcar\u00e1 como segura. S\u00f3lo se transmitir\u00e1 si el canal de comunicaciones con el host es seguro. (nombre de la propiedad: com.sun.identity.agents.config.cdsso.secure.enable) <br>Intercambio directo: S\u00ed
a170=Lista de dominios de CDSSO
a170.help=Los dominios para los que las cookies tienen que establecerse en un escenario de CDSSO. (nombre de la propiedad: com.sun.identity.agents.config.cdsso.domain) <br>Intercambio directo: Yes (S\u00ed) <br>Ejemplo: <br> .sun.com
a171=Controlador de cierre de sesi\u00f3n de la aplicaci\u00f3n
a171.help=Una asignaci\u00f3n espec\u00edfica de una aplicaci\u00f3n que identifica un controlador que se utilizar\u00e1 para el procesamiento del cierre de sesi\u00f3n. (nombre de propiedad: com.sun.identity.agents.config.logout.application.handler) <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valor v\u00e1lido: el nombre de clase del controlador de cierre de sesi\u00f3n de la aplicaci\u00f3n. <br>Para esta propiedad se puede establecer un valor global para todas las aplicaciones que no tengan su controlador espec\u00edfico de cierre de sesi\u00f3n. <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos:  <br>Para establecer un controlador global de cierre de sesi\u00f3n de la aplicaci\u00f3n: deje el campo Asignar clave vac\u00edo e introduzca el nombre de clase del controlador global de cierre de sesi\u00f3n de la aplicaci\u00f3n GlobalApplicationLogoutHandler en el campo Valor de asignaci\u00f3n correspondiente. <br> Para establecer el controlador de cierre de sesi\u00f3n para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave e introduzca el nombre de clase del controlador de cierre de sesi\u00f3n de la aplicaci\u00f3n BankAppLogoutHandler en el campo Valor de asignaci\u00f3n correspondiente.
a172=URI de cierre de sesi\u00f3n de la aplicaci\u00f3n
a172.help=Una asignaci\u00f3n espec\u00edfica de una aplicaci\u00f3n que identifica un URI de solicitud que indica un evento de cierre de sesi\u00f3n. (nombre de propiedad: com.sun.identity.agents.config.logout.uri) <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valor v\u00e1lido: URI de cierre de sesi\u00f3n de la aplicaci\u00f3n. <br>Para esta propiedad, se puede definir un valor global en todas las aplicaciones que no tengan su propio URI espec\u00edfico de cierre de sesi\u00f3n. <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> Para establecer el URI global de cierre de sesi\u00f3n para la aplicaci\u00f3n: deje vac\u00edo el campo Asignar clave e introduzca el URI global de cierre de sesi\u00f3n de la aplicaci\u00f3n /logout.jsp en el campo Valor de asignaci\u00f3n correspondiente. <br> Para establecer el URI de cierre de sesi\u00f3n para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave e introduzca el URI de cierre de sesi\u00f3n de la aplicaci\u00f3n /BankApp/logout.jsp en el campo Valor de asignaci\u00f3n correspondiente.
a173=Par\u00e1metro de solicitud de cierre de sesi\u00f3n
a173.help=Una asignaci\u00f3n espec\u00edfica de una aplicaci\u00f3n que identifica un par\u00e1metro que, cuando est\u00e1 presente en la solicitud HTTP, indica un evento de cierre de sesi\u00f3n. (nombre de propiedad: com.sun.identity.agents.config.logout.request.param)  <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valor v\u00e1lido: el par\u00e1metro de solicitud de cierre de sesi\u00f3n. <br>Para esta propiedad, se puede definir un valor global en todas las aplicaciones que no tengan su propio par\u00e1metro de solicitud de cierre de sesi\u00f3n espec\u00edfico. <br>Intercambio directo: Yes (S\u00ed)  <br> Ejemplos: <br> Para establecer el par\u00e1metro de solicitud de cierre de sesi\u00f3n para la aplicaci\u00f3n global: deje vac\u00edo el campo Asignar clave e introduzca el par\u00e1metro de solicitud de cierre de sesi\u00f3n logoutparam en el campo Valor de asignaci\u00f3n correspondiente. <br> Para establecer el par\u00e1metro de solicitud de cierre de sesi\u00f3n para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave e introduzca el par\u00e1metro de solicitud de cierre de sesi\u00f3n logoutparam en el campo Valor de asignaci\u00f3n correspondiente.
a174=Introspecci\u00f3n de cierre de sesi\u00f3n habilitada
a174.help=Permite al agente buscar el cuerpo de la solicitud HTTP para localizar el par\u00e1metro de cierre de sesi\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.logout.introspect.enabled) <br>Intercambio directo: S\u00ed
a175=URI de entrada de cierre de sesi\u00f3n
a175.help=Una asignaci\u00f3n espec\u00edfica de una aplicaci\u00f3n que identifica un URI que se utilizar\u00e1 como punto de entrada tras un cierre de sesi\u00f3n satisfactorio y la posterior autenticaci\u00f3n correcta si es aplicable. (nombre de propiedad: com.sun.identity.agents.config.logout.entry.uri) <br>Clave v\u00e1lida: el nombre de la aplicaci\u00f3n web. <br>Valor v\u00e1lido: URI de entrada de cierre de sesi\u00f3n. <br>Para esta propiedad se puede definir un valor global en todas las aplicaciones que no tengan su URI de entrada de cierre de sesi\u00f3n espec\u00edfico.  <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> Para establecer el URI de entrada de cierre de sesi\u00f3n global: deje vac\u00edo el campo Asignar clave, e introduzca el URI de entrada de cierre de sesi\u00f3n global /welcome.html en el campo Valor de asignaci\u00f3n correspondiente. <br> Para establecer el URI de entrada de cierre de sesi\u00f3n para la aplicaci\u00f3n BankApp: introduzca BankApp en el campo Asignar clave, e introduzca el URI de entrada de cierre de sesi\u00f3n /BankApp/welcome.html en el campo Valor de asignaci\u00f3n correspondiente.
a176=Comprobaci\u00f3n de FQDN (Fully Qualified Domain Name, Nombre de dominio completo)
a176.help=Habilita la comprobaci\u00f3n del valor predeterminado de fqdn y los valores de asignaci\u00f3n de fqdn. (nombre de la propiedad: com.sun.identity.agents.config.fqdn.check.enable) <br>Intercambio directo: S\u00ed
a177=FQDN predeterminado
a177.help=Nombre de host completo que deben utilizar los usuarios para acceder a los recursos. (nombre de la propiedad: com.sun.identity.agents.config.fqdn.default) <br>Intercambio directo: S\u00ed
a178=Asignaci\u00f3n de host virtual de FQDN
a178.help=Habilita los hosts virtuales, el nombre de host parcial y la direcci\u00f3n IP para acceder a los recursos protegidos. Asigna una clave no v\u00e1lida para validar un valor. (nombre de propiedad: com.sun.identity.agents.config.fqdn.mapping) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br>  Para asignar myserver a myserver.mydomain.com: introduzca myserver en el campo Asignar clave, e introduzca myserver.mydomain.com en el campo Valor de  asignaci\u00f3n correspondiente.
a179=Habilitar compatibilidad con agente de usuario tradicional
a179.help=Habilita la compatibilidad con agentes de usuarios tradicionales (navegador). (nombre de la propiedad: com.sun.identity.agents.config.legacy.support.enable) <br>Intercambio directo: S\u00ed
a181=Lista de agentes de usuario tradicionales
a181.help=Lista de valores de encabezado de agente de usuario que identifica navegadores tradicionales. Las entradas de esta lista pueden contener el car\u00e1cter comod\u00edn \u2019*\u2019. (nombre de la propiedad: com.sun.identity.agents.config.legacy.user.agent) <br>Intercambio directo: S\u00ed
a182=URI de redireccionamiento del agente de usuario tradicional
a182.help=Un URI intermedio utilizado por el agente para redireccionar solicitudes de agente de usuario tradicional. (nombre de la propiedad: com.sun.identity.agents.config.legacy.redirect.uri) <br>Intercambio directo: S\u00ed
a183=Encabezado de respuesta personalizado
a183.help=La asignaci\u00f3n especifica los encabezados personalizados que establece el agente en el navegador cliente. La clave es el nombre del encabezado y el valor representa el valor del encabezado. (nombre de propiedad: com.sun.identity.agents.config.response.header) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br>  Para establecer el encabezado personalizado Cache-Control en el valor no-cache: introduzca Cache-Control en el campo Asignar clave e introduzca no-cache en el campo Valor de asignaci\u00f3n correspondiente.
a184=L\u00edmite de intentos de redireccionamiento
a184.help=N\u00famero de redireccionamientos de punto \u00fanico sucesivos que un usuario puede realizar utilizando una sesi\u00f3n de navegador \u00fanica que activar\u00e1 el bloqueo de la solicitud de usuario. Establezca esta opci\u00f3n en 0 para inhabilitar esta funci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.redirect.attempt.limit) <br>Intercambio directo: S\u00ed
a185=Habilitaci\u00f3n de comprobaci\u00f3n de puerto
a185.help=Indica si la funcionalidad de comprobaci\u00f3n de puerto est\u00e1 habilitada o inhabilitada. (nombre de la propiedad: com.sun.identity.agents.config.port.check.enable) <br>Intercambio directo: S\u00ed
a186=Archivo de comprobaci\u00f3n de puerto
a186.help=Nombre o ruta completa de un archivo que tiene el contenido necesario para administrar solicitudes que requieren correcci\u00f3n de puerto. (nombre de la propiedad: com.sun.identity.agents.config.port.check.file) <br>Intercambio directo: S\u00ed
a187=Configuraci\u00f3n de la comprobaci\u00f3n de puerto
a187.help=Asignaci\u00f3n de puerto frente a entradas de protocolo siendo la clave el n\u00famero de puerto de escucha y el valor el protocolo de escucha que utilizar\u00e1 el agente para identificar solicitudes con n\u00fameros de puerto no v\u00e1lidos. (nombre de propiedad: com.sun.identity.agents.config.port.check.setting) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> Para asignar el puerto 80 al protocolo http: introduzca 80 en el campo Asignar clave e introduzca http en el campo Valor de asignaci\u00f3n correspondiente.
a188=URI no aplicados
a188.help=Lista de URI para los que el agente no aplica protecci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.uri) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> /BankApp/public/* <br> /BankApp/images/*
a189=Invertir URI no aplicados
a189.help=Invierte la protecci\u00f3n de los URI especificados en la lista de URI no aplicados. Si se establece en \u2019true\u2019 verdadero, indica que el agente debe aplicar los URI especificados pero no el resto de URI. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.uri.invert) <br>Intercambio directo: S\u00ed
a191=Habilitada cach\u00e9 de URI no aplicados
a191.help=Habilita el almacenamiento en la memoria cach\u00e9 de los resultados de la evaluaci\u00f3n de la lista de URI no aplicados. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.uri.cache.enable) <br>Intercambio directo: S\u00ed
a192=Tama\u00f1o de cach\u00e9 de URI no aplicados
a192.help=Tama\u00f1o de cach\u00e9 que se utilizar\u00e1 si est\u00e1 habilitado el almacenamiento en cach\u00e9 de los resultados de la evaluaci\u00f3n de lista de URI no aplicados. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.uri.cache.size) <br>Intercambio directo: S\u00ed
a193=Lista de IP de cliente no aplicadas
a193.help=No es necesaria ni la protecci\u00f3n de autorizaci\u00f3n ni la autenticaci\u00f3n del agente para las solicitudes procedentes de estas direcciones IP de cliente. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.ip) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> 192.18.145.* <br> 192.18.146.123
a194=Lista de inversi\u00f3n de IP no aplicadas
a194.help=Direcciones IP de cliente que invierten la protecci\u00f3n de direcciones IP enumeradas en la lista de IP de cliente no aplicadas. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.ip.invert) <br>Intercambio directo: S\u00ed
a195=Indicador de cach\u00e9 de IP no aplicadas
a195.help=Habilitar el almacenamiento en la memoria cach\u00e9 de los resultados de la evaluaci\u00f3n de lista de IP no aplicadas. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.ip.cache.enable) <br>Intercambio directo: S\u00ed
a196=Tama\u00f1o de cach\u00e9 de IP no aplicadas
a196.help=Se utilizar\u00e1 el tama\u00f1o de la cach\u00e9 si est\u00e1 habilitado el indicador de cach\u00e9 de IP no aplicadas. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.ip.cache.size) <br>Intercambio directo: S\u00ed
a197=Car\u00e1cter separador de cookie
a197.help=Car\u00e1cter que se utilizar\u00e1 para separar varios valores del mismo atributo cuando se configura como cookie. (nombre de la propiedad: com.sun.identity.agents.config.attribute.cookie.separator) <br>Intercambio directo: S\u00ed
a198=Buscar formato de fecha de atributo
a198.help=Formato de valores de atributo de fecha que se utilizar\u00e1 cuando el atributo se configure como encabezado HTTP. Este formato se basa en java.text.SimpleDateFormat. (nombre de la propiedad: com.sun.identity.agents.config.attribute.date.format) <br>Intercambio directo: S\u00ed
a199=Codificaci\u00f3n de cookie de atributo
a199.help=Indica si el valor del atributo debe codificarse mediante URL antes de configurarse como cookie. (nombre de la propiedad: com.sun.identity.agents.config.attribute.cookie.encode) <br>Intercambio directo: S\u00ed
a200=Actualizar tiempo de inactividad de sesi\u00f3n
a200.help=Indica si el tiempo de inactividad de sesi\u00f3n de OpenAM se debe actualizar o restablecer para las direcciones URI no aplicadas. (nombre de propiedad: com.sun.identity.agents.config.notenforced.refresh.session.idletime) <br>Intercambio directo: Yes (S\u00ed) 
a201=Modo de b\u00fasqueda de atributo de perfil
a201.help=El modo de b\u00fasqueda de atributos de perfil. (nombre de la propiedad: com.sun.identity.agents.config.profile.attribute.fetch.mode) <br>Intercambio directo: S\u00ed
a202=Asignaci\u00f3n de atributos de perfil
a202.help=Asigna los atributos de perfil que se insertar\u00e1n en nombres espec\u00edficos para el usuario autenticado actualmente. (nombre de propiedad: com.sun.identity.agents.config.profile.attribute.mapping) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> Para rellenar el valor del atributo de perfil cn con el nombre CUSTOM-Common-Name: introduzca cn en el campo Asignar clave e introduzca CUSTOM-Common-Name en el campo Valor de asignaci\u00f3n correspondiente. <br> Para rellenar el valor del correo de atributos de perfil con el nombre CUSTOM-Email: introduzca correo en el campo Asignar clave, e introduzca CUSTOM-Email en el campo Valor de asignaci\u00f3n correspondiente.
a203=Modo de b\u00fasqueda de atributos de sesi\u00f3n
a203.help=El modo de b\u00fasqueda de atributos de sesi\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.session.attribute.fetch.mode) <br>Intercambio directo: S\u00ed
a204=Asignaci\u00f3n de atributos de sesi\u00f3n
a204.help=Asigna los atributos de sesi\u00f3n que se insertar\u00e1n en nombres espec\u00edficos para el usuario autenticado actualmente. (nombre de propiedad: com.sun.identity.agents.config.session.attribute.mapping) <br>Intercambio directo: Yes (S\u00ed)  <br> Ejemplo: <br>  Para rellenar el valor de atributo de sesi\u00f3n UserToken con el nombre CUSTOM-userid: introduzca UserToken en el campo Asignar clave e introduzca CUSTOM-userid en el campo Valor de asignaci\u00f3n correspondiente.
a205=Modo de b\u00fasqueda de atributos de respuesta
a205.help=El modo de b\u00fasqueda de atributos de respuesta de directivas. (nombre de la propiedad: com.sun.identity.agents.config.response.attribute.fetch.mode) <br>Intercambio directo: S\u00ed
a206=Asignaci\u00f3n de atributos de respuesta
a206.help=Asigna los atributos de respuesta de directivas que se insertar\u00e1n en nombres espec\u00edficos para el usuario autenticado actualmente. (nombre de propiedad: com.sun.identity.agents.config.response.attribute.mapping) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> Para rellenar el valor del uid del atributo de respuesta con el nombre CUSTOM-USER-NAME: introduzca el uid en el campo Asignar clave e introduzca CUSTOM-USER-NAME en el campo Valor de asignaci\u00f3n correspondiente.
a207=Lista de principales de derivaci\u00f3n
a207.help=Lista de principales que deriva el agente para llevar a cabo la autenticaci\u00f3n y la b\u00fasqueda. (nombre de la propiedad: com.sun.identity.agents.config.bypass.principal) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> guest <br> testuser
a208=Atributo con privilegios predeterminado
a208.help=Lista de atributos con privilegios que se otorgar\u00e1 a todos los usuarios que dispongan de una sesi\u00f3n de OpenAM v\u00e1lida. (nombre de la propiedad: com.sun.identity.agents.config.default.privileged.attribute) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br>AUTHENTICATED_USERS
a209=Tipo de atributo con privilegios
a209.help=Lista de tipos de atributos con privilegios que se buscar\u00e1 para cada usuario. (nombre de la propiedad: com.sun.identity.agents.config.privileged.attribute.type) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> Group
a211=Atributos con privilegios en min\u00fasculas
a211.help=Determina si los tipos de atributos con privilegios se convertir\u00e1n en min\u00fasculas. (nombre de propiedad: com.sun.identity.agents.config.privileged.attribute.tolowercase) <br>Claves v\u00e1lidas: los tipos de atributo con privilegios, como Grupo, Rol. <br>Valor v\u00e1lido: true (verdadero), false (falso). <br>Intercambio directo: Yes (S\u00ed)  <br> Ejemplo: <br> Introduzca Grupo en el campo Asignar clave, e introduzca \u2019false\u2019 falso en el campo Valor de asignaci\u00f3n correspondiente.
a212=Atributo de sesi\u00f3n con privilegios
a212.help=Lista de nombres de propiedad de sesi\u00f3n que mantienen atributos con privilegios para el usuario autenticado. (nombre de la propiedad: com.sun.identity.agents.config.privileged.session.attribute) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> UserToken 
a213=Habilitar asignaci\u00f3n de atributos con privilegios
a213.help=Habilitar una asignaci\u00f3n a partir del valor original de un atributo a otro valor. Para satisfacer las restricciones espec\u00edficas del contenedor en el juego de caracteres que se utiliza en ciertos archivos de configuraci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.privileged.attribute.mapping.enable) <br>Intercambio directo: S\u00ed
a214=Asignaci\u00f3n de atributos con privilegios
a214.help=Asigne si se utiliza Habilitar asignaci\u00f3n de atributos con privilegios. (nombre de propiedad: com.sun.identity.agents.config.privileged.attribute.mapping) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> Para asignar UUID id=manager,ou=group,dc=openam,dc=openidentityplatform,dc=org al nombre principal am_manager_role especificado en el descriptor de implementaci\u00f3n de webapp: introduzca id=manager,ou=group,dc=openam,dc=openidentityplatform,dc=org en el campo Asignar clave, e introduzca am_manager_role en el campo Valor de asignaci\u00f3n correspondiente. <br> Para asignar UUID id=employee,ou=group,dc=openam,dc=openidentityplatform,dc=org al nombre principal am_employee_role especificado en el descriptor de implementaci\u00f3n de webapp: introduzca id=employee,ou=group,dc=openam,dc=openidentityplatform,dc=org en el campo Asignar clave e introduzca am_employee_role en el campo Valor de asignaci\u00f3n correspondiente.
a215=Nivel de depuraci\u00f3n del agente
a215.help=Especifica el tipo de mensajes de depuraci\u00f3n de agente que se registrar\u00e1n. (nombre de la propiedad: com.iplanet.services.debug.level) <br>Intercambio directo: S\u00ed
a216=Nombre de cookie
a216.help=Nombre de la cookie de token de SSO utilizado entre el servidor OpenAM y el agente. (nombre de la propiedad: com.iplanet.am.cookie.name) <br>Intercambio directo: No
a218=Habilitar sondeo de clientes
a218.help=Especifica si el cliente de sesi\u00f3n debe utilizar un sondeo para actualizar informaci\u00f3n de sesi\u00f3n y no depender de las notificaciones del servidor. (nombre de la propiedad: com.iplanet.am.session.client.polling.enable) <br>Intercambio directo: No
a219=Periodo de sondeo de clientes
a219.help=Tiempo en segundos tras los que el cliente de sesi\u00f3n solicitar\u00e1 actualizar la informaci\u00f3n de sesi\u00f3n del servidor almacenada en cach\u00e9. (nombre de la propiedad: com.iplanet.am.session.client.polling.period) <br>Intercambio directo: No
a221=Proveedor de cifrado
a221.help=Especifica la implementaci\u00f3n de proveedor de cifrado que utilizar\u00e1 el agente. (nombre de la propiedad: com.iplanet.security.encryptor) <br>Intercambio directo: No
a222=Habilitar notificaci\u00f3n de cach\u00e9s de datos de usuario
a222.help=Habilite las notificaciones de cach\u00e9s de amsdk e IdRepo. (nombre de la propiedad: com.sun.identity.idm.remote.notification.enabled) <br>Intercambio directo: No
a223=Tiempo de sondeo de cach\u00e9 de datos de usuario
a223.help=Tiempo de actualizaci\u00f3n de la cach\u00e9 en minutos para los datos de administraci\u00f3n de usuario. Si se ha establecido en \u20190\u2019, no se producir\u00e1 ninguna actualizaci\u00f3n. (nombre de la propiedad: com.iplanet.am.sdk.remote.pollingTime) <br>Intercambio directo: No
a224=Habilitar notificaci\u00f3n de cach\u00e9s de datos de servicio
a224.help=Habilite las notificaciones de cach\u00e9s de administraci\u00f3n de servicio. (nombre de la propiedad: com.sun.identity.sm.notification.enabled) <br>Intercambio directo: No
a225=Tiempo de cach\u00e9 de datos de servicio
a225.help=Tiempo de actualizaci\u00f3n de cach\u00e9 en minutos para los datos de configuraci\u00f3n del servicio. Si se ha establecido en \u20190\u2019, no se producir\u00e1 ninguna actualizaci\u00f3n. (nombre de la propiedad: com.sun.identity.sm.cacheTime) <br>Intercambio directo: No
a229=Protocolo de servicio de autenticaci\u00f3n de OpenAM
a229.help=Protocolo que utilizar\u00e1 el servicio de autenticaci\u00f3n de OpenAM. (nombre de la propiedad: com.iplanet.am.server.protocol) <br>Intercambio directo: No
a231=Nombre de host de servicio de autenticaci\u00f3n de OpenAM
a231.help=Nombre de host que utilizar\u00e1 el servicio de autenticaci\u00f3n de OpenAM. (nombre de la propiedad: com.iplanet.am.server.host) <br>Intercambio directo: No
a232=Puerto de servicio de autenticaci\u00f3n de OpenAM
a232.help=Puerto que utilizar\u00e1 el servicio de autenticaci\u00f3n de OpenAM.  (nombre de la propiedad: com.iplanet.am.server.port) <br>Intercambio directo: No
a235=Habilitar notificaciones de directivas
a235.help=Habilite las notificaciones para el cliente de directivas remoto. (nombre de la propiedad: com.sun.identity.agents.notification.enabled) <br>Intercambio directo: No
a237=Intervalo de sondeo de cliente de directivas
a237.help=Duraci\u00f3n en minutos tras los cuales el cliente de directivas remoto actualiza las entradas de la cach\u00e9. (nombre de la propiedad: com.sun.identity.agents.polling.interval) <br>Intercambio directo: No
a238=Modo de cach\u00e9 de cliente de directivas
a238.help=Modo de almacenamiento en la memoria cach\u00e9 que utilizar\u00e1 el cliente de directivas remoto. (nombre de la propiedad: com.sun.identity.policy.client.cacheMode) <br>Intercambio directo: No
a239=Valores de acci\u00f3n booleanos de cliente de directivas
a239.help=Valores de acci\u00f3n booleanos para nombres de acci\u00f3n de directiva. (nombre de la propiedad: com.sun.identity.policy.client.booleanActionValues) <br>Intercambio directo: No
a241=Comparadores de recursos de cliente de directivas
a241.help=Comparadores de recursos que se utilizar\u00e1n para distintos nombres de servicio. (nombre de la propiedad: com.sun.identity.policy.client.resourceComparators) <br>Intercambio directo: No
a242=Desfase del reloj del cliente de directivas
a242.help=Tiempo en segundos permitido para ajustar la diferencia de tiempo entre el servidor OpenAM y el equipo del cliente de directivas remoto. (nombre de la propiedad: com.sun.identity.policy.client.clockSkew) <br>Intercambio directo: No
a243=Par\u00e1metros GET de entorno de directivas de URL
a243.help=Lista de par\u00e1metros de solicitud GET HTTP cuyos nombres y valores se establecer\u00e1n en la asignaci\u00f3n de entorno para la evaluaci\u00f3n de directivas de URL en el servidor OpenAM. (nombre de la propiedad: com.sun.identity.agents.config.policy.env.get.param) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> nombre <br> n\u00famerodetel\u00e9fono
a244=Par\u00e1metros POST de entorno de directivas de URL
a244.help=Lista de par\u00e1metros de solicitud POST HTTP cuyos nombres y valores se establecer\u00e1n en la asignaci\u00f3n de entorno para la evaluaci\u00f3n de directivas de URL en el servidor OpenAM. (nombre de la propiedad: com.sun.identity.agents.config.policy.env.post.param) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> nombre <br> n\u00famerodetel\u00e9fono
a245=Par\u00e1metros jsession de entorno de directivas de URL
a245.help=Lista de atributos SESSION HTTP cuyos nombres y valores se establecer\u00e1n en la asignaci\u00f3n de entorno para la evaluaci\u00f3n de directivas de URL en el servidor OpenAM.  (nombre de la propiedad: com.sun.identity.agents.config.policy.env.jsession.param) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> nombre <br> n\u00famerodetel\u00e9fono
a246=Notificaci\u00f3n de cambio de configuraci\u00f3n del agente
a246.help=Habilite el agente para recibir mensajes de notificaci\u00f3n del servidor OpenAM cuando se realicen cambios en la configuraci\u00f3n.  (nombre de la propiedad: com.sun.identity.agents.config.change.notification.enable) <br>Intercambio directo: Yes (S\u00ed)
a247=Propiedades personalizadas
a247.help=Propiedades adicionales que permiten a los usuarios aumentar el conjunto de propiedades admitidas por el agente. (nombre de la propiedad: com.sun.identity.agents.config.freeformproperties) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> customproperty=custom-value1 <br> customlist[0]=customlist-value-0 <br> customlist[1]=customlist-value-1 <br> custommap[key1]=custommap-value-1 <br> custommap[key2]=custommap-value-2
a248=WebAuthentication disponible 
a248.help=Habilitar al agente para realizar la autenticaci\u00f3n mediante programa con el contenedor web JBoss utilizando la funci\u00f3n WebAuthentication. (nombre de la propiedad: com.sun.identity.agents.config.jboss.webauth.available) <br>Intercambio directo: S\u00ed 
a250=desactivado
a251=error
a252=advertencia
a253=mensaje
a254=URL de cierre de sesi\u00f3n de OpenAM
a254.help=URL de p\u00e1gina de cierre de sesi\u00f3n de OpenAM (nombre de la propiedad: com.sun.identity.agents.config.logout.url) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> http://host:puerto/opensso/UI/Logout
a255=URL de cierre de sesi\u00f3n por orden de prioridad
a255.help=Especifica si la secuencia de conmutaci\u00f3n por error para las URL de cierre de sesi\u00f3n debe priorizarse, tal y como se define en la lista de URL de cierre de sesi\u00f3n de OpenAM.  (nombre de la propiedad: com.sun.identity.agents.config.logout.url.prioritized) <br>Intercambio directo: Yes (S\u00ed)
a256=An\u00e1lisis de URL de cierre de sesi\u00f3n
a256.help=Especifica si el agente comprobar\u00e1 la disponibilidad de estas URL antes de redireccionarlas. (nombre de la propiedad: com.sun.identity.agents.config.logout.url.probe.enabled) <br>Intercambio directo: Yes (S\u00ed)
a257=Tiempo de espera del an\u00e1lisis de URL de cierre de sesi\u00f3n
a257.help=El valor de tiempo de espera de conexi\u00f3n en milisegundos, si el an\u00e1lisis de URL de cierre de sesi\u00f3n tambi\u00e9n se ha establecido en "true" (verdadero). (nombre de la propiedad: com.sun.identity.agents.config.logout.url.probe.timeout) <br>Intercambio directo: Yes (S\u00ed)


# WSS Agents properties
a301=Mecanismo de seguridad
a302=Configuraci\u00f3n de STS
a302.help=Es necesario si el mecanismo de seguridad se ha configurado en STSSecurity
a303=Configuraci\u00f3n de detecci\u00f3n
a303.help=Es necesario si el mecanismo de seguridad se ha configurado en LibertyDiscoverySecurity
a304=Debe especificarse la autenticaci\u00f3n de usuario
a305=Especifique si se ha habilitado la firma de la solicitud
a306=Especifique si se ha cifrado el encabezado de la solicitud
a307=Especifique si se ha cifrado el cuerpo de la solicitud
a308=Especifique si se ha verificado la firma de la respuesta
a309=Especifique si se ha cifrado la respuesta
a309.help=Cifrado s\u00f3lo cuando el cuerpo se ha cifrado.
a310=Conservar encabezados de seguridad del mensaje
a311=Utilizar el almac\u00e9n de claves predeterminado
a312=Ubicaci\u00f3n del almac\u00e9n de claves
a313=Contrase\u00f1a del almac\u00e9n de claves
a314=Contrase\u00f1a de la clave
a315=Alias de la clave privada
a315.help=Clave para firmar la respuesta / solicitud de servicio web.
a316=Alias de la clave p\u00fablica del proveedor de servicios web
a316.help=Clave para cifrar la solicitud de servicio web.
a317=Punto final del servicio web
a317.help=Este punto final es opcional a menos que se configure el proveedor de servicios web para que utilice los tokens de Liberty.
a318=Punto final de proxy de seguridad del servicio web
a318.help=Este punto final es opcional a menos que se configure para que utilice el proxy de seguridad web.
a319=URN de tipo del servicio Liberty
a319.help=Esto es opcional hasta que el mecanismo de seguridad sea LibertyDiscoverySecurity.


a320=Credencial del usuario token
a321=Encadenamiento de autenticaci\u00f3n
a322=Especifique si se ha verificado la firma de la solicitud
a323.title=Especifique si se ha habilitado el cifrado de la solicitud
a323=Especifique si se ha descifrado el encabezado de la solicitud
a323.header=Encabezado
a324=Especifique si se ha descifrado el cuerpo de la solicitud
a324.body=Cuerpo
a325=Especifique si se ha habilitado la firma de la respuesta
a326=Especifique si se ha cifrado la respuesta
a326.help=Cifrado s\u00f3lo cuando el cuerpo se ha cifrado.
a327=Tipo de clave privada
a328=Alias de la clave p\u00fablica del cliente de servicios web
a328.help=Clave para cifrar la respuesta de servicio web
a329=Alias de la clave p\u00fablica del servicio de token
a330=Punto final del servicio del s\u00edmbolo de seguridad
a331=Punto final del MEX del servicio del s\u00edmbolo de seguridad
a332=Punto final del servicio de detecci\u00f3n
a333=Punto final del servicio web de autenticaci\u00f3n
a334=Asignaci\u00f3n de atributos SAML
a335=Complemento de asignador NameID de SAML
a336=Espacio de nombre de atributos SAML
a337=Incluir miembros
a338=Servidor de dominio Kerberos
a339=Dominio Kerberos
a340=Principal del servicio Kerberos
a341=Archivo de ficha de claves Kerberos
a342=Verificar firma Kerberos
a342.help=Es opcional y se debe habilitar s\u00f3lo cuando se utilice JDK6.
a343=Tipo de conversi\u00f3n del token
a344=SSOToken
a345=SAML11Token
a346=SAML2Token

a350= Servidor de dominio Kerberos
a351= Dominio Kerberos
a352= Principal del servicio de Kerberos
a353= Directorio de memoria cach\u00e9 del ticket de Kerberos
a354= Utilizar token de seguridad del m\u00e9todo de paso a trav\u00e9s
a354.help=Esto es v\u00e1lido para el cliente de los servicios web proxy y se utilizar\u00e1 \u00fanicamente cuando se habiliten los mecanismos de seguridad de SAML.
a355= Tipo de referencia de firma.
a355.help=S\u00f3lo es aplicable al mecanismo de seguridad del token X509.
a356=Referencia directa
a357=Referencia de identificador de clave
a358=Referencia de serie de emisor X509
a359=Algoritmo de cifrado
a360=Intensidad de cifrado
a360.help=Para 3DES, las intensidades de cifrado que se deben utilizar son 0, 112, 168 y para AES deben ser 128, 192 \u00f3 256.
a361=Versi\u00f3n WS-Trust
a362=Detectar reproducci\u00f3n de token de usuario
a363=Detectar reproducci\u00f3n de mensaje
a364=Tipo de clave solicitada
a365=Clave p\u00fablica
a366=Clave sim\u00e9trica
a367=Reclamaciones solicitadas
a367.help=Estos son los atributos solicitados desde el STS para un WSP.
a368=Reclamaci\u00f3n de DNS
a368.help=Nombre de DNS que identifica la entidad en exclusiva.
a369=Elementos firmados

# Web Agent Properties
a400=Nombre de cookie
a400.help=Nombre de la cookie de token de SSO utilizado entre el servidor OpenAM y el agente. (nombre de la propiedad: com.sun.identity.agents.config.cookie.name) <br>Intercambio directo: No
a401=Seguridad de cookies
a401.help=El agente env\u00eda cookies seguras si la comunicaci\u00f3n es segura. (nombre de la propiedad: com.sun.identity.agents.config.cookie.secure) <br>Intercambio directo: No
a405=Habilitar notificaciones
a405.help=Las notificaciones ayudan a mantener el SSO, la directiva y las cach\u00e9s de configuraci\u00f3n del agente. (nombre de la propiedad: com.sun.identity.agents.config.notification.enable) <br>Intercambio directo: No
a406=URL de notificaci\u00f3n de agente
a406.help=URL utilizada por el agente para registrar escuchas de notificaci\u00f3n. (nombre de com.sun.identity.client.notification.url) <br>Intercambio directo: No
a407=Comprobaci\u00f3n de may\u00fasculas/min\u00fasculas en comparaci\u00f3n de URL
a407.help=Aplica may\u00fasculas/min\u00fasculas tanto en la evaluaci\u00f3n de URL no aplicadas como en la evaluaci\u00f3n de directivas. (nombre de la propiedad: com.sun.identity.agents.config.url.comparison.case.ignore) <br>Intercambio directo: S\u00ed
a408=Periodo de sondeo de cach\u00e9 de directivas
a408.help=Intervalo de sondeo en minutos para actualizar la cach\u00e9 de directivas del agente. (nombre de la propiedad: com.sun.identity.agents.config.policy.cache.polling.interval) <br>Intercambio directo: No
a409=Periodo de sondeo de cach\u00e9 de SSO (Single Sign-On, Inicio de sesi\u00f3n \u00fanico)
a409.help=Intervalo de sondeo en minutos para actualizar la cach\u00e9 de SSO del agente. (nombre de la propiedad: com.sun.identity.agents.config.sso.cache.polling.interval) <br>Intercambio directo: No
a410=Par\u00e1metro de Id. de usuario
a410.help=El agente establece el valor de Id. de usuario en la variable de servidor USUARIO_REMOTO. (nombre de la propiedad: com.sun.identity.agents.config.userid.param) <br>Intercambio directo: S\u00ed
a411=Tipo de par\u00e1metro de Id. de usuario
a411.help=El Id. de usuario se puede buscar desde cualquier atributo LDAP y SESSION. (nombre de la propiedad: com.sun.identity.agents.config.userid.param.type) <br>Intercambio directo: S\u00ed
a412=Modo de b\u00fasqueda de atributo de perfil
a412.help= (nombre de la propiedad: com.sun.identity.agents.config.profile.attribute.fetch.mode) <br>Intercambio directo: S\u00ed
a413=Asignaci\u00f3n de atributos de perfil
a413.help=Asigna los atributos de perfil que se insertar\u00e1n en nombres espec\u00edficos para el usuario autenticado actualmente. (nombre de propiedad: com.sun.identity.agents.config.profile.attribute.mapping) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> Para rellenar el valor del atributo de perfil cn con el nombre CUSTOM-Common-Name: introduzca cn en el campo Asignar clave e introduzca CUSTOM-Common-Name en el campo Valor de asignaci\u00f3n correspondiente. <br> Para rellenar el valor del correo de atributos de perfil con el nombre CUSTOM-Email: introduzca correo en el campo Asignar clave, e introduzca CUSTOM-Email en el campo Valor de asignaci\u00f3n correspondiente.
a414=Modo de b\u00fasqueda de atributos de sesi\u00f3n
a414.help= (nombre de la propiedad: com.sun.identity.agents.config.session.attribute.fetch.mode) <br>Intercambio directo: S\u00ed
a415=Asignaci\u00f3n de atributos de sesi\u00f3n
a415.help=Asigna los atributos de sesi\u00f3n que se insertar\u00e1n en nombres espec\u00edficos para el usuario autenticado actualmente. (nombre de propiedad: com.sun.identity.agents.config.session.attribute.mapping) <br>Intercambio directo: Yes (S\u00ed)  <br> Ejemplo: <br>  Para rellenar el valor de atributo de sesi\u00f3n UserToken con el nombre CUSTOM-userid: introduzca UserToken en el campo Asignar clave e introduzca CUSTOM-userid en el campo Valor de asignaci\u00f3n correspondiente.
a416=Modo de b\u00fasqueda de atributos de respuesta
a416.help= (nombre de la propiedad: com.sun.identity.agents.config.response.attribute.fetch.mode) <br>Intercambio directo: S\u00ed
a417=Asignaci\u00f3n de atributos de respuesta
a417.help=Asigna los atributos de respuesta de directivas que se insertar\u00e1n en nombres espec\u00edficos para el usuario autenticado actualmente. (nombre de propiedad: com.sun.identity.agents.config.response.attribute.mapping) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br> Para rellenar el valor del uid del atributo de respuesta con el nombre CUSTOM-USER-NAME: introduzca el uid en el campo Asignar clave e introduzca CUSTOM-USER-NAME en el campo Valor de asignaci\u00f3n correspondiente.
a418=Separador de valores de atributos
a418.help=Car\u00e1cter separador utilizado por las asignaciones de perfil, sesi\u00f3n y atributos de respuesta. (nombre de la propiedad: com.sun.identity.agents.config.attribute.multi_value_separator) <br>Intercambio directo: S\u00ed
a419=Configuraci\u00f3n del equilibrador de carga
a419.help=Establezca esta opci\u00f3n en \u2019true\u2019 verdadero si se utiliza un equilibrador de carga para servicios de OpenAM. (nombre de la propiedad: com.sun.identity.agents.config.load.balancer.enable) <br>Intercambio directo: No
a420=Ignorar comprobaci\u00f3n de servidor
a420.help=El agente utiliza este valor para comprobar que OpenAM est\u00e1 activado antes de realizar un redireccionamiento 302. (nombre de la propiedad: com.sun.identity.agents.config.ignore.server.check) <br>Intercambio directo: S\u00ed
a421=Omitir URL de nombre preferida en la solicitud de nombre
a421.help=El agente utiliza este valor para enviar la URL de nombre preferida en la solicitud de nombre. (nombre de la propiedad: com.sun.identity.agents.config.ignore.preferred.naming.url) <br>Intercambio directo: S\u00ed
a422=Periodo de sondeo para el servidor principal
a422.help=Intervalo en minutos que el agente realiza un sondeo para comprobar que el servidor principal est\u00e9 activo y en ejecuci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.poll.primary.server) <br>Intercambio directo: No
a423=URL de inicio de sesi\u00f3n de OpenAM
a423.help=URL de p\u00e1gina de inicio de sesi\u00f3n de OpenAM. (nombre de la propiedad: com.sun.identity.agents.config.login.url) <br>Intercambio directo: Yes (S\u00ed)<br>Ejemplo: <br> http://host:puerto/opensso/UI/Login
a426=Prefijo URI de implementaci\u00f3n de agente
a426.help=(nombre de la propiedad: com.sun.identity.agents.config.agenturi.prefix) <br>Intercambio directo: Yes
a427=Configuraci\u00f3n regional del agente
a427.help=La configuraci\u00f3n regional del producto. (nombre de la propiedad: com.sun.identity.agents.config.locale) <br>Intercambio directo: No
a428=Modo S\u00f3lo SSO
a428.help=El agente s\u00f3lo aplicar\u00e1 autenticaci\u00f3n (SSO), pero no autorizaci\u00f3n para directivas. (nombre de la propiedad: com.sun.identity.agents.config.sso.only) <br>Intercambio directo: S\u00ed
a429=URL de acceso denegado a recursos
a429.help=La URL de la p\u00e1gina de acceso denegado personalizada. (nombre de la propiedad: com.sun.identity.agents.config.access.denied.url) <br>Intercambio directo: S\u00ed
a430=Comprobaci\u00f3n de FQDN (Fully Qualified Domain Name, Nombre de dominio completo)
a430.help=Habilita la comprobaci\u00f3n del valor predeterminado de fqdn y los valores de asignaci\u00f3n de fqdn. (nombre de la propiedad: com.sun.identity.agents.config.fqdn.check.enable) <br>Intercambio directo: S\u00ed
a431=FQDN predeterminado
a431.help=Nombre de host completo que deben utilizar los usuarios para acceder a los recursos. (nombre de la propiedad: com.sun.identity.agents.config.fqdn.default) <br>Intercambio directo: S\u00ed
a432=Asignaci\u00f3n de host virtual de FQDN
a432.help=Habilita los hosts virtuales, el nombre de host parcial y la direcci\u00f3n IP para acceder a los recursos protegidos. Asigna una clave no v\u00e1lida para validar un valor. (nombre de propiedad: com.sun.identity.agents.config.fqdn.mapping) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br>  Para asignar myserver a myserver.mydomain.com: introduzca myserver en el campo Asignar clave, e introduzca myserver.mydomain.com en el campo Valor de  asignaci\u00f3n correspondiente.
a433=Restablecimiento de cookies
a433.help=El agente restablece las cookies en la respuesta antes de redireccionar a la autenticaci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.cookie.reset.enable) <br>Intercambio directo: S\u00ed
a434=Lista de nombres de restablecimiento de cookies
a434.help=Lista de cookies con el formato: nombre[=valor][;Domain=valor]. (nombre de la propiedad: com.sun.identity.agents.config.cookie.reset) <br>Intercambio directo: S\u00ed <br> Ejemplos: <br> Cookie1 <br> Cookie2=valor;Domain=subdominio.dominio.com
a435=SSO entre dominios
a435.help=Habilita el inicio de sesi\u00f3n \u00fanico (SSO) entre dominios. (nombre de la propiedad: com.sun.identity.agents.config.cdsso.enable) <br>Intercambio directo: S\u00ed
a436=Valor predeterminado de usuario an\u00f3nimo
a436.help=Id. de usuarios no autenticados. (nombre de la propiedad: com.sun.identity.agents.config.anonymous.user.id) <br>Intercambio directo: S\u00ed
a437=Usuario an\u00f3nimo
a437.help=Habilite/deshabilite el procesamiento de USUARIO_REMOTO para los usuarios an\u00f3nimos. (nombre de la propiedad: com.sun.identity.agents.config.anonymous.user.enable) <br>Intercambio directo: S\u00ed
a438=URL no aplicadas
a438.help=Lista de URL para las que no se requiere autenticaci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.url) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplo: <br>http://miagente.midominio.com/*.gif 
a439=Invertir URL no aplicadas
a439.help=S\u00f3lo se aplicar\u00e1 la lista de URL no aplicadas. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.url.invert) <br>Intercambio directo: S\u00ed
a440=Lista de IP de cliente no aplicadas
a440.help=No es necesaria ni autorizaci\u00f3n ni autenticaci\u00f3n para las solicitudes procedentes de estas direcciones IP de cliente. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.ip) <br>Intercambio directo: Yes (S\u00ed) <br> Ejemplos: <br> 192.18.145.* <br> 192.18.146.123
a441=Conservaci\u00f3n de datos POST
a441.help=Habilita la conservaci\u00f3n de datos POST.(nombre de propiedad: com.sun.identity.agents.config.postdata.preserve.enable) <br> Recuerde que no todos los agentes web admiten esta funci\u00f3n. Encontrar\u00e1 m\u00e1s informaci\u00f3n en la documentaci\u00f3n de cada agente. <br>Intercambio directo: S\u00ed
a442=Periodo de cach\u00e9 de entradas de datos POST
a442.help=Duraci\u00f3n de entradas de cach\u00e9 POST en minutos. (nombre de la propiedad: com.sun.identity.agents.config.postcache.entry.lifetime) <br>Intercambio directo: S\u00ed
a443=URL de Servlet de CDSSO
a443.help=Lista de URL de controladores de CDSSO disponibles que puede utilizar el agente para procesamiento de CDSSO. (nombre de la propiedad: com.sun.identity.agents.config.cdsso.cdcservlet.url) <br>Clave v\u00e1lida: Yes (S\u00ed) <br> Ejemplo <br>http://host:puerto/opensso/cdcservlet
a444=Lista de dominios de cookies
a444.help=Lista de dominios en los que las cookies deben establecerse en CDSSO (Cross Domain Single Sign On, Inicio de sesi\u00f3n \u00fanico entre dominios).(nombre de la propiedad: com.sun.identity.agents.config.cdsso.cookie.domain) <br>Intercambio directo: Yes (S\u00ed) <br>Ejemplo: <br> .sun.com
a445=Validaci\u00f3n de IP de cliente
a445.help=Valida si las posteriores solicitudes de navegador proceden de la misma direcci\u00f3n IP que el token de SSO inicialmente emitido. (nombre de la propiedad: com.sun.identity.agents.config.client.ip.validation.enable) <br>Intercambio directo: S\u00ed
a446=Prefijo de cookie de atributos de perfil
a446.help=Establece el prefijo de cookie en los encabezados de atributos. (nombre de la propiedad: com.sun.identity.agents.config.profile.attribute.cookie.prefix) <br>Intercambio directo: S\u00ed
a447=Edad m\u00e1xima de cookie de atributos de perfil
a447.help=Edad m\u00e1xima de los encabezados de cookies de atributos. (nombre de la propiedad: com.sun.identity.agents.config.profile.attribute.cookie.maxage) <br>Intercambio directo: S\u00ed
a448=Lista de URL de cierre de sesi\u00f3n
a448.help=Lista de URL de cierre de sesi\u00f3n de las aplicaciones.  Se cierra la sesi\u00f3n OpenAM del usuario cuando se accede a estas URL. (nombre de propiedad: com.sun.identity.agents.config.agent.logout.url). Si se utiliza esta propiedad, el usuario debe especificar un valor para la propiedad URL de redirecci\u00f3n de cierre de sesi\u00f3n que aparece a continuaci\u00f3n.<br>Intercambio directo: S\u00ed <br> Ejemplo: <br> http://miagente.midominio.com/logout.html
a449=Lista de cookies de cierre de sesi\u00f3n para restablecer
a449.help=Cualquier cookie que se restablecer\u00e1 al cerrar una sesi\u00f3n con el mismo formato que la lista de restablecimiento de cookies. (nombre de la propiedad: com.sun.identity.agents.config.logout.cookie.reset) <br>Intercambio directo: S\u00ed <br> Cookie1 <br> Cookie2=valor;Domain=subdominio.dominio.com
a450=directivas de b\u00fasqueda desde recurso ra\u00edz
a450.help=El agente almacena en la memoria cach\u00e9 la decisi\u00f3n de directivas del recurso y todos los recursos desde la ra\u00edz del recurso. (nombre de la propiedad: com.sun.identity.agents.config.fetch.from.root.resource) <br>Intercambio directo: No
a451=Recuperar nombre de host de cliente
a451.help=Obtiene el nombre de host del cliente mediante la b\u00fasqueda inversa de DNS para su uso en la evaluaci\u00f3n de directivas. (nombre de la propiedad: com.sun.identity.agents.config.get.client.host.name) <br>Intercambio directo: S\u00ed
a452=Codificaci\u00f3n nativa de atributos de perfil
a452.help=El agente codifica el encabezado LDAP en la codificaci\u00f3n predeterminada de la configuraci\u00f3n regional del SO. Si se ha establecido en \u2019false\u2019 falso, suele ser UTF-8. (nombre de la propiedad: com.sun.identity.agents.config.convert.mbyte.enable) <br>Intercambio directo: S\u00ed
a453=Codificar caracteres especiales de URL
a453.help=Codifica la URL que tiene caracteres especiales antes de realizar la evaluaci\u00f3n de directivas. (nombre de la propiedad: com.sun.identity.agents.config.encode.url.special.chars.enable) <br>Intercambio directo: S\u00ed
a454=Omitir la informaci\u00f3n sobre la ruta en la URL de solicitud
a454.help=La informaci\u00f3n sobre la ruta se determinar\u00e1 a partir de la URL de solicitud cuando se realice una comprobaci\u00f3n de Lista no obligada y una evaluaci\u00f3n de directiva de URL si el valor se define en verdadero. (nombre de la propiedad: com.sun.identity.agents.config.ignore.path.info) <br>Intercambio directo: S\u00ed
a455=Reemplazar protocolo de URL de solicitud
a455.help=Establezca esta opci\u00f3n en \u2019true\u2019 verdadero, si el agente act\u00faa en segundo plano detr\u00e1s de un proxy, un equilibrador de carga o un cargador externo de SSL. (nombre de la propiedad: com.sun.identity.agents.config.override.protocol) <br>Intercambio directo: S\u00ed
a456=Reemplazar host de URL de solicitud
a456.help=Establezca esta opci\u00f3n en \u2019true\u2019 verdadero, si el agente act\u00faa en segundo plano detr\u00e1s de un proxy, un equilibrador de carga o un cargador externo de SSL. (nombre de la propiedad: com.sun.identity.agents.config.override.host) <br>Intercambio directo: S\u00ed
a457=Reemplazar puerto de URL de solicitud
a457.help=Establezca esta opci\u00f3n en \u2019true\u2019 verdadero, si el agente act\u00faa en segundo plano detr\u00e1s de un proxy, un equilibrador de carga o un cargador externo de SSL. (nombre de la propiedad: com.sun.identity.agents.config.override.port) <br>Intercambio directo: S\u00ed
a458=Reemplazar URL de notificaci\u00f3n
a458.help=Establezca esta opci\u00f3n en \u2019true\u2019 verdadero, si el agente act\u00faa en segundo plano detr\u00e1s de un proxy, un equilibrador de carga o un cargador externo de SSL. (nombre de la propiedad: com.sun.identity.agents.config.override.notification.url) <br>Intercambio directo: S\u00ed
a459=Tiempo de espera de conexi\u00f3n de agente
a459.help=Periodo de tiempo de espera en segundos para una conexi\u00f3n de agente con el servidor de autorizaci\u00f3n OpenAM. (nombre de la propiedad: com.sun.identity.agents.config.auth.connection.timeout) <br>Intercambio directo: S\u00ed
a460=Periodo de sondeo para el servidor principal
a460.help=Intervalo en minutos que el agente realiza un sondeo para comprobar que el servidor principal est\u00e9 activo y en ejecuci\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.poll.primary.server) <br>Intercambio directo: No
a461=Configuraci\u00f3n regional del agente
a461.help=La configuraci\u00f3n regional del producto. (nombre de la propiedad: com.sun.identity.agents.config.locale) <br>Intercambio directo: No
a462=Reemplazar host y puerto del servidor proxy
a462.help=(nombre de la propiedad: com.sun.identity.agents.config.proxy.override.host.port) <br>Intercambio directo: No
a463=Intervalo de recarga de configuraci\u00f3n
a463.help=Intervalo en minutos para buscar la configuraci\u00f3n del agente desde OpenAM.  (nombre de la propiedad: com.sun.identity.agents.config.polling.interval) <br>Intercambio directo: No
a464=Intervalo de limpieza de configuraci\u00f3n
a464.help=Intervalo en minutos para limpiar las entradas de configuraci\u00f3n del agente anterior. (nombre de la propiedad: com.sun.identity.agents.config.cleanup.interval) <br>Intercambio directo: No
a465=Propiedades personalizadas
a465.help=Propiedades adicionales que permiten a los usuarios aumentar el conjunto de propiedades admitidas por el agente. (nombre de la propiedad: com.sun.identity.agents.config.freeformproperties) <br>Intercambio directo: S\u00ed <br> Ejemplos: <br> propiedadpersonalizada=valor1-personalizado <br> listapersonalizada[0]=valor-0-listapersonalizada <br> listapersonalizada[1]=valor-1-listapersonalizada  <br> asignaci\u00f3npersonalizada[key1]=valor-1-asignaci\u00f3npersonalizada <br> asignaci\u00f3npersonalizada[key2]=valor-2-asignaci\u00f3npersonalizada
a467=Buscar atributos para URL no aplicadas
a467.help=El agente busca atributos de perfil para URL no aplicadas realizando la evaluaci\u00f3n de directivas. (nombre de la propiedad: com.sun.identity.agents.config.notenforced.url.attributes.enable) <br>Intercambio directo: S\u00ed
a468=Error
a469=Advertencia
a470=Info
a471=Mensaje
a472=Todos
a473=ALTA
a474=BAJA
a475=MEDIA
a476=PREDETERMINADA
a477=Tipo de autenticaci\u00f3n 
a477.help=(nombre de la propiedad: com.sun.identity.agents.config.iis.auth.type) 
a478=Reproducir clave de contrase\u00f1a 
a478.help=Clave DES para descifrar la contrase\u00f1a de autenticaci\u00f3n b\u00e1sica en la sesi\u00f3n. (nombre de la propiedad: com.sun.identity.agents.config.replaypasswd.key) 
a479=Prioridad del filtro 
a479.help=La prioridad de carga del filtro.(nombre de la propiedad: com.sun.identity.agents.config.iis.filter.priority)
a480=Filtro configurado con OWA (Outlook Web Access) 
a480.help=Establezca esta opci\u00f3n en \u2019true\u2019 verdadero si el filtro del agente IIS est\u00e1 configurado para OWA.(nombre de la propiedad: com.sun.identity.agents.config.iis.owa.enable)
a481=Cambiar el protocolo de URL a https 
a481.help=Si se establece en \u2019true\u2019 verdadero, impide la aparici\u00f3n de los men\u00fas emergentes de seguridad de IE6. (nombre de la propiedad: com.sun.identity.agents.config.iis.owa.enable.change.protocol)
a482=URL de p\u00e1gina de tiempo de espera de sesi\u00f3n inactivo
a482.help=URL de la p\u00e1gina de tiempo de espera de sesi\u00f3n inactivo local. (nombre de la propiedad: com.sun.identity.agents.config.iis.owa.enable.session.timeout.url) 
a483=Comprobar usuario en la base de datos de domino
a483.help=Si se ha establecido en \u2019true\u2019 verdadero, el agente comprueba la existencia del usuario en la base de datos del nombre de domino. (nombre de la propiedad: com.sun.identity.agents.config.domino.check.name.database) 
a484=Utilizar token LTPA (Lightweight Third Party Authentication)
a484.help=Establezca esta opci\u00f3n en \u2019true\u2019 verdadero si el agente necesita utilizar el token LTPA. (nombre de la propiedad: com.sun.identity.agents.config.domino.ltpa.enable)
a485=Nombre de cookie de token LTPA
a485.help=El nombre de la cookie que contiene el token LTPA. (nombre de la propiedad: com.sun.identity.agents.config.domino.ltpa.cookie.name) 
a486=Nombre de la configuraci\u00f3n de token LTPA
a486.help=El nombre de la configuraci\u00f3n que el agente utiliza para implementar el mecanismo de token LTPA. (nombre de la propiedad: com.sun.identity.agents.config.domino.ltpa.config.name) 
a487=Nombre de la organizaci\u00f3n de token LTPA
a487.help=El nombre de la organizaci\u00f3n a la que pertenece el token LTPA. (nombre de la propiedad: com.sun.identity.agents.config.domino.ltpa.org.name)
a488=Desfase del reloj de directivas
a488.help=Tiempo en segundos utilizado para ajustar la diferencia de tiempo entre el equipo del agente y OpenAM. Desfase de reloj en segundos =AgentTime - OpenAMServerTime. (nombre de la propiedad: com.sun.identity.agents.config.policy.clock.skew) <br>Intercambio directo: No
a489=Tipos de acceso de auditor\u00eda
a489.help=Tipos de mensajes para registrar en funci\u00f3n de los intentos de acceso de URL del usuario. (nombre de la propiedad: com.sun.identity.agents.config.audit.accesstype) <br>Intercambio directo: S\u00ed
a490=Ubicaci\u00f3n del registro de auditor\u00eda
a490.help=Especifica el lugar donde deben registrarse los mensajes de auditor\u00eda. (nombre de la propiedad: com.sun.identity.agents.config.log.disposition) <br>Intercambio directo: S\u00ed
a491=Nombre de archivo de registro remoto 
a491.help=Nombre del archivo almacenado en el servidor OpenAM que contiene los mensajes de auditor\u00eda del agente. (nombre de la propiedad: com.sun.identity.agents.config.remote.logfile) <br>Intercambio directo: No
a492=Intervalo de registro de auditor\u00eda remoto
a492.help=El intervalo peri\u00f3dico en el que se han enviado los mensajes de registro de auditor\u00eda al archivo de registro remoto. (nombre de la propiedad: com.sun.identity.agents.config.remote.log.interval) <br>Intercambio directo: No
a493=Rotar registro de auditor\u00eda local
a493.help=Marque para indicar que los archivos de registro de auditor\u00eda se deben rotar cuando alcancen un determinado tama\u00f1o. (nombre de la propiedad: com.sun.identity.agents.config.local.log.rotate) <br>Intercambio directo: S\u00ed
a494=Tama\u00f1o de rotaci\u00f3n de registro de auditor\u00eda local
a494.help=L\u00edmite de tama\u00f1o en bytes cuando se rota un archivo de registro de auditor\u00eda local en un nuevo archivo. (nombre de la propiedad: com.sun.identity.agents.config.local.log.size) <br>Intercambio directo: S\u00ed
a495=Nivel de depuraci\u00f3n del agente
a495.help=Nivel de depuraci\u00f3n del agente. (nombre de la propiedad: com.sun.identity.agents.config.debug.level) <br>Intercambio directo: Yes (S\u00ed)
a496=Rotaci\u00f3n del archivo de registro de depuraci\u00f3n del agente
a496.help=El archivo de depuraci\u00f3n se rota seg\u00fan el tama\u00f1o especificado. (nombre de la propiedad: com.sun.identity.agents.config.debug.file.rotate) <br>Intercambio directo: Yes (S\u00ed)
a497=Tama\u00f1o del archivo de depuraci\u00f3n del agente
a497.help=Tama\u00f1o del archivo de depuraci\u00f3n de agente en bytes. (nombre de la propiedad: com.sun.identity.agents.config.debug.file.size) <br>Intercambio directo: Yes (S\u00ed)
a498=Separador de varios valores de atributos 
a498.help=Especifica el valor de varios valores. Se aplica a todos los tipos de atributos, por ejemplo, atributos de perfil, sesi\u00f3n y respuesta. (nombre de la propiedad: com.sun.identity.agents.config.attribute.multi.value.separator) <br>Intercambio directo: Yes (S\u00ed)
a499=URL de redirecci\u00f3n del cierre de sesi\u00f3n
a499.help= El usuario se redirige a esta URL tras el cierre de sesi\u00f3n.(nombre de propiedad: com.sun.identity.agents.config.logout.redirect.url). Esta propiedad se debe especificar junto con la lista URL de cierre de sesi\u00f3n precedente.<br>Intercambio directo: S\u00ed


# 2.2 Policy Agent properties
a500=Descripci\u00f3n
a501=Valor(es) de clave(s) de agente
a501.help=Establezca las propiedades del agente con un par de clave/valor. OpenAM utiliza esta propiedad para recibir las solicitudes del agente para las aserciones de credenciales acerca de los usuarios. Actualmente, s\u00f3lo una propiedad es v\u00e1lida y se omitir\u00e1n todas las dem\u00e1s propiedades. Utilice el siguiente formato: <br> agentRootURL=protocolo://nombrehost:puerto/ <br> La entrada debe ser precisa y "agentRootURL" debe distinguir entre may\u00fasculas y min\u00fasculas.

# Agent Authenticator properties
a600=Perfiles de agente a los que se permite la lectura.
a601=URL de ra\u00edz de agente para CDSSO
a601.help=La direcci\u00f3n URL del agente root para la CDSSO. El valor correcto est\u00e1 en el formato siguiente: <br>protocolo://nombredelhost:puerto/<br> El protocolo representa el protocolo utilizado, por ejemplo http o https. El nombre del host representa el nombre del host de la m\u00e1quina en la que reside el agente. El puerto representa el n\u00famero de puerto en el que est\u00e1 instalado el agente. Es necesario incluir la barra invertida que sigue al n\u00famero de puerto. 

# UI properties
wss.header.general=General
wss.header.security=Seguridad
wss.header.signencrypt=Firma y cifrado
wss.header.signing=Firma
wss.header.signing.Body=Cuerpo
wss.header.signing.SecurityToken=Token de seguridad
wss.header.signing.Timestamp=Marca de fecha y hora
wss.header.signing.To=A
wss.header.signing.From=De
wss.header.signing.ReplyTo=Responder a
wss.header.signing.Action=Acci\u00f3n
wss.header.signing.MessageID=Id. de mensaje
wss.header.encryption=Cifrado
wss.header.keystore=Almac\u00e9n de claves
wss.header.endpoints=Puntos finales
wss.header.saml.configuration=Configuraci\u00f3n de SAML
wss.header.kerberos=Configuraci\u00f3n de Kerberos
blank.header=
label.Yes=S\u00ed
web.services.profile.username-token-header=Credencial del usuario token
label.agentgroup=Grupo
keystore.usage=Uso de almac\u00e9n de claves
keystore.usage.default=Predeterminado
keystore.usage.custom=Personalizada
keystore.information=Ubicaci\u00f3n del almac\u00e9n de claves (obligatorio si no se ha marcado la opci\u00f3n Usar almac\u00e9n de claves predeterminado).
entity.attribute.label.uuid=Identificador universal
entity.attribute.label.identityType=Tipo
web.services.profile.usernametokenname=Nombre
web.services.profile.usernametokenpassword=Contrase\u00f1a
