/**
 * NO MODIFICAR O ELIMINAR LAS NOTAS DE COPYRIGHT NI ESTE ENCABEZADO.
 *
 * Copyright (c) 2009 Sun Microsystems, Inc. Todos los derechos reservados
 *
 * Los contenidos de este archivo est\u00e1n sujetos a los t\u00e9rminos estipulados
 * en la Licencia de desarrollo com\u00fan y distribuci\u00f3n 
 * (la Licencia). Este archivo s\u00f3lo puede utilizarse 
 * de conformidad con la Licencia.
 *
 * Puede obtener una copia de la Licencia en
 * https://opensso.dev.java.net/public/CDDLv1.0.html o en
 * opensso/legal/CDDLv1.0.txt.
 * Consulte la Licencia para conocer los permisos espec\u00edficos que rigen cada idioma y 
 * las limitaciones estipuladas en ella.
 *
 * Cuando se distribuya c\u00f3digo cubierto, es necesario incluir este 
 * encabezado de aviso de Licencia e incluir el archivo de la Licencia disponible en 
 * opensso/legal/CDDLv1.0.txt.
 * Si fuera necesario, a\u00f1ada lo siguiente bajo el encabezado, 
 * sustituyendo los campos entre corchetes [] 
 * por su informaci\u00f3n personal:
 * "Porciones protegidas por Copyright [a\u00f1o] [nombre del propietario del Copyright]"
 *
 * $Id: EntitlementException_es.properties,v 1.1 2009/12/26 03:55:07 cbasha Exp $
 */

1=No se puede crear una nueva instancia del privilegio.
2=No se puede crear una nueva instancia del privilegio porque falta la clase de implementaci\u00f3n del privilegio.
3=El nombre del privilegio no puede estar vac\u00edo.
4=El derecho no puede ser nulo.
5=Operaci\u00f3n no permitida.
6=No se puede instanciar la clase de aplicaci\u00f3n.
7=No se puede analizar el XML.
8=La ubicaci\u00f3n de WSDL {0} no es v\u00e1lida.

10=La sesi\u00f3n no es v\u00e1lida o ha caducado. Esto suele ocurrir cuando otra parte invalida la sesi\u00f3n o si se agota su tiempo de espera de inactividad.

50=Imposible escribir entrada de \u00edndice, {0}.
51=Imposible eliminar entrada de \u00edndice, {0}.
52=Imposible leer entrada de \u00edndice, {0}.
55=No se puede eliminar la entrada de \u00edndice {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
56=No se puede leer la entrada de \u00edndice {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.

100=No se pudo evaluar la directiva.
101=No se puede crear el administrador de directivas desde el dominio {0}.
102=No se puede obtener el objeto de directiva {0}.
103=No se puede obtener el objeto de asunto {0] en la directiva {1}.
104=No se puede obtener el objeto de condici\u00f3n {0] en la directiva {1}.
105=No se puede crear el privilegio porque la aplicaci\u00f3n {0} no se encuentra en el dominio {1}.
110=No se puede obtener el tipo de aplicaci\u00f3n {0}.

113=No se puede evaluar el objeto de asunto {0] en la directiva {1}.
114=No se puede evaluar el objeto de condici\u00f3n {0] en la directiva {1}.

200=No se puede serializar el objeto.
201=No se puede deserializar el objeto.
202=Imposible mantener la directiva {0} en el almac\u00e9n de datos.
203=La directiva {0} no existe.
204=No se puede recuperar la directiva {0}.
205=No se puede suprimir la directiva {0}.
206=No se puede modificar la directiva {0}.
207=No se puede mantener la directiva {0} en el almac\u00e9n de datos porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
208=No se puede modificar la directiva {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
209=No se puede recuperar la directiva {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
210=No se puede agregar el privilegio al almac\u00e9n de datos.
211=No se puede suprimir la directiva {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
215=No se pueden buscar privilegios.
216=No se pueden buscar privilegios porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.

220=Imposible obtener nombres de atributo de asunto.
221=No se puede agregar la acci\u00f3n a la aplicaci\u00f3n.
222=No se puede agregar la acci\u00f3n a la aplicaci\u00f3n porque ya existe la acci\u00f3n {0}.
225=No se pueden obtener nombres de atributo de asunto porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
226=No se puede agregar la acci\u00f3n a la aplicaci\u00f3n porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
227=Imposible obtener nombres de subdominio.
228=La aplicaci\u00f3n ya existe.
230=No se puede suprimir la aplicaci\u00f3n {0}.
231=No se puede modificar la aplicaci\u00f3n {0}.
240=No se puede suprimir el tipo de aplicaci\u00f3n {0}.
241=No se puede modificar el tipo de aplicaci\u00f3n {0}.
245=No se puede suprimir el tipo de aplicaci\u00f3n {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
246=No se puede modificar el tipo de aplicaci\u00f3n {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
247=No se puede guardar la aplicaci\u00f3n {0} porque no hay referencia a sus recursos desde el principal.
248=No se puede recuperar la aplicaci\u00f3n dentro del dominio {0}.

250=Falta el nombre del privilegio de referencia en el privilegio de referencia.
251=Falta la asignaci\u00f3n de nombre de aplicaci\u00f3n a nombres de recurso en el privilegio de referencia.
252=Faltan dominios en el privilegio de referencia.

260=No se puede agregar el privilegio de referencia porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
261=No se puede agregar el privilegio de referencia.
262=No se puede recuperar el privilegio de referencia {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
263=El privilegio de referencia {0} no existe.
264=No se puede modificar el privilegio de referencia {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
265=No se puede modificar el privilegio de referencia {0}.
266=No se puede suprimir el privilegio de referencia {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
267=No se puede agregar el privilegio de referencia {0} porque no hay referencia a sus recursos desde el principal.

270=No se puede agregar el privilegio de referencia al almac\u00e9n de datos.
275=No se puede obtener el recurso de referencia para el dominio, {0}.

280=No se puede referenciar un privilegio al subdominio {1} porque la aplicaci\u00f3n {2} no exist\u00eda en el dominio principal {0}.

285=No se pueden obtener los nombres de configuraci\u00f3n de recolector de atributos de asunto porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
286=No se pueden obtener los nombres de configuraci\u00f3n de recolector de atributos de asunto.
287=No se puede obtener la configuraci\u00f3n de recolector de atributos de asunto {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
288=No se puede obtener la configuraci\u00f3n de recolector de atributos de asunto {0}.
289=No se puede definir la configuraci\u00f3n de recolector de atributos de asunto {0} porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
290=No se puede definir la configuraci\u00f3n de recolector de atributos de asunto {0}.

300=La misma regla no puede tener ambos tipos de comodines.
301=Puerto no v\u00e1lido {0}
302=URL {0} mal construida
303=Recurso {0} no v\u00e1lido
# TODO(jtb)
310=Clases de asunto de derecho no v\u00e1lidas en privilegio de aplicaci\u00f3n.

320=No hay ning\u00fan nombre de aplicaci\u00f3n en el privilegio de delegaci\u00f3n.
321=No se ha encontrado la aplicaci\u00f3n {0}.
322=No hay recursos en el privilegio de delegaci\u00f3n.
323={0} no se puede delegar.
324={0} no se puede codificar.
325=No se ha encontrado {0}.
326=Se ha denegado la autorizaci\u00f3n.
327=Son necesarios los asuntos.
328=Filtro de b\u00fasqueda {0} incorrecto.

400=Valor no v\u00e1lido {1} para propiedad {0}
401=Valor no v\u00e1lido {0}
402=La fecha de inicio, {0\}, no puede ser posterior a la final, {1}
403=No se puede crear el asunto.

508=Fallo al evaluar el asunto.
510=Fallo al evaluar la condici\u00f3n.

600=No se pueden obtener los atributos de asunto para {0}.
601=No se puede determinar si est\u00e1 presente el valor de atributo del asunto {0} especificado.
602=Imposible obtener nombres de atributo de asunto disponibles.

420=Falta recurso en llamada REST.
421=Falta identificador de asunto en llamada REST.
422=Falta acci\u00f3n en llamada REST.
424=Son necesarios los nombres de recurso.
425=Excepci\u00f3n de JSON.
426=Se necesita la URL de notificaci\u00f3n en el proceso de escucha de derechos.
427=Proceso de escucha de derechos para {0} no encontrado.
428=Se necesita el nombre de la aplicaci\u00f3n en el proceso de escucha de derechos.
429=No se pueden recuperar los procesos de escucha del almac\u00e9n de datos. Los datos del proceso de escucha parecen da\u00f1ados.
430=No se pueden recuperar los procesos de escucha del almac\u00e9n de datos. El usuario administrador carece del privilegio de lectura.
431=No se puede agregar la notificaci\u00f3n porque {0} no existe.
432=No se ha encontrado la aplicaci\u00f3n de delegaci\u00f3n.
434=No se puede autenticar la solicitud.

450=No se pueden buscar aplicaciones.
451=No se pueden buscar aplicaciones porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.

resource.validation.does.not.match.valid.resources={0} no coincide con ning\u00fan recurso v\u00e1lido.
resource.validation.invalid.resource={0} no era v\u00e1lido.
