#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amPasswordReset_ja.properties,v 1.11 2009/12/26 03:51:45 cbasha Exp $
#

# Portions Copyrighted 2012 ForgeRock Inc
# Portions Copyrighted 2012 Open Source Solution Technology Corporation

onlinehelp.doc=pswdreset.html
iplanet-am-password-reset-service-description=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8
p109=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8
p101=\u30e6\u30fc\u30b6\u30fc\u691c\u8a3c
p101.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u30ea\u30bb\u30c3\u30c8\u3055\u308c\u3066\u3044\u308b\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u898b\u3064\u3051\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u30cd\u30fc\u30df\u30f3\u30b0\u5c5e\u6027\u3002
p102=\u79d8\u5bc6\u306e\u8cea\u554f
p102.help=\u30e6\u30fc\u30b6\u30fc\u304c\u5229\u7528\u3067\u304d\u308b\u79d8\u5bc6\u306e\u8cea\u554f\u306e\u30ea\u30b9\u30c8\u3002
p102.help.txt=\u30e6\u30fc\u30b6\u30fc\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30ea\u30bb\u30c3\u30c8\u3059\u308b\u305f\u3081\u306e\u8cea\u554f\u3092\u3053\u306e\u30ea\u30b9\u30c8\u304b\u3089\u9078\u629e\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
p103=\u691c\u7d22\u30d5\u30a3\u30eb\u30bf
p104=\u30d9\u30fc\u30b9 DN
p105=\u30d0\u30a4\u30f3\u30c9 DN
p106=\u30d0\u30a4\u30f3\u30c9\u30d1\u30b9\u30ef\u30fc\u30c9
p107=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u751f\u6210\u30af\u30e9\u30b9
p107.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u4e00\u90e8\u3068\u3057\u3066\u3001\u65b0\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u751f\u6210\u3059\u308b\u30af\u30e9\u30b9\u3002
p107.help.txt=\u30e6\u30fc\u30b6\u30fc\u304c\u6b63\u5e38\u306b\u81ea\u5206\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u8cea\u554f\u306b\u7b54\u3048\u305f\u3068\u304d\u306b\u3001\u3053\u308c\u3089\u306e\u30af\u30e9\u30b9\u306f\u65b0\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u96fb\u5b50\u30e1\u30fc\u30eb\u3067\u9001\u4fe1\u3057\u307e\u3059\u3002\
\u3053\u306e\u30af\u30e9\u30b9\u306f\u524d\u8ff0\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u6b21\u306e\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3059\u308b\u3053\u3068\u3067\u3001\u30ab\u30b9\u30bf\u30e0\u5b9f\u88c5\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002:<br/><br/>\
<code>com.sun.identity.password.plugins.PasswordGenerator</code>
p108=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u5909\u66f4\u901a\u77e5\u306e\u30aa\u30d7\u30b7\u30e7\u30f3
p108.help=\u3053\u306e\u30af\u30e9\u30b9\u306f\u65b0\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30e6\u30fc\u30b6\u30fc\u306b\u901a\u77e5\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
p108.help.txt=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5b9f\u88c5\u3067\u306f\u3001\u65b0\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30e6\u30fc\u30b6\u30fc\u306b\u901a\u77e5\u3059\u308b\u305f\u3081\u306b\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\
\u307e\u305f\u30ab\u30b9\u30bf\u30e0\u306e\u5b9f\u88c5\u3092\u4f7f\u7528\u3053\u3068\u3082\u3067\u304d\u307e\u3059( SMS \u3092\u4f7f\u7528\u3057\u3066\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u901a\u77e5\u3059\u308b\u3068\u3044\u3063\u305f)\u3002\u30ab\u30b9\u30bf\u30e0\u5b9f\u88c5\u306f\u6b21\u306e\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002:<br/><br/>\
<code>com.sun.identity.password.plugins.NotifyPassword</code>
p110=\u30e6\u30fc\u30b6\u30fc\u72ec\u81ea\u306e\u8cea\u554f
p110.help=\u30e6\u30fc\u30b6\u30fc<i>\u5404\u81ea\u304c</i>\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30ea\u30bb\u30c3\u30c8\u3059\u308b\u8cea\u554f\u3092\u6301\u3064\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
p111=\u8cea\u554f\u306e\u6700\u5927\u6570
p111.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u30da\u30fc\u30b8\u306b\u8868\u793a\u3055\u308c\u308b\u8cea\u554f\u306e\u6700\u5927\u6570\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
p111.1=\u6b21\u306e\u30ed\u30b0\u30a4\u30f3\u6642\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u5909\u66f4\u3092\u5f37\u5236
p111.1.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u3092\u4f7f\u7528\u3057\u3066\u521d\u56de\u30ed\u30b0\u30a4\u30f3\u6642\u306b\u30e6\u30fc\u30b6\u30fc\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u5909\u66f4\u3092\u8981\u6c42\u3057\u307e\u3059\u3002
p112=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u5931\u6557\u306b\u3088\u308b\u30ed\u30c3\u30af\u30a2\u30a6\u30c8
p112.help=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u3092\u4f7f\u7528\u3057\u3066\u30e6\u30fc\u30b6\u30fc\u306b\u5bfe\u3059\u308b\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6a5f\u80fd\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
p112.help.txt=OpenAM \u306f\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u6642\u9593\u8d85\u904e\u306b\u3088\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u8cea\u554f\u306e\u5931\u6557\u56de\u7b54\u6570\u3092\u8ffd\u8de1\u3057\u3001\
\u4e8b\u524d\u5b9a\u7fa9\u3055\u308c\u305f\u5236\u9650\u3092\u8d85\u3048\u305f\u5834\u5408\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3057\u305f\u308a\u3001\u8ffd\u52a0\u6a5f\u80fd\u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u3053\u306e\u6a5f\u80fd\u306f\u3001LDAP Directory Server \u306b\u3088\u3063\u3066\u5b9f\u88c5\u3055\u308c\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u52d5\u4f5c\u306b\u5f71\u97ff\u3092\u4e0e\u3048\u307e\u3059\u3002
p113=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u5931\u6557\u304c\u53f3\u306e\u56de\u6570\u306b\u9054\u3057\u305f\u3089\u30ed\u30c3\u30af\u30a2\u30a6\u30c8
p113.help=\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u3055\u308c\u308b\u307e\u3067\u306b\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u8cea\u554f\u306b\u5bfe\u3057\u3066\u56de\u7b54\u304c\u5931\u6557\u3067\u304d\u308b\u6700\u5927\u56de\u6570
p113.help.txt=\u3053\u306e\u8a2d\u5b9a\u306f\u3001 OpenAM \u304c\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u3059\u308b\u307e\u3067\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u671f\u9593\u5185\u306b\u3001\
\u30e6\u30fc\u30b6\u30fc\u304c\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u8cea\u554f\u306b\u5931\u6557\u3067\u304d\u308b\u6700\u5927\u56de\u6570\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
p114=\u53f3\u306e\u9593\u9694\u5185\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u3092\u5b8c\u4e86\u3057\u306a\u3051\u308c\u3070\u30ed\u30c3\u30af\u30a2\u30a6\u30c8
p114.help=\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u671f\u9593\u306f\u5206\u5358\u4f4d\u3067\u3059\u3002
p114.help.txt=OpenAM \u306f\u3001\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u671f\u9593\u5185\u306b\u30e6\u30fc\u30b6\u30fc\u304c\u5931\u6557\u3057\u305f\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u8cea\u554f\u6570\u3092\u8ffd\u8de1\u3057\u307e\u3059\u3002\
\u305f\u3068\u3048\u3070: \u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u671f\u9593\u304c5\u5206\u3067\u3001\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u30ab\u30a6\u30f3\u30c8\u304c5\u3067\u3042\u308b\u5834\u5408; \
\u30e6\u30fc\u30b6\u30fc\u304c\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u8cea\u554f\u306b\u5bfe\u3057\u30665\u5206\u9593\u30675\u56de\u4ee5\u4e0a\u306e\u56de\u7b54\u5931\u6557\u3092\u3059\u308b\u3068\u3001\u305d\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u30ed\u30c3\u30af\u3055\u308c\u307e\u3059\u3002\
5\u5206\u3092\u8d85\u3048\u3066\u767a\u751f\u3057\u305f\u56de\u7b54\u5931\u6557\u306f\u3001\u7121\u8996\u3055\u308c\u307e\u3059\u3002
p115=\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u901a\u77e5\u306e\u9001\u4fe1\u5148\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9
p115.help=\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u30a4\u30d9\u30f3\u30c8\u306b\u95a2\u3059\u308b\u901a\u77e5\u3092\u53d7\u3051\u53d6\u308b\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u307e\u305f\u306f\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306e\u30bb\u30c3\u30c8\u3067\u3059\u3002
p115.help.txt=OpenAM \u306f\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u30a4\u30d9\u30f3\u30c8\u304c\u767a\u751f\u3057\u305f\u969b\u306b\u3001\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306e\u30bb\u30c3\u30c8\u306b\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u53ef\u80fd\u306a\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u3088\u3046\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002 \
\u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5185\u5bb9\u306f <code>amAuth.properties</code> \u30d5\u30a1\u30a4\u30eb\u3067\u6b21\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u7528\u3057\u3066\u69cb\u6210\u3055\u308c\u307e\u3059\u3002 \
<br/><ul><li><code>lockOutEmailFrom</code> : \u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e "From" \u30a2\u30c9\u30ec\u30b9</li>\
<li><code>lockOutEmailSub</code> : \u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u4ef6\u540d</li>\
<li><code>lockOutEmailMsg</code> : \u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5185\u5bb9</li></ul><br/>\
\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u308b ID \u306f\u3001\u96fb\u5b50\u30e1\u30fc\u30eb\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002<br/><br/>\
\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306b\u306a\u308a\u307e\u3059:<br/>\
<code>emailaddress|locale|charset</code> \u3002\u8907\u6570\u306e\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306e\u5834\u5408\u3001\u30b9\u30da\u30fc\u30b9\u3067\u533a\u5207\u308a\u307e\u3059\u3002<br/>\
\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306f\u3001 <code>admin@example.com</code> \u306e\u3088\u3046\u306b\u30c9\u30e1\u30a4\u30f3\u540d\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
p116=\u30e6\u30fc\u30b6\u30fc\u306b\u8b66\u544a\u3092\u51fa\u3059\u307e\u3067\u306e\u5931\u6557\u56de\u6570
p116.help=\u3053\u306e\u8a8d\u8a3c\u5931\u6557\u30ec\u30d9\u30eb\u306b\u9054\u3057\u305f\u3068\u304d\u306b\u30e6\u30fc\u30b6\u30fc\u306b\u8b66\u544a\u3057\u307e\u3059\u3002
p116.help.txt=\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u671f\u9593\u4e2d\u306b\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u8cea\u554f\u306b\u5bfe\u3057\u3066\u3053\u306e\u5931\u6557\u30ec\u30d9\u30eb\u306b\u5230\u9054\u3057\u305f\u3068\u304d\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u8b66\u544a\u304c\u4e0e\u3048\u3089\u308c\u307e\u3059\u3002\
<br/>\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u8b66\u544a\u306e\u30c6\u30ad\u30b9\u30c8\u306f <code>amAuth.properties</code> \u30d5\u30a1\u30a4\u30eb\u306e <code>lockOutWarning</code> \u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u7528\u3057\u3066\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
p117=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u5931\u6557\u306b\u3088\u308b\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u306e\u6301\u7d9a\u6642\u9593
p117.help=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u306e\u6301\u7d9a\u6642\u9593\u3001\u5206\u5358\u4f4d\u3002
p117.help.txt=OpenAM \u306f\u3001\u671f\u9593\u30920\u306b\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u306b\u3088\u308a(\u7ba1\u7406\u8005\u304c\u64cd\u4f5c\u3059\u308b\u307e\u3067)\u7121\u5236\u9650\u306b\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3057\u305f\u308a(\u30c7\u30d5\u30a9\u30eb\u30c8)\u3001\
\u307e\u305f\u306f\u4e0e\u3048\u3089\u308c\u305f\u5206\u6570\u306e\u9593\u3001\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u671f\u9593\u5f8c\u3001\u30e6\u30fc\u30b6\u30fc\u306f\u6b63\u5e38\u306b OpenAM \u8a8d\u8a3c\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
p118=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u5c5e\u6027\u540d
p118.help=\u30ab\u30b9\u30bf\u30e0\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u5c5e\u6027\u306e\u540d\u524d\u3002
p118.help.txt=OpenAM \u306f\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u3059\u308b\u3068\u3001 \u30ed\u30c3\u30af\u3055\u308c\u305f\u30a2\u30ab\u30a6\u30f3\u30c8\u306e <code>inetuserstatus</code> \u5c5e\u6027\u3092 Inactive \u306b\u8a2d\u5b9a\u3057\u307e\u3059\u3002\
\u3055\u3089\u306b\u3001OpenAM \u306f\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5185\u306e\u5225\u306e\u5c5e\u6027\u306b\u5024\u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
p119=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u5c5e\u6027\u5024
p119.help=\u30ab\u30b9\u30bf\u30e0\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u5c5e\u6027\u306b\u8a2d\u5b9a\u3059\u308b\u5024\u3002
p119.help.txt=\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u30e6\u30fc\u30b6\u30fc\u306b\u304a\u3051\u308b\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u30ab\u30b9\u30bf\u30e0\u5c5e\u6027\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u5024\u3067\u3059\u3002

favourite-restaurant=\u3088\u304f\u884c\u304f\u30ec\u30b9\u30c8\u30e9\u30f3\u306e\u540d\u524d
