#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2014 Nomura Research Institute, Ltd. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# http://forgerock.org/license/CDDLv1.0.html
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at http://forgerock.org/license/CDDLv1.0.html
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#

# Portions Copyrighted 2014 ForgeRock AS
# Portions Copyrighted 2014 Open Source Solution Technology Corporation
# Portions Copyrighted 2014 Nomura Research Institute, Ltd

device-print-service-description=\u30c7\u30d0\u30a4\u30b9\u30d7\u30ea\u30f3\u30c8
a000=\u8a8d\u8a3c\u30ec\u30d9\u30eb
a000.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a000.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u304c\u6700\u4f4e\u3067\u3059\u3002
a001=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u6709\u52b9\u671f\u9593
a001.help=\u3053\u306e\u671f\u9593\u3092\u8d85\u3048\u308b\u3068\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306f\u524a\u9664\u3055\u308c\u307e\u3059\u3002
a002=\u6700\u5927\u4fdd\u5b58\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u91cf
a002.help=\u6307\u5b9a\u3057\u305f\u91cf\u3092\u8d85\u3048\u308b\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u30ec\u30b3\u30fc\u30c9\u306b\u4fdd\u5b58\u3055\u308c\u307e\u305b\u3093\u3002
a004=\u81ea\u52d5\u7684\u306b\u65b0\u3057\u3044\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3059\u308b
a004.help=\u30e6\u30fc\u30b6\u30fc\u306e\u540c\u610f\u3092\u524d\u63d0\u3068\u3057\u3066\u65b0\u3057\u3044\u30d7\u30ed\u30d5\u30a3\u30fc\u30eb\u3092\u4fdd\u5b58\u3059\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30c1\u30a7\u30c3\u30af\u30dc\u30c3\u30af\u30b9\u3092\u9078\u629e\u3057\u307e\u3059\u3002
a004.help.txt=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u30dc\u30c3\u30af\u30b9\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30e6\u30fc\u30b6\u306b\u65b0\u3057\u3044\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3059\u308b\u305f\u3081\u306e\u30d7\u30ed\u30f3\u30d7\u30c8\u306f\u8868\u793a\u3055\u308c\u307e\u305b\u3093\u3002 OTP \u306e\u78ba\u8a8d\u304c\u6210\u529f\u3057\u305f\u5f8c\u306b\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304c\u81ea\u52d5\u7684\u306b\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002
a006=\u6301\u7d9a Cookie \u306e\u6709\u52b9\u671f\u9650(\u65e5)
a006.help=\u6301\u7d9a Cookie \u306f\u3001\u3053\u306e\u671f\u9593\u5f8c\u306b\u65b0\u3057\u3044\u3082\u306e\u306b\u7f6e\u304d\u63db\u3048\u3089\u308c\u307e\u3059\u3002
a007=\u6301\u7d9a Cookie \u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a007.help=\u73fe\u5728\u306e Cookie \u304c\u4fdd\u5b58\u3055\u308c\u305f\u30af\u30c3\u30ad\u30fc\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a007.help.txt=\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5bfe\u3057\u3066\u3001\u73fe\u5728\u306e\u5024\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u6700\u7d42\u7d50\u679c\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002 \
\u30d5\u30e9\u30c3\u30b7\u30e5\u30af\u30c3\u30ad\u30fc\u306b\u3088\u308a\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e Flash \u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u6301\u3064\u3059\u3079\u3066\u306e\u30d6\u30e9\u30a6\u30b6\u3067\u306f\u540c\u3058 Cookie \u3092\u5171\u6709\u3057\u307e\u3059\u3002 \
\u3057\u305f\u304c\u3063\u3066\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u540c\u3058\u30c7\u30d0\u30a4\u30b9\u4e0a\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b Flash \u30d7\u30e9\u30b0\u30a4\u30f3\u3092\u4ed6\u306e\u30d6\u30e9\u30a6\u30b6\u3067\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u306f\u3001 \
\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u306f\u8ffd\u52a0\u3055\u308c\u307e\u305b\u3093\u3002
a009=\u30e6\u30fc\u30b6\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a009.help=\u73fe\u5728\u306e\u30e6\u30fc\u30b6\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304c\u3001\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u30e6\u30fc\u30b6\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a009.help.txt=\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306e\u5024\u3092\u89e3\u6790\u305b\u305a\u306b\u5358\u7d14\u306b\u6bd4\u8f03\u3057\u307e\u3059\u3002\u30d6\u30e9\u30a6\u30b6\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u5909\u66f4\u3067\u3042\u3063\u3066\u3082\u3001 \
\u305d\u308c\u3092\u5909\u66f4\u3068\u5224\u5b9a\u3059\u308b\u3053\u3068\u306b\u6ce8\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5bfe\u3057\u3066\u3001\u73fe\u5728\u306e\u5024\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001 \
\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u6700\u7d42\u7d50\u679c\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a010=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b\u30d5\u30a9\u30f3\u30c8\u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a010.help=\u73fe\u5728\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b\u30d5\u30a9\u30f3\u30c8\u304c\u4fdd\u5b58\u3055\u308c\u305f\u5024\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a010.help.txt=\u3059\u3079\u3066\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b\u30d5\u30a9\u30f3\u30c8\u306e\u5c5e\u6027\u5024\u3092\u89e3\u6790\u305b\u305a\u306b\u5358\u7d14\u306b\u6bd4\u8f03\u3057\u307e\u3059\u3002\u65b0\u3057\u3044\u30d5\u30a9\u30f3\u30c8\u306e\u8ffd\u52a0\u3067\u3042\u3063\u3066\u3082\u3001 \
\u305d\u308c\u3092\u5909\u66f4\u3068\u5224\u5b9a\u3059\u308b\u3053\u3068\u306b\u6ce8\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5bfe\u3057\u3066\u3001\u73fe\u5728\u306e\u5024\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001 \
\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u6700\u7d42\u7d50\u679c\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a011=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a011.help=\u73fe\u5728\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b\u30d7\u30e9\u30b0\u30a4\u30f3\u304c\u4fdd\u5b58\u3055\u308c\u305f\u5024\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a011.help.txt=\u3059\u3079\u3066\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u5c5e\u6027\u5024\u3092\u89e3\u6790\u305b\u305a\u306b\u5358\u7d14\u306b\u6bd4\u8f03\u3057\u307e\u3059\u3002\u65b0\u3057\u3044\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u8ffd\u52a0\u3067\u3042\u3063\u3066\u3082\u3001 \
\u305d\u308c\u3092\u5909\u66f4\u3068\u5224\u5b9a\u3059\u308b\u3053\u3068\u306b\u6ce8\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5bfe\u3057\u3066\u3001\u73fe\u5728\u306e\u5024\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001 \
\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u6700\u7d42\u7d50\u679c\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a012=\u753b\u9762\u8272\u6df1\u5ea6\u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a012.help=\u73fe\u5728\u306e\u753b\u9762\u8272\u6df1\u5ea6\u304c\u4fdd\u5b58\u3055\u308c\u305f\u5024\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u8ffd\u52a0\u3055\u308c\u308b\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u3002
a012.help.txt=\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5bfe\u3057\u3066\u3001\u73fe\u5728\u306e\u5024\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u6700\u7d42\u7d50\u679c\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a013=\u753b\u9762\u89e3\u50cf\u5ea6\u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a013.help=\u73fe\u5728\u306e\u753b\u9762\u89e3\u50cf\u5ea6\u304c\u4fdd\u5b58\u3055\u308c\u305f\u5024\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u8ffd\u52a0\u3055\u308c\u308b\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u3002
a013.help.txt=\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5bfe\u3057\u3066\u3001\u73fe\u5728\u306e\u5024\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u6700\u7d42\u7d50\u679c\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a014=\u30bf\u30a4\u30e0\u30be\u30fc\u30f3\u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a014.help=\u73fe\u5728\u306e\u30bf\u30a4\u30e0\u30be\u30fc\u30f3\u304c\u4fdd\u5b58\u3055\u308c\u305f\u5024\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u8ffd\u52a0\u3055\u308c\u308b\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u3002
a014.help.txt=\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5bfe\u3057\u3066\u3001\u73fe\u5728\u306e\u5024\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u6700\u7d42\u7d50\u679c\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a015=\u8a31\u53ef\u3055\u308c\u308b\u5730\u7406\u7684\u4f4d\u7f6e\u306e\u7bc4\u56f2
a015.help=\u30de\u30a4\u30eb\u3067\u8868\u3057\u305f\u8a31\u5bb9\u7bc4\u56f2
a015.help.txt=\u30e6\u30fc\u30b6\u30fc\u306f\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u4fdd\u5b58\u3055\u308c\u305f\u5730\u70b9\u304b\u3089 X \u30de\u30a4\u30eb\u7a0b\u5ea6\u96e2\u308c\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
a016=\u30e6\u30fc\u30b6\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u5dee\u7570\u3092\u7121\u8996\u3059\u308b
a016.help=\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u9055\u3044\u3092\u6bd4\u8f03\u6642\u306b\u7121\u8996\u3059\u308b\u304b\u3069\u3046\u304b\u3002
a016.help.txt=\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u4f8b\u3048\u3070\u30d6\u30e9\u30a6\u30b6\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u7570\u306a\u308b\u3060\u3051\u3067\u3082\u4ed6\u306e\u30d6\u30e9\u30a6\u30b6\u3068\u3057\u3066\u8b58\u5225\u3055\u308c\u307e\u3059\u3002
a017=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e\u30d5\u30a9\u30f3\u30c8\u306e\u5dee\u7570\u306e\u6700\u5927\u8a31\u5bb9\u6570
a018=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e\u30d5\u30a9\u30f3\u30c8\u306e\u5dee\u7570\u306e\u6700\u5927\u8a31\u5bb9\u7387
a019=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u5dee\u7570\u306e\u6700\u5927\u8a31\u5bb9\u6570
a020=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u5dee\u7570\u306e\u6700\u5927\u8a31\u5bb9\u7387
a021=\u6301\u7d9a Cookie \u306e\u8981\u6c42
a022=\u30e6\u30fc\u30b6\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306e\u8981\u6c42
a023=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u8981\u6c42
a024=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e\u30d5\u30a9\u30f3\u30c8\u306e\u8981\u6c42
a025=\u5730\u7406\u7684\u4f4d\u7f6e\u306e\u8981\u6c42
a026=\u753b\u9762\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u8981\u6c42
a027=\u30bf\u30a4\u30e0\u30be\u30fc\u30f3\u306e\u8981\u6c42
a028=\u5730\u7406\u7684\u4f4d\u7f6e\u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a028.help=\u73fe\u5728\u306e\u5730\u7406\u7684\u4f4d\u7f6e\u304c\u4fdd\u5b58\u3055\u308c\u305f\u5024\u3068\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u8ffd\u52a0\u3055\u308c\u308b\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u3002
a028.help.txt=\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u5024\u306b\u5bfe\u3057\u3066\u3001\u73fe\u5728\u306e\u5024\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u4e00\u81f4\u3057\u306a\u3044\u5834\u5408\u306b\u3001\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u304c\u6700\u7d42\u7d50\u679c\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
a029=\u6700\u5927\u8a31\u5bb9\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8
a029.help=\u3053\u306e\u30da\u30ca\u30eb\u30c6\u30a3\u30dd\u30a4\u30f3\u30c8\u3092\u8d85\u3048\u308b\u3068\u3001\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u30c7\u30d0\u30a4\u30b9\u30d7\u30ea\u30f3\u30c8\u304c\u73fe\u5728\u306e\u30c7\u30d0\u30a4\u30b9\u30d7\u30ea\u30f3\u30c8\u3068\u306f\u4e00\u81f4\u3057\u306a\u3044\u3068\u5224\u5b9a\u3055\u308c\u307e\u3059\u3002
otpinvalid=\u5165\u529b\u3057\u305f OTP \u30b3\u30fc\u30c9\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
otpcallbackconfirmationunknown=\u672a\u77e5\u306e\u78ba\u8a8d\u306e\u9078\u629e\u80a2\u3002
invalidauthstate=\u7121\u52b9\u306a\u8a8d\u8a3c\u72b6\u614b\u3002

# HOTP Attributes
a501=SMS \u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u306e\u5b9f\u88c5\u30af\u30e9\u30b9
a501.help=\u30c7\u30d0\u30a4\u30b9\u30d7\u30ea\u30f3\u30c8  \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001SMS \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u305f\u3081\u306b\u3001\u3053\u306e\u30af\u30e9\u30b9\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a501.help.txt=SMS \u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u30af\u30e9\u30b9\u306f\u3001\u6b21\u306e\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002<br/><br/>\
<code>com.sun.identity.authentication.modules.hotp.SMSGateway</code>
a502=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u306e\u30db\u30b9\u30c8\u540d
a502.help=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u306e\u540d\u524d; OpenAM \u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u305f\u3081\u306b SMTP \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a503=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u306e\u30dd\u30fc\u30c8
a503.help=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u306e\u30dd\u30fc\u30c8\u3067\u3059\u3002
a503.help.txt=SMTP \u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30dd\u30fc\u30c8\u306f 25\u3001SSL \u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30dd\u30fc\u30c8\u306f 465 \u3067\u3059\u3002
a504=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u306e\u8a8d\u8a3c\u30e6\u30fc\u30b6\u30fc\u540d
a504.help=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u304c SMTP \u8a8d\u8a3c\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u306b\u4f7f\u7528\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u540d\u3002
a505=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u306e\u8a8d\u8a3c\u30d1\u30b9\u30ef\u30fc\u30c9
a505.help=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u304c SMTP \u8a8d\u8a3c\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u306b\u4f7f\u7528\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
a506=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u306e\u30bb\u30ad\u30e5\u30a2\u63a5\u7d9a
a506.help=\u3053\u306e\u8a2d\u5b9a\u306f\u3001\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c SSL/TLS \u3092\u4f7f\u7528\u3057\u3066\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u3068\u901a\u4fe1\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a5061=\u96fb\u5b50\u30e1\u30fc\u30eb\u306e From \u30a2\u30c9\u30ec\u30b9
a5061.help=HOTP \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304b\u3089\u306e\u30e1\u30fc\u30eb\u306f\u3053\u306e\u30a2\u30c9\u30ec\u30b9\u3067\u9001\u4fe1\u3055\u308c\u307e\u3059\u3002
a507=\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6709\u52b9\u671f\u9593
a507.help=\u3053\u306e\u671f\u9593\u5185\u3067\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u6709\u52b9\u3067\u3059(\u5206\u5358\u4f4d)\u3002
a508=\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u9577\u3055
a508.help=\u751f\u6210\u3055\u308c\u305f\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u9577\u3055(\u6841)\u3002
a509=\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u914d\u5e03
a509.help=\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u9001\u4fe1\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30e1\u30ab\u30cb\u30ba\u30e0
a510=\u643a\u5e2f\u96fb\u8a71\u756a\u53f7\u306e\u5c5e\u6027\u540d
a510.help=\u8981\u6c42\u3055\u308c\u305f\u30c6\u30ad\u30b9\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u540d\u3067\u3059\u3002
a511=\u643a\u5e2f\u96fb\u8a71\u30ad\u30e3\u30ea\u30a2\u306e\u5c5e\u6027\u540d
a511.help=\u30c6\u30ad\u30b9\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30ad\u30e3\u30ea\u30a2\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a511.help.txt=\u30b3\u30fc\u30c9\u306f\u3001\u30ad\u30e3\u30ea\u30a2\u3054\u3068\u306b\u7570\u306a\u308a\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001\u30ad\u30e3\u30ea\u30a2\u3068\u3057\u3066 Verizon \u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u3001@vtext.com \u307e\u305f\u306f vtext.com \u3092\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u5165\u529b\u3057\u307e\u3059\u3002 \
\u4f7f\u7528\u3059\u308b\u5177\u4f53\u7684\u306a\u30b3\u30fc\u30c9\u3084\u3001\u30b5\u30fc\u30d3\u30b9\u306e\u305f\u3081\u306b\u56fd\u5225\u30b3\u30fc\u30c9\u3092\u5fc5\u8981\u3068\u3059\u308b\u304b\u3069\u3046\u304b\u306b\u3064\u3044\u3066\u306f\u3001\u30ad\u30e3\u30ea\u30a2\u306b\u304a\u554f\u3044\u5408\u308f\u305b\u304f\u3060\u3055\u3044\u3002
a512=\u96fb\u5b50\u30e1\u30fc\u30eb\u306e\u5c5e\u6027\u540d
a512.help=\u30e6\u30fc\u30b6\u30fc\u306b\u96fb\u5b50\u30e1\u30fc\u30eb\u3067\u9001\u4fe1\u3059\u308b OTP \u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u540d\u3067\u3059\u3002
a520=OTP \u30b3\u30fc\u30c9\u306e\u81ea\u52d5\u9001\u4fe1
a520.help=\u81ea\u52d5\u7684\u306b OTP \u3092\u9001\u4fe1\u3059\u308b\u5834\u5408\u3001\u3053\u306e\u30c1\u30a7\u30c3\u30af\u30dc\u30c3\u30af\u30b9\u3092\u9078\u629e\u3057\u307e\u3059\u3002
ssl=SSL/TLS
nonssl=\u975e SSL/TLS
6digits=6
8digits=8
sms=SMS
email=\u96fb\u5b50\u30e1\u30fc\u30eb
both=SMS \u3068\u96fb\u5b50\u30e1\u30fc\u30eb
authFailed=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f
incorrectState=\u7121\u52b9\u306a\u72b6\u614b
messageSubject=OpenAM \u306e\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9
messageContent=OpenAM \u306e\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9:
send.failure=\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u30b3\u30fc\u30c9\u3092\u9001\u4fe1\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
send.success=\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044:
i18nTrue=true
i18nFalse=false
