#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: agentService_fr.properties,v 1.15 2009/12/26 03:53:25 cbasha Exp $
#
# Portions Copyrighted 2015 ForgeRock AS.
# Portions Copyrighted 2015 Nomura Research Institute, Ltd.

label.Empty=---VIDE----
a10=USER_ID
a11=PROFILE_ATTRIBUTE
a12=HTTP_HEADER
a13=SESSION_PROPERTY
a14=LOG_NONE
a15=LOG_ALLOW
a16=LOG_DENY
a17=LOG_BOTH
a18=DISTANT
a19=TOUS
a20=AUCUN
a21=HTTP_HEADER
a22=REQUEST_ATTRIBUTE
a23=HTTP_COOKIE
a24=LOCAL
a25=3DES
a26=AES
a27=sous-arborescence
a28=self
a29=1.3
a30=1.0
a100=Mot de passe
a100.confirm=Mot de passe (confirmation)
a101=\u00c9tat
a101.help=Statut de configuration de l\u2019agent.
a102=Actif
a103=Inactif
a105=true  
a106=false
a109=URL de notification d\u2019agent
a109.help=URL utilis\u00e9e par l\u2019agent pour enregistrer des listeners de notification. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.client.notification.url) <br>Rempla\u00e7able \u00e0 chaud\u00a0: non
a110=Emplacement du r\u00e9f\u00e9rentiel de configuration d\u2019agent
a110.help=Indique la configuration de l\u2019agent situ\u00e9e sur l\u2019h\u00f4te de l\u2019agent ou dans un emplacement central sur le serveur OpenAM.
a111=centralis\u00e9
a112=local

# J2EE Agent properties
a113=Mode Filtre d\u2019agent
a113.help=Indique le mode de fonctionnement du filtre. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.filter.mode) <br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeurs possibles\u00a0: ALL, J2EE_POLICY, URL_POLICY, SSO_ONLY, NONE <br>Pour cette propri\u00e9t\u00e9, il est possible de d\u00e9finir une valeur globale \u00e0 appliquer \u00e0 toutes les applications ne poss\u00e9dant pas de mode de filtrage sp\u00e9cifique. <br>Remplacer \u00e0 chaud\u00a0: non <br>Exemples\u00a0: <br>Pour d\u00e9finir le mode de filtrage global ALL\u00a0: ne renseignez pas le champ Cl\u00e9 de mappage, et saisissez ALL dans le champ Valeur de mappage correspondante. <br>Pour d\u00e9finir le mode de filtrage URL_POLICY pour l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et URL_POLICY dans le champ Valeur de mappage correspondante.
a114=Mode mappage d\u2019utilisateur
a114.help=Indique le m\u00e9canisme utilis\u00e9 par l\u2019agent pour d\u00e9terminer l\u2019ID utilisateur (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.user.mapping.mode) <br>Remplacer \u00e0 chaud : oui
a115=Nom d\u2019attribut d\u2019utilisateur
a115.help=Nom de l\u2019attribut contenant l\u2019ID utilisateur (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.user.attribute.name) <br>Remplacer \u00e0 chaud : oui
a116=Indicateur principal d\u2019utilisateur
a116.help=Utilisez l\u2019indicateur principal au lieu d\u2019utiliser seulement l\u2019ID utilisateur pour authentifier l\u2019utilisateur. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.user.principal) <br>Remplacer \u00e0 chaud : oui
a117=Nom de jeton d\u2019utilisateur
a117.help=Nom de propri\u00e9t\u00e9 de session pour l\u2019ID utilisateur de l\u2019utilisateur authentifi\u00e9 dans une session. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.user.token) <br>Remplacer \u00e0 chaud : oui
a118=En-t\u00eate d\u2019adresse IP client
a118.help=Nom d\u2019en-t\u00eate HTTP contenant l\u2019adresse IP du client. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.client.ip.header) <br>Remplacer \u00e0 chaud : oui
a119=En-t\u00eate de nom d\u2019h\u00f4te client
a119.help=Nom d\u2019en-t\u00eate HTTP contenant le nom d\u2019h\u00f4te du client. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.client.hostname.header) <br>Remplacer \u00e0 chaud : oui
a121=Intervalle de rechargement de configuration
a121.help=Intervalle en secondes entre des rechargements de configuration. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.load.interval) <br>Remplacer \u00e0 chaud : oui
a122=Langue 
a122.help=(nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.locale.language) <br>Remplacer \u00e0 chaud : non
a123=Pays
a123.help=(nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.locale.country) <br>Remplacer \u00e0 chaud : non
a124=Auditer les types d\u2019acc\u00e8s
a124.help=Types de message \u00e0 consigner dans un journal en fonction des tentatives d\u2019acc\u00e8s \u00e0 l\u2019URL de l\u2019utilisateur. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.audit.accesstype) <br>Remplacer \u00e0 chaud\u00a0: oui
a125=Emplacement de journal d\u2019audit
a125.help=Indique l\u2019emplacement o\u00f9 les messages d\u2019audit doivent \u00eatre consign\u00e9s. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.log.disposition) <br>Remplacer \u00e0 chaud : oui
a126=Nom de fichier journal distant
a126.help=Nom du fichier stock\u00e9 sur un serveur OpenAM et contenant les messages d\u2019audit d\u2019agent. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.remote.logfile) <br>Remplacer \u00e0 chaud : oui
a128=Journal d\u2019audit local \u00e0 rotation
a128.help=Indicateur signalant que les fichiers journaux d\u2019audit doivent effectuer une rotation lorsqu\u2019ils atteignent une taille sp\u00e9cifique. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.local.log.rotate) <br>Remplacer \u00e0 chaud : oui
a129=Taille de rotation de journal d\u2019audit local
a129.help=Limite de taille \u00e0 partir de laquelle un fichier journal effectue une rotation vers un nouveau fichier. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.local.log.size) <br>Remplacer \u00e0 chaud : oui
a131=Activation du service Web
a131.help=Cet indicateur sp\u00e9cifie si le traitement du service Web est activ\u00e9. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.webservice.enable) <Br>Remplacer \u00e0 chaud : oui
a132=Points d\u2019extr\u00e9mit\u00e9s du service Web
a132.help=Une liste des points d\u2019extr\u00e9mit\u00e9 d\u2019applications Web qui repr\u00e9sentent des services Web. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.webservice.endpoint) <br>Remplacer \u00e0 chaud : oui
a133=Activation du traitement de GET du service WEB
a133.help=Cet indicateur sp\u00e9cifie si le traitement des requ\u00eates HTTP GET pour des extr\u00e9mit\u00e9s de services Web est activ\u00e9. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.webservice.process.get.enable) <br>Remplacer \u00e0 chaud : oui
a134=Authentificateur de service Web
a134.help=Une classe d\u2019impl\u00e9mentation de l\u2019interface com.sun.identity.agents.filter.IWebServiceAuthenticator pouvant \u00eatre utilis\u00e9e pour authentifier des demandes de services Web. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.webservice.authenticator) <br>Remplacer \u00e0 chaud : oui
a134a=Processeur r\u00e9ponse du service Web
a134a.help=Une classe d\u2019impl\u00e9mentation de l\u2019interface com.sun.identity.agents.filter.IWebServiceResponseProcessor qui peut \u00eatre utilis\u00e9 pour traiter les r\u00e9ponses du service Web. (nom de propri\u00e9t\u00e9 :  com.sun.identity.agents.config.webservice.responseprocessor) <br>Remplacer \u00e0 chaud\u00a0: oui
a135=Fichier de contenu d\u2019erreur interne du service Web
a135.help= Le nom du fichier contenant les informations utilis\u00e9es par l\u2019agent pour g\u00e9n\u00e9rer une erreur interne pour les clients. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.webservice.internalerror.content) <br>Remplacer \u00e0 chaud : oui
a136=Fichier de contenu d\u2019erreur d\u2019autorisation du service Web
a136.help=Le nom du fichier contenant les informations utilis\u00e9es par l\u2019agent pour g\u00e9n\u00e9rer une erreur d\u2019autorisation pour les clients.  (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.webservice.autherror.content) <br>Remplacer \u00e0 chaud : oui
a137=L\u2019URI a refus\u00e9 l\u2019acc\u00e8s \u00e0 la ressource
a137.help=Mappage sp\u00e9cifique \u00e0 une application qui identifie l\u2019URI de la page de refus d\u2019acc\u00e8s personnalis\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.access.denied.uri) <br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeur possible\u00a0: URI de la page de refus d\u2019acc\u00e8s personnalis\u00e9e de l\u2019application. <br>Pour cette propri\u00e9t\u00e9, il est possible de d\u00e9finir une valeur globale \u00e0 appliquer \u00e0 toutes les applications ne poss\u00e9dant pas de page de refus d\u2019acc\u00e8s sp\u00e9cifique. <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br>Pour d\u00e9finir une page de refus d\u2019acc\u00e8s globale\u00a0: laissez le champ Cl\u00e9 de mappage vide et saisissez l\u2019URI de la page de refus d\u2019acc\u00e8s globale /sample/accessdenied.html dans le champ Valeur de mappage correspondante. <br> Pour d\u00e9finir l\u2019URI de la page de refus d\u2019acc\u00e8s de l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et l\u2019URI de la page de refus d\u2019acc\u00e8s de l\u2019application /BankApp/accessdenied.html dans le champ Valeur de mappage correspondante.
a138=URI de formulaire de connexion
a138.help=Liste d\u2019URI absolues correspondant \u00e0 l\u2019\u00e9l\u00e9ment de page de connexion de formulaire web.xml d\u2019une application. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.login.form) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> /BankApp/jsp/login.jsp
a139=URI d\u2019erreur de connexion
a139.help=Liste d\u2019URI absolues correspondant \u00e0 l\u2019\u00e9l\u00e9ment de page d\u2019erreur de formulaire web.xml d\u2019une application. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.login.error.uri) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> /BankApp/jsp/error.jsp
a141=Utiliser une connexion interne 
a141.help=D\u00e9finir sur False si vous voulez personnaliser le fichier Contenu de connexion par rapport au contenu interne fourni par d\u00e9faut. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.login.use.internal) <br>Remplacer \u00e0 chaud : oui
a142=Nom de fichier de contenu de connexion
a142.help=Chemin d\u2019acc\u00e8s et nom complets du fichier de contenu de connexion personnalis\u00e9. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.login.content.file) <br>Remplacer \u00e0 chaud : oui
a143=Gestionnaire d\u2019authentification personnalis\u00e9
a143.help=Gestionnaire d\u2019authentification sp\u00e9cifique \u00e0 une application pour authentifier l\u2019utilisateur connect\u00e9 au serveur d\u2019application. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.auth.handler)<br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeur possible\u00a0: nom de classe du gestionnaire d\u2019authentification. <br>Remplacer \u00e0 chaud\u00a0: oui <br>Exemple\u00a0: <br>Pour d\u00e9finir un gestionnaire d\u2019authentification pour l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et le nom de classe du gestionnaire d\u2019authentification BankAuthHandler dans le champ Valeur de mappage correspondant.
a144=Gestionnaire de d\u00e9connexion personnalis\u00e9
a144.help=Gestionnaire de d\u00e9connexion sp\u00e9cifique \u00e0 une application pour d\u00e9connecter un utilisateur du serveur d\u2019application. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.handler)  <br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeur possible\u00a0: nom de classe du gestionnaire de d\u00e9connexion. <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br>Pour d\u00e9finir un gestionnaire de d\u00e9connexion pour l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et le nom de classe du gestionnaire de d\u00e9connexion BankLogoutHandler dans le champ Valeur de mappage correspondante.
a145=Gestionnaire de v\u00e9rification personnalis\u00e9
a145.help=Gestionnaire de v\u00e9rification sp\u00e9cifique \u00e0 une application pour valider les informations d\u2019identification d\u2019utilisateur dans le r\u00e9f\u00e9rentiel local. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.verification.handler) <br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeur possible\u00a0: nom de classe du gestionnaire de v\u00e9rification. <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> Pour d\u00e9finir un gestionnaire de v\u00e9rification pour l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et le nom de classe du gestionnaire de v\u00e9rification BankVerificationHandler dans le champ Valeur de mappage correspondante.
a146=Liaison de session HTTP
a146.help=D\u00e9finie sur True, la session http n\u2019est pas valid\u00e9e lors de l\u2019\u00e9chec d\u2019une connexion, lorsque l\u2019utilisateur n\u2019a pas de session SSO ou que le nom d\u2019utilisateur principal ne correspond pas au nom d\u2019utilisateur SSO.   (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.httpsession.binding) <br>Remplacer \u00e0 chaud : oui
a147=Nom du param\u00e8tre Goto
a147.help=Propri\u00e9t\u00e9 utilis\u00e9e uniquement lorsque la connexion unique \u00e0 domaines crois\u00e9s (CDSSO) est activ\u00e9e. La valeur par d\u00e9faut doit \u00eatre chang\u00e9e seulement lorsqu\u2019une page d\u2019arriv\u00e9e est sp\u00e9cifi\u00e9e <br> pour l\u2019URL de connexion\nExemple\u00a0: \ncom.sun.identity.agents.config.cdsso.cdcservlet.url = http://host:port/opensso/cdcservlet?goto=http://agent:port/landing.jsp <br> Le param\u00e8tre est utilis\u00e9 par l\u2019Agent pour ajouter la demande d\u2019URL d\u2019origine \u00e0 cette URL cdcserlet. Ce param\u00e8tre est consomm\u00e9 par la page d\u2019arriv\u00e9e pour rediriger l\u2019URL d\u2019origine. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.redirect.param) <br>Remplacement \u00e0 chaud\u00a0: Oui <br> Exemple\u00a0: com.sun.identity.agents.config.redirect.param = goto2<br> L\u2019URL compl\u00e8te envoy\u00e9e pour authentification sera <br> http://host:port/opensso/cdcservlet?goto=http://agent:port/landing.jsp?goto2=http://agent.port/original.jsp\n\n
a148=URL de connexion OpenAM
a148.help=URL de la page de connexion OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.login.url) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> http://host:port/opensso/UI/Login
a149=URL de connexion prioritaire
a149.help=Indique si une s\u00e9quence de basculement pour les URL de connexion ou les URL CDSSO doit \u00eatre prioritaire, comme cela est d\u00e9fini dans la liste d\u2019URL de connexion OpenAM. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.login.url.prioritized) <br>Remplacer \u00e0 chaud : oui
a151=Sonde d\u2019URL de connexion
a151.help=Indique si un agent doit v\u00e9rifier la disponibilit\u00e9 de ces url avant une redirection vers ces derniers. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.login.url.probe.enabled) <br>Remplacer \u00e0 chaud : oui
a152=D\u00e9lai d\u2019expiration de sonde d\u2019URL de connexion
a152.help=Valeur, en milli-secondes, du d\u00e9lai d\u2019expiration de connexion, si la sonde d\u2019URL de connexion est aussi d\u00e9finie sur True. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.login.url.probe.timeout) <br>Remplacer \u00e0 chaud\u00a0: oui
a153=Autre nom d\u2019h\u00f4te d\u2019agent
a153.help=Nom d\u2019h\u00f4te identifiant le serveur prot\u00e9g\u00e9 par agent aupr\u00e8s des navigateurs clients, s\u2019il diff\u00e8re du nom d\u2019h\u00f4te r\u00e9el. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.agent.host) <br>Remplacer \u00e0 chaud\u00a0: oui
a154=Autre nom de port d\u2019agent
a154.help=Num\u00e9ro de port identifiant le port d\u2019\u00e9coute du serveur prot\u00e9g\u00e9 par agent aupr\u00e8s des navigateurs clients s\u2019il diff\u00e8re du port d\u2019\u00e9coute r\u00e9el. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.agent.port) <br>Remplacer \u00e0 chaud : oui
a155=Autre protocole d\u2019agent
a155.help=Protocole utilis\u00e9 (http/https) par des navigateurs clients pour communiquer avec le serveur prot\u00e9g\u00e9 par agent, s\u2019il diff\u00e8re du protocole r\u00e9el utilis\u00e9 par le serveur. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.agent.protocol) <br>Remplacer \u00e0 chaud : oui
a156=Limite de tentatives de connexion
a156.help=Limite d\u2019\u00e9checs de tentative de connexion pour une session unique de navigateur d\u2019un utilisateur avant d\u00e9clenchement du blocage de la demande d\u2019utilisateur. 0 d\u00e9sactive cette fonction. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.login.attempt.limit) <br>Remplacer \u00e0 chaud : oui
a158=Activer le cache SSO 
a158.help=Sp\u00e9cifie si le cache SSO est actif pour l\u2019agent. Le cache est utilis\u00e9 via des API publiques expos\u00e9es par le SDK de l\u2019agent. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.config.amsso.cache.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a159=R\u00e9initialisation de cookie
a159.help=L\u2019agent r\u00e9initialise des cookies dans la r\u00e9ponse avant la redirection vers l\u2019authentification. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cookie.reset.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a161=Liste de noms de r\u00e9initialisation de cookies
a161.help=Noms de cookie devant \u00eatre r\u00e9initialis\u00e9s par l\u2019agent en cas d\u2019activation de R\u00e9initialisation de cookie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cookie.reset.name) <br>Remplacer \u00e0 chaud\u00a0: oui
a162=Mappage de domaine de r\u00e9initialisation de cookies
a162.help=Mappages de noms de cookie sp\u00e9cifi\u00e9s dans la Liste de noms de r\u00e9initialisation de cookies avec une valeur correspondant au domaine du cookie \u00e0 utiliser en cas d\u2019\u00e9v\u00e9nement de r\u00e9initialisation. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cookie.reset.domain) <br>Remplacer \u00e0 chaud\u00a0: oui
a163=Mappage de chemin d \u2019acc\u00e8s de r\u00e9initialisation de cookies
a163.help=Mappages de noms de cookie sp\u00e9cifi\u00e9s dans la Liste de noms de r\u00e9initialisation de cookies avec une valeur correspondant au chemin d\u2019acc\u00e8s du cookie \u00e0 utiliser en cas d\u2019\u00e9v\u00e9nement de r\u00e9initialisation.  (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cookie.reset.path) <br>Remplacer \u00e0 chaud\u00a0: oui
a164=SSO inter-domaine
a164.help=Permet la connexion unique inter-domaine (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a165=URL de redirection CDSSO
a165.help= URI interm\u00e9diaire utilis\u00e9e par l\u2019agent pour le traitement de requ\u00eates CDSSO. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.redirect.uri) <br>Remplacer \u00e0 chaud\u00a0: oui
a166=URL de servlet CDSSO
a166.help=Liste d\u2019URL des contr\u00f4leurs CDSSO disponibles pouvant \u00eatre utilis\u00e9s par l\u2019agent pour le traitement de CDSSO. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.cdcservlet.url) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> http://host:port/opensso/cdcservlet
a167=Asym\u00e9trie d\u2019horloge CDSSO
a167.help=Dur\u00e9e, en secondes, utilis\u00e9e par l\u2019agent pour d\u00e9terminer la validit\u00e9 de l\u2019assertion CDSSO AuthnResponse. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.clock.skew) <br>Remplacer \u00e0 chaud\u00a0: oui
a168=Fournisseur d\u2019ID approuv\u00e9 CDSSO
a168.help=Liste de serveurs OpenAM/fournisseurs d\u2019ID devant \u00eatre approuv\u00e9s par l\u2019agent lors de l\u2019\u00e9valuation des r\u00e9ponses de Liberty CDC. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.trusted.id.provider) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> http://host:port/opensso/cdcservlet
a169=Activer la s\u00e9curisation CDSSO 
a169.help=Le cookie du jeton SSO d\u00e9fini par l\u2019agent dans les diff\u00e9rents domaines en mode CDSSO est alors indiqu\u00e9 comme s\u00e9curis\u00e9. Transmis uniquement si le canal des communications avec l\u2019h\u00f4te est s\u00e9curis\u00e9. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.secure.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a170=Liste de domaines CDSSO
a170.help=Domaines pour lesquels des cookies doivent \u00eatre d\u00e9finis dans un sc\u00e9nario CDSSO. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.domain) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> .sun.com
a171=Gestionnaire de d\u00e9connexion de l\u2019application
a171.help=Mappage sp\u00e9cifique \u00e0 une application qui identifie un gestionnaire \u00e0 utiliser pour le traitement de la d\u00e9connexion. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.application.handler) <br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeur possible\u00a0: nom de classe du gestionnaire de d\u00e9connexion de l\u2019application. <br>Pour cette propri\u00e9t\u00e9, il est possible de d\u00e9finir une valeur globale \u00e0 appliquer \u00e0 toutes les applications ne poss\u00e9dant pas de gestionnaire de d\u00e9connexion sp\u00e9cifique. <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br>Pour d\u00e9finir un gestionnaire de d\u00e9connexion d\u2019application global\u00a0: laissez le champ Cl\u00e9 de mappage vide et saisissez le nom de la classe du gestionnaire de d\u00e9connexion d\u2019application global GlobalApplicationLogoutHandler dans le champ Valeur de mappage correspondante. <br>Pour d\u00e9finir le gestionnaire de d\u00e9connexion de l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et le nom de la classe du gestionnaire de d\u00e9connexion de l\u2019application BankAppLogoutHandler dans le champ Valeur de mappage correspondante.
a172=URI de d\u00e9connexion de l\u2019application
a172.help=Mappage sp\u00e9cifique \u00e0 une application qui identifie un URI de demande indiquant un \u00e9v\u00e9nement de d\u00e9connexion. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.uri) <br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeur possible\u00a0: URI de d\u00e9connexion de l\u2019application. <br>Pour cette propri\u00e9t\u00e9, il est possible de d\u00e9finir une valeur globale \u00e0 appliquer \u00e0 toutes les applications ne poss\u00e9dant pas d\u2019URI de d\u00e9connexion sp\u00e9cifique. <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br>Pour d\u00e9finir un URI de d\u00e9connexion d\u2019application globale\u00a0: laissez le champ Cl\u00e9 de mappage vide et saisissez l\u2019URI de d\u00e9connexion d\u2019application globale /logout.jsp dans le champ Valeur de mappage correspondante. <br>Pour d\u00e9finir l\u2019URI de d\u00e9connexion de l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et l\u2019URI de d\u00e9connexion de l\u2019application /BankApp/logout.jsp dans le champ Valeur de mappage correspondante.
a173=Param\u00e8tre de demande de d\u00e9connexion
a173.help=Mappage sp\u00e9cifique \u00e0 une application qui identifie un param\u00e8tre qui, lorsqu\u2019il est pr\u00e9sent dans la demande HTTP, indique un \u00e9v\u00e9nement de d\u00e9connexion. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.request.param)  <br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeur possible\u00a0: param\u00e8tre de demande de d\u00e9connexion. <br>Pour cette propri\u00e9t\u00e9, il est possible de d\u00e9finir une valeur globale \u00e0 appliquer \u00e0 toutes les applications ne poss\u00e9dant pas de param\u00e8tre de demande de d\u00e9connexion sp\u00e9cifique. <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br>Pour d\u00e9finir un param\u00e8tre de demande de d\u00e9connexion d\u2019application global\u00a0: laissez le champ Cl\u00e9 de mappage vide et saisissez le param\u00e8tre de demande de d\u00e9connexion d\u2019application globale logoutparam dans le champ Valeur de mappage correspondante. <br> Pour d\u00e9finir le param\u00e8tre de demande de d\u00e9connexion de l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et le param\u00e8tre de demande de d\u00e9connexion logoutparam dans le champ Valeur de mappage correspondante.
a174=Introspection de d\u00e9connexion activ\u00e9e
a174.help=Permet \u00e0 l\u2019agent d\u2019effectuer une recherche dans le corps de la demande HTTP pour localiser un param\u00e8tre de d\u00e9connexion. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.introspect.enabled) <br>Remplacer \u00e0 chaud\u00a0: oui
a175=URI d\u2019entr\u00e9e de d\u00e9connexion
a175.help=Mappage sp\u00e9cifique \u00e0 une application qui identifie un URI \u00e0 utiliser comme point d\u2019entr\u00e9e apr\u00e8s une d\u00e9connexion r\u00e9ussie et une authentification ult\u00e9rieure r\u00e9ussie, le cas \u00e9ch\u00e9ant. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.entry.uri) <br>Cl\u00e9 valide\u00a0: nom de l\u2019application Web. <br>Valeur possible\u00a0: URI de l\u2019entr\u00e9e de d\u00e9connexion. <br>Pour cette propri\u00e9t\u00e9, il est possible de d\u00e9finir une valeur globale \u00e0 appliquer \u00e0 toutes les applications ne poss\u00e9dant pas d\u2019URI d\u2019entr\u00e9e de d\u00e9connexion sp\u00e9cifique.  <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br>Pour d\u00e9finir un URI d\u2019entr\u00e9e de d\u00e9connexion d\u2019application global\u00a0: laissez le champ Cl\u00e9 de mappage vide et saisissez l\u2019URI d\u2019entr\u00e9e de d\u00e9connexion d\u2019application global /welcome.html dans le champ Valeur de mappage correspondante. <br>Pour d\u00e9finir l\u2019URI d\u2019entr\u00e9e de d\u00e9connexion de l\u2019application BankApp\u00a0: saisissez BankApp dans le champ Cl\u00e9 de mappage et l\u2019URI d\u2019entr\u00e9e de d\u00e9connexion /BankApp/welcome.html dans le champ Valeur de mappage correspondante.
a176=V\u00e9rification FQDN
a176.help=Active \u00e0 la v\u00e9rification de la valeur fqdn par d\u00e9faut et des valeurs de mappage fqdn. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.fqdn.check.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a177=FQDN par d\u00e9faut
a177.help=Nom d\u2019h\u00f4te complet que les utilisateurs doivent utiliser pour acc\u00e9der \u00e0 des ressources. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.fqdn.default) <br>Remplacer \u00e0 chaud\u00a0: oui
a178=Mappage d\u2019h\u00f4te virtuel FQDN
a178.help=Active des h\u00f4tes virtuels, un nom d\u2019h\u00f4te partiel et une adresse IP pour acc\u00e9der \u00e0 des ressources prot\u00e9g\u00e9es. Mappe une cl\u00e9 non valide \u00e0 une valeur valide. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.fqdn.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br>  Pour mapper myserver avec myserver.mydomain.com\u00a0: saisissez myserver dans le champ Cl\u00e9 de mappage et myserver.mydomain.com dans le champ Valeur de mappage correspondante.
a179=Activer la prise en charge des agents utilisateurs h\u00e9rit\u00e9s
a179.help=Active la prise en charge d\u2019agents utilisateur h\u00e9rit\u00e9s (navigateur) (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.legacy.support.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a181=Liste des agents utilisateurs h\u00e9rit\u00e9s
a181.help=Liste de valeurs d\u2019en-t\u00eate d\u2019agent utilisateur identifiant des navigateurs h\u00e9rit\u00e9s. Les entr\u00e9es contenues dans cette liste peuvent poss\u00e9der un caract\u00e8re g\u00e9n\u00e9rique \u2019*\u2019. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.legacy.user.agent) <br>Remplacer \u00e0 chaud\u00a0: oui
a182=URI de redirection d\u2019agent utilisateur h\u00e9rit\u00e9
a182.help=URI interm\u00e9diaire utilis\u00e9 par l\u2019agent pour rediriger des demandes d\u2019agent utilisateur h\u00e9rit\u00e9es. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.legacy.redirect.uri) <br>Remplacer \u00e0 chaud\u00a0: oui
a183=En t\u00eate de r\u00e9ponse personnalis\u00e9
a183.help=Mappage sp\u00e9cifiant les en-t\u00eates personnalis\u00e9s d\u00e9finis par l\u2019agent sur le navigateur client. La cl\u00e9 correspond au nom d\u2019en-t\u00eate et la valeur repr\u00e9sente la valeur d\u2019en-t\u00eate. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.response.header) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> Pour attribuer la valeur no-cache \u00e0 l\u2019en-t\u00eate personnalis\u00e9 Cache-Control\u00a0: saisissez Cache-Control dans le champ Cl\u00e9 de mappage et no-cache dans le champ Valeur de mappage correspondante.
a184=Limite de tentatives de redirection
a184.help=Nombre de redirections de point unique successives qu\u2019un utilisateur peut effectuer \u00e0 l\u2019aide d\u2019une session de navigateur qui d\u00e9clenchera le blocage de la demande d\u2019utilisateur. Attribuez la valeur\u00a00 pour d\u00e9sactiver cette fonction. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.redirect.attempt.limit) <br>Remplacer \u00e0 chaud\u00a0: oui
a185=Activer la v\u00e9rification du port 
a185.help=Indique si la fonctionnalit\u00e9 de v\u00e9rification du port est activ\u00e9e ou d\u00e9sactiv\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.port.check.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a186=Fichier de v\u00e9rification du port 
a186.help=Nom ou chemin d\u2019acc\u00e8s complet d\u2019un fichier disposant du contenu n\u00e9cessaire requis pour g\u00e9rer des demandes n\u00e9cessitant une correction de port. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.port.check.file) <br>Remplacer \u00e0 chaud\u00a0: oui
a187=Param\u00e8tre de v\u00e9rification du port 
a187.help=Mappage de port par rapport \u00e0 des entr\u00e9es de protocole \u00e0 l\u2019aide de la cl\u00e9 correspondant au num\u00e9ro du port d\u2019\u00e9coute et d\u2019une valeur qui repr\u00e9sente le protocole d\u2019\u00e9coute que l\u2019agent doit utiliser pour identifier des demandes ayant des num\u00e9ros de port non valides. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.port.check.setting) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> Pour mapper le port 80 avec le protocole http\u00a0: saisissez 80 dans le champ Cl\u00e9 de mappage et http dans le champ Valeur de mappage correspondante.
a188=URI non appliqu\u00e9s
a188.help=Liste d\u2019URI pour lesquels la protection n\u2019est pas appliqu\u00e9e par l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.uri) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br> /BankApp/public/* <br> /BankApp/images/*
a189=Inverser les URI non appliqu\u00e9s
a189.help=Inverse la protection des URI sp\u00e9cifi\u00e9s dans la liste URI non appliqu\u00e9s D\u00e9fini sur True, indique que les URI sp\u00e9cifi\u00e9s doivent \u00eatre appliqu\u00e9s et que tous les autres URI ne doivent pas \u00eatre appliqu\u00e9s par l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.uri.invert) <br>Remplacer \u00e0 chaud\u00a0: oui
a191=URI non appliqu\u00e9s activ\u00e9s en cache
a191.help=Active la mise en cache des r\u00e9sultats d\u2019\u00e9valuation de la liste d\u2019URI non appliqu\u00e9s. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.uri.cache.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a192=Taille de cache des URI non appliqu\u00e9s
a192.help=Taille du cache \u00e0 utiliser en cas d\u2019activation des r\u00e9sultats d\u2019\u00e9valuation de la liste d\u2019URI non appliqu\u00e9s. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.uri.cache.size) <br>Remplacer \u00e0 chaud\u00a0: oui
a193=Liste d\u2019IP clients non appliqu\u00e9s
a193.help=Aucune authentification ni protection par autorisation de l\u2019agent n\u2019est requise pour les demandes provenant de ces adresses IP client. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.ip) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br> 192.18.145.* <br> 192.18.146.123
a194=Liste d\u2019inversions d\u2019IP non appliqu\u00e9s
a194.help=Adresses IP client dont la protection des adresses IP r\u00e9pertori\u00e9es dans la liste d\u2019IP clients non appliqu\u00e9s doit \u00eatre invers\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.ip.invert) <br>Remplacer \u00e0 chaud\u00a0: oui
a195=Indicateur de cache IP non appliqu\u00e9
a195.help=Activer la mise en cache de r\u00e9sultats d\u2019\u00e9valuation de liste d\u2019IP non appliqu\u00e9s. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.ip.cache.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a196=Taille de cache IP non appliqu\u00e9
a196.help=Taille du cache \u00e0 utiliser si l\u2019indicateur de cache IP non appliqu\u00e9 est activ\u00e9. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.ip.cache.size) <br>Remplacer \u00e0 chaud\u00a0: oui
a197=Caract\u00e8re de s\u00e9paration de cookie
a197.help=Caract\u00e8re devant servir \u00e0 s\u00e9parer plusieurs valeurs de m\u00eame attribut lorsque ce dernier est d\u00e9fini en tant que cookie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.attribute.cookie.separator) <br>Remplacer \u00e0 chaud\u00a0: oui
a198=Extraire le format de date d\u2019attribut
a198.help=Format des valeurs d\u2019attribut de date \u00e0 utiliser lorsque l\u2019attribut est d\u00e9fini en tant qu\u2019en-t\u00eate HTTP. Le format est bas\u00e9 sur java.text.SimpleDateFormat. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.attribute.date.format) <br>Remplacer \u00e0 chaud\u00a0: oui
a199=Coder le cookie d\u2019attribut
a199.help=Indique si l\u2019URL de la valeur d\u2019attribut doit \u00eatre cod\u00e9 avant que celui-ci soit d\u00e9fini en tant que cookie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.attribute.cookie.encode) <br>Remplacer \u00e0 chaud\u00a0: oui
a200=Actualiser le temps d\u2019inactivit\u00e9 de la session
a200.help=Indique si le temps d\u2019inactivit\u00e9 de la session opensso doit \u00eatre actualis\u00e9 ou r\u00e9initialis\u00e9 pour les URL non appliqu\u00e9s. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.refresh.session.idletime) <br>Remplacer \u00e0 chaud\u00a0: oui
a201=Mode d\u2019extraction d\u2019attribut de profil
a201.help=Mode d\u2019extraction des attributs de profil. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.profile.attribute.fetch.mode) <br>Remplacer \u00e0 chaud\u00a0: oui
a202=Mappage d\u2019attribut de profil
a202.help=Mappe les attributs de profil \u00e0 remplir sous des noms sp\u00e9cifiques pour l\u2019utilisateur authentifi\u00e9 actuel. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.profile.attribute.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> Pour d\u00e9finir la valeur d\u2019attribut de profil cn sous le nom CUSTOM-Common-Name\u00a0: saisissez cn dans le champ Cl\u00e9 de mappage et CUSTOM-Common-Name dans le champ Valeur de mappage correspondante. <br> Pour d\u00e9finir la valeur d\u2019attribut de profil mail sous le nom CUSTOM-Email\u00a0: saisissez mail dans le champ Cl\u00e9 de mappage et CUSTOM-Email dans le champ Valeur de mappage correspondante.
a203=Mode d\u2019extraction d\u2019attribut de session
a203.help=Mode d\u2019extraction des attributs de session.  (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.session.attribute.fetch.mode) <br>Remplacer \u00e0 chaud\u00a0: oui
a204=Mappage d\u2019attribut de session
a204.help=Mappe les attributs de session \u00e0 remplir sous des noms sp\u00e9cifiques pour l\u2019utilisateur authentifi\u00e9 actuel.  (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.session.attribute.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui  <br> Exemple\u00a0: <br> Pour d\u00e9finir la valeur d\u2019attribut de session UserToken sous le nom CUSTOM-userid\u00a0: saisissez UserToken dans le champ Cl\u00e9 de mappage et CUSTOM-userid dans le champ Valeur de mappage correspondante.
a205=Mode d\u2019extraction d\u2019attribut de r\u00e9ponse
a205.help=Mode d\u2019extraction des attributs de r\u00e9ponse de strat\u00e9gie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.response.attribute.fetch.mode) <br>Remplacer \u00e0 chaud\u00a0: oui
a206=Mappage d\u2019attribut de r\u00e9ponse
a206.help=Mappe les attributs de r\u00e9ponse de strat\u00e9gie \u00e0 remplir sous des noms sp\u00e9cifiques pour l\u2019utilisateur authentifi\u00e9 actuel.   (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.response.attribute.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> Pour d\u00e9finir la valeur d\u2019attribut de r\u00e9ponse uid sous le nom CUSTOM-USER-NAME\u00a0: saisissez uid dans le champ Cl\u00e9 de mappage et CUSTOM-USER-NAME dans le champ Valeur de mappage correspondante.
a207=Ignorer la liste principale
a207.help=Liste des principaux que l\u2019agent doit ignorer pour l\u2019authentification et la recherche. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.bypass.principal) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br> guest <br> testuser
a208=Attribut privil\u00e9gi\u00e9 par d\u00e9faut
a208.help=Liste des attributs privil\u00e9gi\u00e9s qui seront accord\u00e9s \u00e0 tous les utilisateurs ayant une session OpenAM valide. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.default.privileged.attribute) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> AUTHENTICATED_USERS
a209=Type d\u2019attribut privil\u00e9gi\u00e9
a209.help=Liste des types d\u2019attribut privil\u00e9gi\u00e9 devant \u00eatre extraits pour chaque utilisateur. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.privileged.attribute.type) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> Group
a211=Attributs privil\u00e9gi\u00e9s en minuscules
a211.help=Mappe les types d\u2019attribut privil\u00e9gi\u00e9 convertis en minuscules. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.privileged.attribute.tolowercase) <br> Cl\u00e9s valides\u00a0: types d\u2019attributs privil\u00e9gi\u00e9s comme Group ou Role. <br>Valeurs possibles\u00a0: true, false. <br>Remplacer \u00e0 chaud\u00a0: oui  <br> Exemple\u00a0: <br> saisissez Group dans le champ Cl\u00e9 de mappage et false dans le champ Valeur de mappage correspondante.
a212=Attribut de session privil\u00e9gi\u00e9
a212.help=Liste de noms de propri\u00e9t\u00e9 de session contenant des attributs privil\u00e9gi\u00e9s pour l\u2019utilisateur authentifi\u00e9. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.privileged.session.attribute) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> UserToken 
a213=Activer le mappage d\u2019attribut privil\u00e9gi\u00e9
a213.help=Activer le mappage entre la valeur initiale d\u2019un attribut et une autre valeur. R\u00e9pondre \u00e0 des restrictions sp\u00e9cifiques \u00e0 un conteneur sur un jeu de caract\u00e8res utilis\u00e9 dans certains fichiers de configuration. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.privileged.attribute.mapping.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a214=Mappage d\u2019attribut privil\u00e9gi\u00e9
a214.help=Mapper en cas d\u2019utilisation d\u2019Activer le mappage d\u2019attribut privil\u00e9gi\u00e9. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.privileged.attribute.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br> Pour mapper l\u2019UUID id=manager,ou=group,dc=openam,dc=openidentityplatform,dc=org avec le nom de principal am_manager_role sp\u00e9cifi\u00e9 dans le descripteur de d\u00e9ploiement de l\u2019application Web\u00a0: saisissez id=manager,ou=group,dc=openam,dc=openidentityplatform,dc=org dans le champ Cl\u00e9 de mappage et am_manager_role dans le champ Valeur de mappage correspondante. <br> Pour mapper l\u2019UUID id=employee,ou=group,dc=openam,dc=openidentityplatform,dc=org avec le nom de principal am_employee_role sp\u00e9cifi\u00e9 dans le descripteur de d\u00e9ploiement de l\u2019application Web\u00a0: saisissez id=employee,ou=group,dc=openam,dc=openidentityplatform,dc=org dans le champ Cl\u00e9 de mappage et am_employee_role dans le champ Valeur de mappage correspondante.
a215=Niveau de d\u00e9bogage d\u2019agent
a215.help=Sp\u00e9cifie le type des messages de d\u00e9bogage d\u2019agent \u00e0 consigner dans un journal. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.services.debug.level) <br>Remplacer \u00e0 chaud\u00a0: oui
a216=Nom du cookie
a216.help=Nom du cookie Jeton SSO utilis\u00e9 entre le serveur OpenAM et l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.am.cookie.name) <br>Remplacer \u00e0 chaud\u00a0: non
a218=Activer l\u2019interrogation du client
a218.help=Indique si le client de session doit utiliser l\u2019interrogation pour la mise \u00e0 jour des informations de session et ne pas d\u00e9pendre des notifications de serveurs. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.am.session.client.polling.enable) <br>Remplacer \u00e0 chaud\u00a0: non
a219=P\u00e9riode d\u2019interrogation du client
a219.help=P\u00e9riode, en secondes, apr\u00e8s laquelle le client de session demande au serveur une mise \u00e0 jour des informations de session mises en cache. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.am.session.client.polling.period) <br>Remplacer \u00e0 chaud\u00a0: non
a221=Fournisseur de chiffrement
a221.help=Indique l\u2019impl\u00e9mentation du fournisseur de chiffrement que doit utiliser l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.security.encryptor) <br>Remplacer \u00e0 chaud\u00a0: non
a222=Activer la notification des caches de donn\u00e9es utilisateur 
a222.help=Activer des notifications pour les caches amsdk et IdRepo. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.idm.remote.notification.enabled) <br>Remplacer \u00e0 chaud\u00a0: non
a223=D\u00e9lai d\u2019interrogation du cache de donn\u00e9es utilisateur 
a223.help=D\u00e9lai de mise \u00e0 jour du cache, en minutes, pour les donn\u00e9es de gestion des utilisateurs. Avec la valeur\u00a0\u20190\u2019, aucune mise \u00e0 jour n\u2019est effectu\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.am.sdk.remote.pollingTime) <br>Remplacer \u00e0 chaud\u00a0: non
a224=Activer la notification des caches de donn\u00e9es de service 
a224.help=Activer les notifications pour les caches de gestion de service. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.sm.notification.enabled) <br>Remplacer \u00e0 chaud\u00a0: non
a225=D\u00e9lai de cache des donn\u00e9es de service
a225.help=D\u00e9lai de mise \u00e0 jour du cache, en minutes, pour les donn\u00e9es de configuration de service. Avec la valeur\u00a0\u20190\u2019, aucune mise \u00e0 jour n\u2019est effectu\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.sm.cacheTime) <br>Remplacer \u00e0 chaud\u00a0: non
a229=Protocole de service d\u2019authentification OpenAM
a229.help=Protocole que doit utiliser le service d\u2019authentification OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.am.server.protocol) <br>Remplacer \u00e0 chaud\u00a0: non
a231=Nom d\u2019h\u00f4te du service d\u2019authentification OpenAM
a231.help=Nom d\u2019h\u00f4te que doit utiliser le service d\u2019authentification OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.am.server.host) <br>Remplacer \u00e0 chaud\u00a0: non
a232=Port du service d\u2019authentification OpenAM
a232.help=Port que doit utiliser le service d\u2019authentification OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.iplanet.am.server.port) <br>Remplacer \u00e0 chaud\u00a0: non
a235=Activer les notifications de strat\u00e9gie
a235.help=Activer des notifications pour le client de strat\u00e9gie distant. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.notification.enabled) <br>Remplacer \u00e0 chaud\u00a0: non
a237=Intervalle d\u2019interrogation de client de strat\u00e9gie
a237.help=Dur\u00e9e, en minutes, apr\u00e8s laquelle les entr\u00e9es mises en cache sont actualis\u00e9es par le client de strat\u00e9gie distant. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.polling.interval) <br>Remplacer \u00e0 chaud\u00a0: non
a238=Mode cache du client de strat\u00e9gie
a238.help=Mode de mise en cache que doit utiliser le client de strat\u00e9gie distant. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.policy.client.cacheMode) <br>Remplacer \u00e0 chaud\u00a0: non
a239=Valeurs d\u2019action bool\u00e9enne de client de strat\u00e9gie
a239.help=Valeurs d\u2019action bool\u00e9enne pour les noms d\u2019action de strat\u00e9gie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.policy.client.booleanActionValues) <br>Remplacer \u00e0 chaud\u00a0: non
a241=Comparateurs de ressources de client de strat\u00e9gie
a241.help=Comparateurs de ressources devant \u00eatre utilis\u00e9s pour diff\u00e9rents noms de service. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.policy.client.resourceComparators) <br>Remplacer \u00e0 chaud\u00a0: non
a242=Asym\u00e9trie d\u2019horloge de client de strat\u00e9gie
a242.help=Dur\u00e9e, en secondes, accord\u00e9e pour traiter la diff\u00e9rence de temps entre l\u2019ordinateur du serveur OpenAM et l\u2019ordinateur du client de strat\u00e9gie distant. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.policy.client.clockSkew) <br>Remplacer \u00e0 chaud\u00a0: non
a243=Param\u00e8tres Env GET de strat\u00e9gie d\u2019URL
a243.help=Liste de param\u00e8tres de demande HTTP GET dont les noms et les valeurs doivent \u00eatre d\u00e9finis dans le mappage d\u2019environnement pour l\u2019\u00e9valuation de la strat\u00e9gie d\u2019URL sur le serveur OpenAM.(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.policy.env.get.param) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> name <br> phonenumber
a244=Param\u00e8tres Env POST de strat\u00e9gie d\u2019URL
a244.help=Liste de param\u00e8tres de demande HTTP POST dont les noms et les valeurs doivent \u00eatre d\u00e9finis dans le mappage d\u2019environnement pour l\u2019\u00e9valuation de la strat\u00e9gie d\u2019URL sur le serveur OpenAM.(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.policy.env.post.param) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> name <br> phonenumber
a245=Param\u00e8tres Env jsession de strat\u00e9gie d\u2019URL
a245.help=Liste d\u2019attributs HTTP SESSION dont les noms et les valeurs doivent \u00eatre d\u00e9finis dans le mappage d\u2019environnement pour l\u2019\u00e9valuation de la strat\u00e9gie d\u2019URL sur le serveur OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.policy.env.jsession.param) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> name <br> phonenumber
a246=Notification de modification de configuration de l\u2019agent
a246.help=Permettre \u00e0 un agent de recevoir des messages de notification de la part d\u2019un serveur OpenAM pour les modifications de configuration. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.change.notification.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a247=Propri\u00e9t\u00e9s personnalis\u00e9es
a247.help=Propri\u00e9t\u00e9s suppl\u00e9mentaires permettant aux utilisateurs d\u2019accro\u00eetre l\u2019ensemble des propri\u00e9t\u00e9s prises en charge par l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.freeformproperties) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br> customproperty=custom-value1 <br> customlist[0]=customlist-value-0 <br> customlist[1]=customlist-value-1 <br> custommap[key1]=custommap-value-1 <br> custommap[key2]=custommap-value-2
a248=Authentification Web disponible 
a248.help=Permission pour que l\u2019agent fasse une authentification de programmation avec le conteneur Web JBoss en utilisant la fonctionnalit\u00e9 d\u2019authentification Web. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.jboss.webauth.available) <br>Remplacer \u00e0 chaud\u00a0: oui
a250=d\u00e9sactiv\u00e9
a251=erreur
a252=avertissement
a253=message
a254=URL de d\u00e9connexion OpenAM
a254.help=URL de la page de d\u00e9connexion de OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.url) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> http://host:port/opensso/UI/Logout
a255=URL de d\u00e9connexion par priorit\u00e9
a255.help=Indique si une s\u00e9quence de basculement pour les URL de d\u00e9connexion doit \u00eatre prioritaire, comme d\u00e9fini dans la liste d\u2019URL de connexion \u00e0 OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.url.prioritized) <br>Remplacer \u00e0 chaud\u00a0: oui
a256=Sonde d\u2019URL de d\u00e9connexion
a256.help=Indique si un agent doit v\u00e9rifier la disponibilit\u00e9 de ces url avant une redirection vers ces derniers. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.url.probe.enabled) <br>Remplacer \u00e0 chaud\u00a0: oui
a257=D\u00e9lai d\u2019expiration de sonde d\u2019URL de d\u00e9connexion
a257.help=Valeur, en millisecondes, du d\u00e9lai d\u2019expiration de connexion, si la sonde d\u2019URL de d\u00e9connexion est aussi d\u00e9finie sur True.   (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.url.probe.timeout) <br>Remplacer \u00e0 chaud\u00a0: oui


# WSS Agents properties
a301=M\u00e9canisme de s\u00e9curit\u00e9
a302=Configuration STS
a302.help=Requis si le m\u00e9canisme de s\u00e9curit\u00e9 est d\u00e9fini avec le param\u00e8tre STSSecurity
a303=Configuration de d\u00e9couverte
a303.help=Requise si le m\u00e9canisme de s\u00e9curit\u00e9 est d\u00e9fini avec le param\u00e8tre LibertyDiscoverySecurity
a304=Authentification utilisateur requise
a305=Demande sign\u00e9e activ\u00e9
a306=En-t\u00eate de la demande chiffr\u00e9
a307=Corps de la demande chiffr\u00e9
a308=Signature de la r\u00e9ponse v\u00e9rifi\u00e9e
a309=R\u00e9ponse chiffr\u00e9e
a309.help=Chiffr\u00e9 uniquement quand le corps est chiffr\u00e9.
a310=Conserver en-t\u00eates de s\u00e9curit\u00e9 dans le message
a311=Utiliser keystore par d\u00e9faut
a312=Emplacement du keystore
a313=Mot de passe du keystore
a314=Mot de passe de cl\u00e9
a315=Alias de cl\u00e9 priv\u00e9
a315.help=Cl\u00e9 pour signer la demande de service / r\u00e9ponse.
a316=Alias de cl\u00e9 publique du fournisseur de services Web
a316.help=Cl\u00e9 pour le chiffrement de la demande de services Web.
a317=Extr\u00e9mit\u00e9 du service Web
a317.help=Cette extr\u00e9mit\u00e9 est facultative, \u00e0 moins que le fournisseur de services Web ne soit configur\u00e9 pour l\u2019utilisation de jetons Liberty.
a318=Extr\u00e9mit\u00e9 proxy de la s\u00e9curit\u00e9 du service Web
a318.help=Cette extr\u00e9mit\u00e9 est facultative, \u00e0 moins d\u2019\u00eatre configur\u00e9e pour l\u2019utilisation d\u2019un proxy de s\u00e9curit\u00e9 Web.
a319=URN du type de service Liberty
a319.help=Facultatif tant que le m\u00e9canisme de s\u00e9curit\u00e9 est LibertyDiscoverySecurity.


a320=Informations d\u2019identification pour le jeton utilisateur
a321=Cha\u00eene d\u2019authentification
a322=Signature de la demande v\u00e9rifi\u00e9e
a323.title=Chiffrement de la demande activ\u00e9
a323=En-t\u00eate de la demande d\u00e9chiffr\u00e9
a323.header=En-t\u00eate
a324=Corps de la demande d\u00e9chiffr\u00e9
a324.body=Corps
a325=R\u00e9ponse sign\u00e9e activ\u00e9
a326=R\u00e9ponse chiffr\u00e9e
a326.help=Chiffr\u00e9 uniquement quand le corps est chiffr\u00e9.
a327=Type de cl\u00e9 priv\u00e9e
a328=Alias de cl\u00e9 publique du client de service Web
a328.help=Cl\u00e9 de chiffrement de la r\u00e9ponse de service Web
a329=Alias de cl\u00e9 publique du service de jeton de s\u00e9curit\u00e9
a330=Extr\u00e9mit\u00e9 du service de jeton de s\u00e9curit\u00e9
a331=Extr\u00e9mit\u00e9 MEX du service de jeton de s\u00e9curit\u00e9
a332=Extr\u00e9mit\u00e9 du service de d\u00e9couverte
a333=Extr\u00e9mit\u00e9 du service Web d\u2019authetification
a334=Mappage d\u2019attribut SAML
a335=Plug-in de mappeur d\u2019identificateur de nom SAML 
a336=Espace de noms d\u2019attributs SAML 
a337=Inclure les appartenances
a338=Serveur de domaine Kerberos
a339=Domaine Kerberos
a340=Service du Principal Kerberos
a341=Fichier de classement de cl\u00e9s Kerberos
a342=V\u00e9rifier la signature Kerberos
a342.help=Attribut facultatif qui ne doit \u00eatre activ\u00e9 que si JDK6 est utilis\u00e9.
a343=Type de conversion du jeton
a344=SSOToken
a345=SAML11Token
a346=SAML2Token

a350= Serveur de domaine Kerberos
a351= Domaine Kerberos
a352= Service du Principal Kerberos
a353= R\u00e9pertoire cache des tickets Kerberos
a354= Utiliser le jeton de s\u00e9curit\u00e9 d\u2019intercommunication
a354.help=Valide pour le client Proxy des services Web et ne s\u2019utilise que lorsque les m\u00e9canismes de s\u00e9curit\u00e9 SAML sont activ\u00e9s.
a355= Type de r\u00e9f\u00e9rence de signature.
a355.help=Cela s\u2019applique uniquement au m\u00e9canisme de s\u00e9curit\u00e9 \u00e0 jeton X509.
a356=R\u00e9f\u00e9rence directe.
a357=R\u00e9f\u00e9rence KeyIdentifier.
a358=Num\u00e9ro de s\u00e9rie de l\u2019\u00e9metteur X509
a359=Algorithme de chiffrement
a360=Niveau de chiffrement
a360.help=Niveaux de chiffrement \u00e0 utiliser\u00a0: 0, 112, 168 avec 3DES et 128, 192 ou 256 avec AES.
a361=Version de WS-Trust
a362=D\u00e9tecter une rediffusion de jetons utilisateur
a363=D\u00e9tecter une rediffusion de message
a364=Type de cl\u00e9 demand\u00e9
a365=PublicKey
a366=SymmetricKey
a367=R\u00e9clamations demand\u00e9es
a367.help=Attributs demand\u00e9s du STS pour un WSP.
a368=R\u00e9clamation DNS
a368.help=Nom DNS \u00e0 m\u00eame d\u2019identifier de mani\u00e8re unique l\u2019entit\u00e9.
a369=\u00c9l\u00e9ments sign\u00e9s

# Web Agent Properties
a400=Nom du cookie
a400.help=Nom du cookie Jeton SSO utilis\u00e9 entre le serveur OpenAM et l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cookie.name) <br>Remplacer \u00e0 chaud\u00a0: non
a401=S\u00e9curit\u00e9 du cookie
a401.help=L\u2019agent envoie des cookies s\u00e9curis\u00e9s si la communication est s\u00e9curis\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cookie.secure) <br>Remplacer \u00e0 chaud\u00a0: non
a405=Activer les notifications
a405.help=Les notifications aident \u00e0 la gestion des caches sso, de strat\u00e9gie et de configuration de l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notification.enable) <br>Remplacer \u00e0 chaud\u00a0: non
a406=URL de notification d\u2019agent
a406.help=URL utilis\u00e9e par l\u2019agent pour enregistrer des listeners de notification. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.client.notification.url) <br>Rempla\u00e7able \u00e0 chaud\u00a0: non
a407=V\u00e9rification de sensibilit\u00e9 \u00e0 la casse de la comparaison d\u2019URL
a407.help=Application du respect de la casse dans l\u2019\u00e9valuation de strat\u00e9gie et dans celle de l\u2019url non appliqu\u00e9. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.url.comparison.case.ignore) <br>Remplacer \u00e0 chaud\u00a0: oui
a408=P\u00e9riode d\u2019interrogation de cache de strat\u00e9gie
a408.help=Intervalle d\u2019interrogation, en minutes, pour actualiser le cache de la strat\u00e9gie de l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.policy.cache.polling.interval) <br>Remplacer \u00e0 chaud\u00a0: non
a409=P\u00e9riode d\u2019interrogation de cache SSO
a409.help=Intervalle d\u2019interrogation, en minutes, pour actualiser le cache sso de l\u2019agent.  (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.sso.cache.polling.interval) <br>Remplacer \u00e0 chaud\u00a0: non
a410=Param\u00e8tre ID utilisateur 
a410.help=L\u2019agent d\u00e9finit la valeur ID utilisateur par la variable REMOTE_USER. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.userid.param) <br>Remplacer \u00e0 chaud\u00a0: oui
a411=Type de param\u00e8tre ID utilisateur 
a411.help=L\u2019ID utilisateur peut \u00eatre extrait depuis les attributs SESSION et LDAP. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.userid.param.type) <br>Remplacer \u00e0 chaud\u00a0: oui
a412=Mode d\u2019extraction d\u2019attribut de profil
a412.help= (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.profile.attribute.fetch.mode) <br>Remplacer \u00e0 chaud\u00a0: oui
a413=Mappage d\u2019attribut de profil
a413.help=Mappe les attributs de profil \u00e0 remplir sous des noms sp\u00e9cifiques pour l\u2019utilisateur authentifi\u00e9 actuel. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.profile.attribute.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> Pour d\u00e9finir la valeur d\u2019attribut de profil cn sous le nom CUSTOM-Common-Name\u00a0: saisissez cn dans le champ Cl\u00e9 de mappage et CUSTOM-Common-Name dans le champ Valeur de mappage correspondante. <br> Pour d\u00e9finir la valeur d\u2019attribut de profil mail sous le nom CUSTOM-Email\u00a0: saisissez mail dans le champ Cl\u00e9 de mappage et CUSTOM-Email dans le champ Valeur de mappage correspondante.
a414=Mode d\u2019extraction d\u2019attribut de session
a414.help= (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.session.attribute.fetch.mode) <br>Remplacer \u00e0 chaud\u00a0: oui
a415=Mappage d\u2019attribut de session
a415.help=Mappe les attributs de session \u00e0 remplir sous des noms sp\u00e9cifiques pour l\u2019utilisateur authentifi\u00e9 actuel.  (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.session.attribute.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui  <br> Exemple\u00a0: <br> Pour d\u00e9finir la valeur d\u2019attribut de session UserToken sous le nom CUSTOM-userid\u00a0: saisissez UserToken dans le champ Cl\u00e9 de mappage et CUSTOM-userid dans le champ Valeur de mappage correspondante.
a416=Mode d\u2019extraction d\u2019attribut de r\u00e9ponse
a416.help= (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.response.attribute.fetch.mode) <br>Remplacer \u00e0 chaud\u00a0: oui
a417=Mappage d\u2019attribut de r\u00e9ponse
a417.help=Mappe les attributs de r\u00e9ponse de strat\u00e9gie \u00e0 remplir sous des noms sp\u00e9cifiques pour l\u2019utilisateur authentifi\u00e9 actuel.   (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.response.attribute.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> Pour d\u00e9finir la valeur d\u2019attribut de r\u00e9ponse uid sous le nom CUSTOM-USER-NAME\u00a0: saisissez uid dans le champ Cl\u00e9 de mappage et CUSTOM-USER-NAME dans le champ Valeur de mappage correspondante.
a418=S\u00e9parateur de valeurs d\u2019attributs
a418.help=Caract\u00e8re de s\u00e9paration utilis\u00e9 par les mappages d\u2019attributs de profil, de session et de r\u00e9ponse. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.attribute.multi_value_separator) <br>Remplacer \u00e0 chaud\u00a0: oui
a419=Configuration d\u2019\u00e9quilibreur de charge 
a419.help=Valeur True en cas d\u2019utilisation d\u2019un \u00e9quilibreur de charge pour les services OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.load.balancer.enable) <br>Remplacer \u00e0 chaud\u00a0: non
a420=Ignorer la v\u00e9rification de serveur
a420.help=L\u2019agent utilise cette valeur pour v\u00e9rifier que OpenAM fonctionne avant d\u2019effectuer une redirection\u00a0302. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.ignore.server.check) <br>Remplacer \u00e0 chaud\u00a0: oui
a421=Ignorer l\u2019URL d\u2019attribution de nom favori dans la demande d\u2019attribution de nom 
a421.help=L\u2019agent utilise cette valeur pour envoyer un url d\u2019attribution de nom favori dans la demande d\u2019attribution de nom. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.ignore.preferred.naming.url) <br>Remplacer \u00e0 chaud\u00a0: oui
a422=P\u00e9riode d\u2019interrogation du serveur principal 
a422.help=Intervalle, en minutes, pendant lequel l\u2019agent proc\u00e8de \u00e0 des interrogations pour v\u00e9rifier que le serveur principal fonctionne correctement. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.poll.primary.server) <br>Remplacer \u00e0 chaud\u00a0: non
a423=URL de connexion OpenAM
a423.help=URL de la page de connexion OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.login.url) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> http://host:port/opensso/UI/Login
a426=Pr\u00e9fixe d\u2019URI de d\u00e9ploiement d\u2019agent
a426.help=(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.agenturi.prefix) <br>Remplacer \u00e0 chaud\u00a0: oui
a427=Langue d\u2019agent
a427.help=Langue par d\u00e9faut du produit. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.locale) <br>Remplacer \u00e0 chaud\u00a0: non
a428=Mode SSO seul
a428.help=L\u2019agent applique simplement l\u2019authentification (SSO), mais aucune autorisation aux strat\u00e9gies. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.sso.only) <br>Remplacer \u00e0 chaud\u00a0: oui
a429=URL de refus d\u2019acc\u00e8s aux ressources
a429.help=URL de la page de refus d\u2019acc\u00e8s personnalis\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.access.denied.url) <br>Remplacer \u00e0 chaud\u00a0: oui
a430=V\u00e9rification FQDN
a430.help=Active \u00e0 la v\u00e9rification de la valeur fqdn par d\u00e9faut et des valeurs de mappage fqdn. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.fqdn.check.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a431=FQDN par d\u00e9faut
a431.help=Nom d\u2019h\u00f4te complet que les utilisateurs doivent utiliser pour acc\u00e9der \u00e0 des ressources. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.fqdn.default) <br>Remplacer \u00e0 chaud\u00a0: oui
a432=Mappage d\u2019h\u00f4te virtuel FQDN
a432.help=Active des h\u00f4tes virtuels, un nom d\u2019h\u00f4te partiel et une adresse IP pour acc\u00e9der \u00e0 des ressources prot\u00e9g\u00e9es. Mappe une cl\u00e9 non valide \u00e0 une valeur valide. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.fqdn.mapping) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br>  Pour mapper myserver avec myserver.mydomain.com\u00a0: saisissez myserver dans le champ Cl\u00e9 de mappage et myserver.mydomain.com dans le champ Valeur de mappage correspondante.
a433=R\u00e9initialisation de cookie
a433.help=L\u2019agent r\u00e9initialise des cookies dans la r\u00e9ponse avant la redirection vers l\u2019authentification. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cookie.reset.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a434=Liste de noms de r\u00e9initialisation de cookies
a434.help=Liste des cookies au format\u00a0: nom [=valeur][;Domaine=valeur]. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cookie.reset) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br> Cookie1 <br> Cookie2=value;Domain=subdomain.domain.com
a435=SSO inter-domaine
a435.help=Active la connexion unique inter-domaines. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a436=Valeur par d\u00e9faut d\u2019utilisateur anonyme
a436.help=ID utilisateur des utilisateurs non authentifi\u00e9s. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.anonymous.user.id) <br>Remplacer \u00e0 chaud\u00a0: oui
a437=Utilisateur anonyme
a437.help=Activer/d\u00e9sactiver le traitement de REMOTE_USER pour les utilisateurs anonymes. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.anonymous.user.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a438=URL non appliqu\u00e9s
a438.help=Liste des URL pour lesquels aucune authentification n\u2019est requise. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.url) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> http://agent.domaine.com/*.gif 
a439=Inverser les URL non appliqu\u00e9s
a439.help=Seule la liste d\u2019URL non appliqu\u00e9s sera appliqu\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.url.invert) <br>Remplacer \u00e0 chaud\u00a0: oui
a440=Liste d\u2019IP clients non appliqu\u00e9s
a440.help=Aucune authentification ni autorisation n\u2019est requise pour les demandes provenant de ces adresses IP client. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.ip) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br> 192.18.145.* <br> 192.18.146.123
a441=Pr\u00e9servation des donn\u00e9es du POST
a441.help=Active la pr\u00e9servation des donn\u00e9es du POST.(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.postdata.preserve.enable) <br> Vous remarquerez que cette fonction n\u2019est pas prise en charge dans tous les agents Web. Pour de plus amples d\u00e9tails, veuillez consulter la documentation des diff\u00e9rents agents. <br>Remplacer \u00e0 chaud\u00a0: oui
a442=P\u00e9riode de cache des entr\u00e9es de donn\u00e9es POST
a442.help=Dur\u00e9e de vie, en minutes, d\u2019une entr\u00e9e dans le cache POST. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.postcache.entry.lifetime) <br>Remplacer \u00e0 chaud\u00a0: oui
a443=URL de servlet CDSSO
a443.help=Liste d\u2019URL des contr\u00f4leurs CDSSO disponibles pouvant \u00eatre utilis\u00e9s par l\u2019agent pour le traitement de CDSSO. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.cdcservlet.url) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> http://host:port/opensso/cdcservlet
a444=Liste de domaines de cookies
a444.help=Liste des domaines dans lesquels des cookies doivent \u00eatre d\u00e9finis dans CDSSO. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cdsso.cookie.domain) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemple\u00a0: <br> .sun.com
a445=Validation d\u2019IP client
a445.help=Effectue une validation si les demandes de navigateur suivantes proviennent de la m\u00eame adresse IP que celle pour laquelle un jeton SSO a \u00e9t\u00e9 initialement \u00e9mis. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.client.ip.validation.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a446=Pr\u00e9fixe de cookie d\u2019attributs de profil
a446.help=D\u00e9finit un pr\u00e9fixe de cookie dans les en-t\u00eates d\u2019attributs (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.profile.attribute.cookie.prefix) <br>Remplacer \u00e0 chaud\u00a0: oui
a447=\u00c2ge maximum du cookie d\u2019attributs de profil
a447.help=\u00c2ge maximal d\u2019en-t\u00eates de cookie d\u2019attributs (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.profile.attribute.cookie.maxage) <br>Remplacer \u00e0 chaud\u00a0: oui
a448=Liste d\u2019URL de d\u00e9connexion
a448.help=Liste des URL de d\u00e9connexion d\u2019application. L\u2019utilisateur est d\u00e9connect\u00e9 de la session OpenAM lors de l\u2019acc\u00e8s \u00e0 ces URL. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.agent.logout.url). Si cette propri\u00e9t\u00e9 est utilis\u00e9e, l\u2019utilisateur devrait sp\u00e9cifier une valeur pour la propri\u00e9t\u00e9 l\u2019URL de redirection apr\u00e8s d\u00e9connexion ci-apr\u00e8s.<br>Rest\u00e9 connect\u00e9\u00a0: Oui <br> Exemple\u00a0: <br> http://myagent.mydomain.com/logout.html
a449=Liste des cookies de d\u00e9connexion \u00e0 r\u00e9initialiser
a449.help=Tout cookie devant \u00eatre r\u00e9initialis\u00e9 lors de la d\u00e9connexion selon le m\u00eame format que dans la liste de r\u00e9initialisation de cookie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.cookie.reset) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Cookie1 <br> Cookie2=value;Domain=subdomain.domain.com
a450=Extraire des strat\u00e9gies \u00e0 partir de la ressource racine
a450.help=L\u2019agent met en cache la d\u00e9cision de strat\u00e9gie de la ressource et toutes les ressources provenant de la racine de la ressource vers le bas. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.fetch.from.root.resource) <br>Remplacer \u00e0 chaud\u00a0: non
a451=R\u00e9cup\u00e9rer le nom d\u2019h\u00f4te du client 
a451.help=Obtient le nom d\u2019h\u00f4te du client via une recherche invers\u00e9e DNS \u00e0 utiliser dans l\u2019\u00e9valuation de strat\u00e9gie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.get.client.host.name) <br>Remplacer \u00e0 chaud\u00a0: oui
a452=Codage natif des attributs de profil
a452.help=L\u2019agent code les valeurs d\u2019en-t\u00eate ldap dans le codage par d\u00e9faut de la langue du syst\u00e8me d\u2019exploitation. S\u2019il est d\u00e9fini sur False, UTF-8 est utilis\u00e9. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.convert.mbyte.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a453=Coder les caract\u00e8res sp\u00e9ciaux d\u2019URL
a453.help=Code l\u2019URL poss\u00e8dant des caract\u00e8res sp\u00e9ciaux avant d\u2019effectuer une \u00e9valuation de strat\u00e9gie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.encode.url.special.chars.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a454=Ignorer les informations de chemin d\u2019acc\u00e8s dans l\u2019URL de demande 
a454.help=Les informations du chemin sont retir\u00e9es de l\u2019URL de demande lors du contr\u00f4le de liste Non appliqu\u00e9 et l\u2019\u00e9valuation de la strat\u00e9gie d\u2019url si la valeur est true. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.ignore.path.info) <br>Remplacer \u00e0 chaud\u00a0: oui
a455=Ignorer le protocole d\u2019URL de demande
a455.help=D\u00e9fini sur True si l\u2019agent se trouve derri\u00e8re un d\u00e9chargeur ssl, un \u00e9quilibreur de charge ou un proxy, (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.override.protocol) <br>Remplacer \u00e0 chaud\u00a0: oui
a456=Ignorer l\u2019h\u00f4te d\u2019URL de demande
a456.help=D\u00e9fini sur True si l\u2019agent se trouve derri\u00e8re un d\u00e9chargeur ssl, un \u00e9quilibreur de charge ou un proxy, (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.override.host) <br>Remplacer \u00e0 chaud\u00a0: oui
a457=Ignorer le port d\u2019URL de demande
a457.help=D\u00e9fini sur True si l\u2019agent se trouve derri\u00e8re un d\u00e9chargeur ssl, un \u00e9quilibreur de charge ou un proxy, (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.override.port) <br>Remplacer \u00e0 chaud\u00a0: oui
a458=Ignorer l\u2019URL de notification
a458.help=D\u00e9fini sur True si l\u2019agent se trouve derri\u00e8re un d\u00e9chargeur ssl, un \u00e9quilibreur de charge ou un proxy, (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.override.notification.url) <br>Remplacer \u00e0 chaud\u00a0: oui
a459=D\u00e9lai d\u2019expiration de connexion d\u2019agent
a459.help=D\u00e9lai d\u2019expiration, en secondes, d\u2019une connexion entre un agent et un serveur d\u2019authentification OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.auth.connection.timeout) <br>Rempla\u00e7able \u00e0 chaud\u00a0: oui
a460=P\u00e9riode d\u2019interrogation du serveur principal 
a460.help=Intervalle, en minutes, pendant lequel l\u2019agent proc\u00e8de \u00e0 des interrogations pour v\u00e9rifier que le serveur principal fonctionne correctement. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.poll.primary.server) <br>Remplacer \u00e0 chaud\u00a0: non
a461=Langue d\u2019agent
a461.help=Langue par d\u00e9faut du produit. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.locale) <br>Remplacer \u00e0 chaud\u00a0: non
a462=Ignorer l\u2019h\u00f4te et le port du serveur proxy
a462.help=(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.proxy.override.host.port) <br>Remplacer \u00e0 chaud\u00a0: non
a463=Intervalle de rechargement de configuration
a463.help=Intervalle, en minutes, pour extraire la configuration d\u2019agent de OpenAM. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.polling.interval) <br>Remplacer \u00e0 chaud\u00a0: non
a464=Intervalle de nettoyage de la configuration
a464.help=Intervalle, en minutes, de nettoyage des anciennes entr\u00e9es de configuration de l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.cleanup.interval) <br>Remplacer \u00e0 chaud\u00a0: non
a465=Propri\u00e9t\u00e9s personnalis\u00e9es
a465.help=Propri\u00e9t\u00e9s suppl\u00e9mentaires permettant aux utilisateurs d\u2019accro\u00eetre l\u2019ensemble des propri\u00e9t\u00e9s prises en charge par l\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.freeformproperties) <br>Remplacer \u00e0 chaud\u00a0: oui <br> Exemples\u00a0: <br> customproperty=custom-value1 <br> customlist[0]=customlist-value-0 <br> customlist[1]=customlist-value-1 <br> custommap[key1]=custommap-value-1 <br> custommap[key2]=custommap-value-2
a467=R\u00e9cup\u00e9ration des attributs des URL non appliqu\u00e9s
a467.help=L\u2019agent extrait des attributs de profil pour des URL non appliqu\u00e9s en effectuant une \u00e9valuation de strat\u00e9gie. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.notenforced.url.attributes.enable) <br>Remplacer \u00e0 chaud\u00a0: oui
a468=Erreur
a469=Avertissement
a470=Infos
a471=Message
a472=Tous
a473=\u00c9LEV\u00c9E
a474=FAIBLE
a475=MOYENNE
a476=PAR D\u00c9FAUT
a477=Type d\u2019authentification 
a477.help=(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.iis.auth.type) 
a478=Rediffuser une cl\u00e9 de mot de passe 
a478.help=Cl\u00e9 DES pour le d\u00e9cryptage du mot de passe d\u2019authentification de base dans la session. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.replaypasswd.key) 
a479=Priorit\u00e9 de filtre 
a479.help=Priorit\u00e9 de chargement de filtre.(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.iis.filter.priority)
a480=Filtre configur\u00e9 avec OWA  
a480.help=D\u00e9fini sur True si le filtre d\u2019agent\u00a0IIS est configur\u00e9 pour OWA.(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.iis.owa.enable)
a481=Modifier le protocole d\u2019URL par https 
a481.help=D\u00e9fini sur True, emp\u00eache l\u2019affichage de messages contextuels de s\u00e9curit\u00e9 sur IE6. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.iis.owa.enable.change.protocol) 
a482=Mettre en pause l\u2019URL de la page de d\u00e9lai d\u2019expiration de session
a482.help=URL de la page de d\u00e9lai d\u2019expiration de session de pause locale. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.iis.owa.enable.session.timeout.url)  
a483=V\u00e9rifier l\u2019utilisateur dans la base de donn\u00e9es Domino 
a483.help=D\u00e9fini sur True, l\u2019agent v\u00e9rifie l\u2019existence de l\u2019utilisateur dans la base de donn\u00e9es de noms Domino. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.domino.check.name.database) 
a484=Utiliser un jeton LTPA
a484.help=D\u00e9finir sur True si l\u2019agent n\u00e9cessite l\u2019utilisation d\u2019un jeton LTPA. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.domino.ltpa.enable)
a485=Nom de cookie de jeton LTPA
a485.help=Nom du cookie contenant le jeton LTPA. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.domino.ltpa.cookie.name) 
a486=Nom de configuration de jeton LTPA
a486.help=Nom de configuration que l\u2019agent utilise pour employer le m\u00e9canisme du jeton LTPA. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.domino.ltpa.config.name) 
a487=Nom de l\u2019organisation du jeton LTPA
a487.help=Nom de l\u2019organisation \u00e0 laquelle appartient le jeton LTPA. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.domino.ltpa.org.name)
a488=Asym\u00e9trie d\u2019horloge de strat\u00e9gie
a488.help=Dur\u00e9e, en secondes, servant \u00e0 r\u00e9gler la diff\u00e9rence de temps entre l\u2019ordinateur de l\u2019agent et OpenAM. Asym\u00e9trie d\u2019horloge en secondes = AgentTime - OpenAMServerTime. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.policy.clock.skew) <br>Remplacer \u00e0 chaud\u00a0: non
a489=Auditer les types d\u2019acc\u00e8s
a489.help=Types de message \u00e0 consigner dans un journal en fonction des tentatives d\u2019acc\u00e8s \u00e0 l\u2019URL de l\u2019utilisateur. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.audit.accesstype) <br>Remplacer \u00e0 chaud\u00a0: oui
a490=Emplacement de journal d\u2019audit
a490.help=Indique l\u2019emplacement o\u00f9 les messages d\u2019audit doivent \u00eatre consign\u00e9s. (nom de propri\u00e9t\u00e9 : com.sun.identity.agents.log.disposition) <br>Remplacer \u00e0 chaud : oui
a491=Nom du fichier journal distant 
a491.help=Nom du fichier stock\u00e9 sur un serveur OpenAM et contenant les messages d\u2019audit d\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.remote.logfile) <br>Rempla\u00e7able \u00e0 chaud\u00a0: non
a492=Intervalle du journal d\u2019audit distant
a492.help=Intervalle p\u00e9riodique en minutes d\u2019envoi des messages du journal d\u2019audit au fichier journal distant. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.remote.log.interval) <br>Remplacer \u00e0 chaud\u00a0: non
a493=Journal d\u2019audit local \u00e0 rotation
a493.help=Indicateur signalant que les fichiers journaux d\u2019audit doivent effectuer une rotation lorsqu\u2019ils atteignent une taille sp\u00e9cifique. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.local.log.rotate) <br>Remplacer \u00e0 chaud\u00a0: oui
a494=Taille de rotation de journal d\u2019audit local
a494.help=Limite de taille en octets \u00e0 partir de laquelle un fichier journal d\u2019audit local fait l\u2019objet d\u2019une rotation vers un nouveau fichier. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.local.log.size) <br>Remplacer \u00e0 chaud\u00a0: oui
a495=Niveau de d\u00e9bogage d\u2019agent
a495.help=Niveau de d\u00e9bogage d\u2019agent. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.debug.level) <br>Remplacer \u00e0 chaud\u00a0: oui
a496=Rotation du fichier de d\u00e9bogage d\u2019agent
a496.help=Le fichier de d\u00e9bogage fait l\u2019objet d\u2019une rotation en fonction de la taille sp\u00e9cifi\u00e9e. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.debug.file.rotate) <br>Remplacer \u00e0 chaud\u00a0: oui
a497=Taille du fichier de d\u00e9bogage d\u2019agent
a497.help=Taille du fichier de d\u00e9bogage d\u2019agent, en octets. (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.debug.file.size) <br>Remplacer \u00e0 chaud\u00a0: oui
a498=S\u00e9parateur de valeurs multiples d\u2019attribut 
a498.help=Sp\u00e9cifie un s\u00e9parateur pour les valeurs multiples. S\u2019applique \u00e0 tous les types d\u2019attributs (attribut de profil, de session et de r\u00e9ponse). (nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.attribute.multi.value.separator) <br>Remplacer \u00e0 chaud\u00a0: oui
a499=URL de redirection apr\u00e8s d\u00e9connexion
a499.help= Apr\u00e8s la d\u00e9connexion, l\u2019utilisateur est redirig\u00e9 vers cette URL.(nom de propri\u00e9t\u00e9\u00a0: com.sun.identity.agents.config.logout.redirect.url). Cette propri\u00e9t\u00e9 devrait \u00eatre sp\u00e9cifi\u00e9e avec la liste des URL de d\u00e9connexion ci-dessous.<br>Rest\u00e9 connect\u00e9\u00a0: Oui


# 2.2 Policy Agent properties
a500=Description
a501=Valeur(s) de cl\u00e9 d\u2019agent
a501.help=D\u00e9finir les propri\u00e9t\u00e9s de l\u2019agent avec une paire cl\u00e9/valeur. Cette propri\u00e9t\u00e9 est utilis\u00e9e par OpenAM pour recevoir de la part des agents des demandes d\u2019assertion d\u2019informations d\u2019identification sur les utilisateurs. Actuellement, une seule propri\u00e9t\u00e9 est valide et toutes les autres propri\u00e9t\u00e9s sont ignor\u00e9es. Utilisez le format suivant : <br> URLracineAgent=protocole://nomd\u2019h\u00f4te:port/ <br> L\u2019entr\u00e9e doit \u00eatre pr\u00e9cise et agentRootURL doit respecter la casse.

# Agent Authenticator properties
a600=Profils d\u2019agent autoris\u00e9s \u00e0 Lire.
a601=URL racine d\u2019agent pour CDSSO
a601.help=L\u2019URL racine d\u2019agent pour CDSSO. La valeur valide est au format suivant\u00a0:<br>protocol://hostname:port/<br> Le protocole repr\u00e9sente le protocole utilis\u00e9, tel que http ou https. nomh\u00f4te d\u00e9signe le nom d\u2019h\u00f4te de l\u2019ordinateur o\u00f9 se trouve l\u2019agent. port d\u00e9signe le num\u00e9ro de port de l\u2019ordinateur o\u00f9 est install\u00e9 l\u2019agent. La barre oblique apr\u00e8s le num\u00e9ro de port est obligatoire. 

# UI properties
wss.header.general=G\u00e9n\u00e9ral
wss.header.security=S\u00e9curit\u00e9
wss.header.signencrypt=Signature et chiffrement
wss.header.signing=Signature
wss.header.signing.Body=Corps
wss.header.signing.SecurityToken=SecurityToken
wss.header.signing.Timestamp=Horodatage
wss.header.signing.To=\u00c0
wss.header.signing.From=De
wss.header.signing.ReplyTo=ReplyTo
wss.header.signing.Action=Action
wss.header.signing.MessageID=MessageID
wss.header.encryption=Chiffrement
wss.header.keystore=Keystore
wss.header.endpoints=Extr\u00e9mit\u00e9s
wss.header.saml.configuration=Configuration de SAML
wss.header.kerberos=Configuration Kerberos
blank.header=
label.Yes=Oui
web.services.profile.username-token-header=Informations d\u2019identification pour le jeton utilisateur
label.agentgroup=Groupe
keystore.usage=Utilisation de KeyStore
keystore.usage.default=Par d\u00e9faut
keystore.usage.custom=Personnalis\u00e9
keystore.information=Emplacement du keystore (obligatoire si Utiliser keystore par d\u00e9faut n\u2019est pas coch\u00e9e).
entity.attribute.label.uuid=Identificateur universel
entity.attribute.label.identityType=Type
web.services.profile.usernametokenname=Nom
web.services.profile.usernametokenpassword=Mot de passe
