#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amLDAPv3Repo_fr.properties,v 1.11 2009/12/26 03:53:27 cbasha Exp $
#
#

0=Erreur LDAP 0 : l\u2019op\u00e9ration a r\u00e9ussi.
1=Erreur LDAP 1 : une erreur interne s\u2019est produite dans le serveur LDAP.
2=Erreur LDAP 2 : le serveur LDAP n\u2019a pas pu correctement interpr\u00e9ter la demande envoy\u00e9e par votre client car celle-ci n\u2019est pas strictement conforme au protocole LDAP.
3=Erreur LDAP 3 : la recherche n\u2019a pas pu \u00eatre achev\u00e9e dans le d\u00e9lai maximal imparti. 
4=Erreur LDAP 4 : la recherche a donn\u00e9 davantage de r\u00e9sultats que le nombre maximal admis. 
5=Erreur LDAP 5 : valeur renvoy\u00e9e par une op\u00e9ration de comparaison LDAP si l\u2019attribut et la valeur sp\u00e9cifi\u00e9s ne sont pas trouv\u00e9s dans l\u2019entr\u00e9e (aucune valeur correspondante trouv\u00e9e). 
6=Erreur LDAP 6 : valeur renvoy\u00e9e par une op\u00e9ration de comparaison LDAP si l\u2019attribut et la valeur sp\u00e9cifi\u00e9s sont trouv\u00e9s dans l\u2019entr\u00e9e (valeur correspondante trouv\u00e9e). 
7=Erreur LDAP 7 : la m\u00e9thode d\u2019authentification sp\u00e9cifi\u00e9e n\u2019est pas prise en charge par le serveur LDAP auquel vous \u00eates connect\u00e9. 
8=Erreur LDAP 8 : une m\u00e9thode d\u2019authentification plus complexe (que LDAP_AUTH_SIMPLE) est requise par le serveur LDAP auquel vous \u00eates connect\u00e9.
9=Erreur LDAP 9 : le serveur LDAP renvoie votre client vers un autre serveur LDAP et une erreur se produit lors du processus de r\u00e9f\u00e9rence.  
10=Erreur LDAP 10 : le serveur ne contient pas l\u2019entr\u00e9e demand\u00e9e. 
11=Erreur LDAP 11 : la limite administrative du nombre maximal d\u2019entr\u00e9es \u00e0 renvoyer a \u00e9t\u00e9 d\u00e9pass\u00e9e. 
12=Erreur LDAP 12 : le serveur a re\u00e7u une commande LDAP v3 marqu\u00e9e comme critique et (1) qui n\u2019est pas reconnue ou prise en charge par le serveur ou (2) qui n\u2019est pas appropri\u00e9e pour l\u2019op\u00e9ration demand\u00e9e. 
13=Erreur LDAP 13 : une connexion s\u00e9curis\u00e9e est requise pour cette op\u00e9ration.
14=Erreur LDAP 14 : association SASL en cours.
15=Erreur LDAP 15 : 
16=Erreur LDAP 16 : l\u2019attribut sp\u00e9cifi\u00e9 est introuvable.
17=Erreur LDAP 17 : l\u2019attribut sp\u00e9cifi\u00e9 n\u2019est pas d\u00e9fini.
18=Erreur LDAP 18 : un type non appropri\u00e9 de mise en correspondance a \u00e9t\u00e9 utilis\u00e9.
19=Erreur LDAP 19 : une erreur interne s\u2019est produite dans le serveur LDAP.
20=Erreur LDAP 20 : la valeur que vous ajoutez \u00e0 un attribut existe d\u00e9j\u00e0 pour cet attribut.
21=Erreur LDAP 21 : la syntaxe de la demande est incorrecte.
22=Erreur LDAP : 22
23=Erreur LDAP : 23
24=Erreur LDAP : 24
25=Erreur LDAP : 25
26=Erreur LDAP : 26
27=Erreur LDAP : 27
28=Erreur LDAP : 28
29=Erreur LDAP : 29
30=Erreur LDAP : 30
31=Erreur LDAP : 31
32=Erreur LDAP 32 : l\u2019entr\u00e9e sp\u00e9cifi\u00e9e dans la demande n\u2019existe pas.
33=Erreur LDAP 33 : un probl\u00e8me s\u2019est produit avec un alias.
34=Erreur LDAP 34 : le DN (nom distinctif) sp\u00e9cifi\u00e9 utilise une syntaxe incorrecte.
35=Erreur LDAP 35 : l\u2019entr\u00e9e sp\u00e9cifi\u00e9e est une entr\u00e9e "feuille".
36=Erreur LDAP 36 : erreur lors de l\u2019annulation du r\u00e9f\u00e9rencement d\u2019un alias.
37=Erreur LDAP : 37
38=Erreur LDAP : 38
39=Erreur LDAP : 39
40=Erreur LDAP : 40
41=Erreur LDAP : 41
42=Erreur LDAP : 42
43=Erreur LDAP : 43
44=Erreur LDAP : 44
45=Erreur LDAP : 45
46=Erreur LDAP : 46
47=Erreur LDAP : 47
48=Erreur LDAP 48 : l\u2019authentification pr\u00e9sent\u00e9e au serveur n\u2019est pas appropri\u00e9e.
49=Erreur LDAP 49 : les informations d\u2019identification pr\u00e9sent\u00e9es au serveur pour l\u2019authentification ne sont pas correctes.
50=Erreur LDAP 50 : le client est authentifi\u00e9 en tant qu\u2019utilisateur ne disposant pas des droits d\u2019acc\u00e8s n\u00e9cessaires pour r\u00e9aliser cette op\u00e9ration.
51=Erreur LDAP 51 : le serveur LDAP est occup\u00e9.
52=Erreur LDAP 52 : le serveur LDAP n\u2019est pas disponible.
53=Erreur LDAP 53 : le serveur LDAP ne peut pas effectuer l\u2019op\u00e9ration sp\u00e9cifi\u00e9e.
54=Erreur LDAP 54 : une boucle a \u00e9t\u00e9 d\u00e9tect\u00e9e.
56=Erreur LDAP : 56
57=Erreur LDAP : 57
58=Erreur LDAP : 58
59=Erreur LDAP : 59
60=Erreur LDAP 60 : la commande "server-side sorting" n\u2019a pas \u00e9t\u00e9 int\u00e9gr\u00e9e \u00e0 la commande "virtual list view" dans la demande de recherche.
61=Erreur LDAP 61 : une erreur de plage d\u2019index s\u2019est produite.
62=Erreur LDAP : 62
63=Erreur LDAP : 63
64=Erreur LDAP 64 : un probl\u00e8me de d\u00e9nomination s\u2019est produit.
65=Erreur LDAP 65 : l\u2019op\u00e9ration demand\u00e9e ajoutera ou modifiera des donn\u00e9es, qui ne seront alors plus en conformit\u00e9 avec le sch\u00e9ma.
66=Erreur LDAP 66 : l\u2019op\u00e9ration demand\u00e9e ne peut \u00eatre effectu\u00e9e que sur une entr\u00e9e n\u2019ayant aucune entr\u00e9e au niveau inf\u00e9rieur dans l\u2019arborescence (soit une entr\u00e9e "feuille").
67=Erreur LDAP 67 : l\u2019op\u00e9ration sp\u00e9cifi\u00e9e ne peut pas \u00eatre ex\u00e9cut\u00e9e sur un nom relatif distinctif (NRD).
68=Erreur LDAP 68 : l\u2019entr\u00e9e sp\u00e9cifi\u00e9e existe d\u00e9j\u00e0.
69=Erreur LDAP 69 : vous ne pouvez pas modifier la classe d\u2019objet sp\u00e9cifi\u00e9e.
70=Erreur LDAP : 70
71=Erreur LDAP 71 : le client a tent\u00e9 de d\u00e9placer une entr\u00e9e d\u2019un serveur LDAP vers un autre en demandant une op\u00e9ration "modify DN".
72=Erreur LDAP : 72
73=Erreur LDAP : 73
74=Erreur LDAP : 74
75=Erreur LDAP : 75
76=Erreur LDAP : 76
77=Erreur LDAP : 77
78=Erreur LDAP : 78
79=Erreur LDAP : 79
80=Erreur LDAP 80 : code de r\u00e9sultat g\u00e9n\u00e9ral pour les autres types d\u2019erreur pouvant survenir.
81=Erreur LDAP 81 : le serveur LDAP ne peut pas \u00eatre contact\u00e9.
82=Erreur LDAP : 82
83=Erreur LDAP : 83
84=Erreur LDAP : 84
85=Erreur LDAP 85 : l\u2019op\u00e9ration n\u2019a pas pu \u00eatre achev\u00e9e dans le d\u00e9lai maximal imparti.
86=Erreur LDAP : 86
87=Erreur LDAP : 87
88=Erreur LDAP : 88
89=Erreur LDAP 89 : lors de l\u2019appel d\u2019un constructeur ou d\u2019une m\u00e9thode \u00e0 partir de votre client, un ou plusieurs param\u00e8tres n\u2019ont pas \u00e9t\u00e9 correctement sp\u00e9cifi\u00e9s.
90=Erreur LDAP : 90
91=Erreur LDAP 91 : votre client LDAP n\u2019a pas pu se connecter au serveur LDAP.
92=Erreur LDAP 92 : la demande n\u2019est pas prise en charge par cette version du protocole LDAP.
93=Erreur LDAP 93 : la commande demand\u00e9e est introuvable. 
94=Erreur LDAP 94 : aucun r\u00e9sultat renvoy\u00e9 par le serveur.
95=Erreur LDAP 95 : davantage de r\u00e9sultats renvoy\u00e9s par le serveur.
96=Erreur LDAP 96 : votre client LDAP a d\u00e9tect\u00e9 une boucle dans l\u2019instruction.
97=Erreur LDAP 97 : le nombre d\u2019instructions s\u00e9quentielles (par exemple, le client peut \u00eatre d\u2019abord renvoy\u00e9 d\u2019un serveur LDAP A vers un serveur LDAP B, puis d\u2019un serveur LDAP B vers un serveur LDAP C, etc.) d\u00e9passe le nombre maximal d\u2019instructions admis.
