#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amPasswordResetModuleMsgs_fr.properties,v 1.12 2009/12/26 03:53:27 cbasha Exp $
#
#

pwResetSuccess.title=Confirmation de r\u00e9initialisation du mot de passe
pwConsole.title=OpenAM (r\u00e9initialisation du mot de passe)
userValidate.title=Validation de l\u2019utilisateur pour la r\u00e9initialisation du mot de passe
pwQuestion.title=Question concernant le mot de passe de {0}

#
# buttons
#
next.button=Suivant
previous.button=Pr\u00e9c\u00e9dent
ok.button=OK

#
# message titles
#
error.title=Erreur
invalidURL.title=URL incorrecte
uncaughtException.title=Erreur

#
# message and error
#
userNotExists.message=Le mot de passe de cet utilisateur ne peut pas \u00eatre r\u00e9initialis\u00e9.
logUserNotExists.message=Tentative de r\u00e9initialisation du mot de passe d\u2019un utilisateur non valide, {0}.
multipleUsersExists.message=Plusieurs utilisateurs correspondent \u00e0 la valeur indiqu\u00e9e. Entrez-en une autre ou demandez conseil \u00e0 votre administrateur.
passResetError.message=Impossible de changer le mot de passe. Contactez votre administrateur pour obtenir de l\u2019aide.
emailNotify.message=Un message indiquant votre nouveau mot de passe a \u00e9t\u00e9 envoy\u00e9 \u00e0 votre compte.
wrongAnswer.message=R\u00e9ponse incorrecte.
resetPassMail.message=Votre mot de passe OpenAM a \u00e9t\u00e9 modifi\u00e9, le nouveau est\u00a0: {0}
noQuestions.message=Aucune question n\u2019a \u00e9t\u00e9 configur\u00e9e pour vous.
noAnswers.message=Aucune r\u00e9ponse aux questions secr\u00e8tes n\u2019a \u00e9t\u00e9 d\u00e9finie.
attemptEmail.message=Une tentative de r\u00e9initialisation du mot de passe a \u00e9t\u00e9 effectu\u00e9e. Si vous n\u2019en \u00eates pas l\u2019instigateur, contactez votre administrateur.
resetSubject.message=R\u00e9initialisation du mot de passe OpenAM
attemptSubject.message=R\u00e9initialisation du mot de passe OpenAM
pwResetDisabled.message=Le service de r\u00e9initialisation du mot de passe est actuellement d\u00e9sactiv\u00e9. Contactez votre administrateur.
missingUserAttr.message=Entrez une valeur.
missingAnswer.message=Tous les champs doivent \u00eatre remplis.
invalidURL.message=L\u2019URL entr\u00e9e n\u2019est pas valide.
uncaughtException.message=Une erreur s\u2019est produite lors du traitement de la demande. Contactez votre administrateur.
noEmail.message=Nous ne sommes pas en mesure de vous envoyer le mot de passe. Contactez votre administrateur.
userNotActive.message=Utilisateur inactif. Contactez votre administrateur.
userAccountExpired.message=Le compte utilisateur est arriv\u00e9 \u00e0 expiration. Contactez votre administrateur.
sendEmailFailed.message=Votre mot de passe a \u00e9t\u00e9 r\u00e9initialis\u00e9 mais nous ne sommes pas en mesure de vous l\u2019envoyer. Contactez votre administrateur.

#
# labels
#
fromAddress.label=<Mot de passe-administrateur>
sunLogo.label=Logo Sun Microsystems
product.label=OpenAM
javaLogo.label=Logiciel Sun Java System

#
# copyright text
#
copyright.text=Copyright \u00a9 2008 Sun Microsystems, Inc.  Tous droits r\u00e9serv\u00e9s.  Sun Microsystems, Inc. d\u00e9tient les droits de propriete intellectuels relatifs \u00e0 la technologie incorpor\u00e9e dans le produit d\u00e9crit dans ce document. En particulier, et ce sans limitation, ces droits de propri\u00e9t\u00e9 intellectuelle peuvent inclure un ou plusieurs des brevets am\u00e9ricains r\u00e9pertori\u00e9s \u00e0 l\u2019adresse http://www.sun.com/patents, et un ou plusieurs brevets suppl\u00e9mentaires ou demandes de brevet en instance aux \u00c9tats-Unis et dans d\u2019autres pays. Soumis \u00e0 la l\u00e9gislation am\u00e9ricaine - Logiciel commercial.  Les utilisateurs gouvernementaux sont soumis au contrat de licence standard de Sun Microsystems, Inc. et aux dispositions applicables du FAR et de ses compl\u00e9ments.    L\u2019utilisation est soumise \u00e0 des conditions de licence.  Cette distribution peut comprendre des composants d\u00e9velopp\u00e9s par des tiers. Sun, Sun Microsystems et le logo Sun sont des marques de fabrique ou des marques d\u00e9pos\u00e9es de Sun Microsystems, Inc. aux \u00c9tats-Unis et dans d\u2019autres pays.&nbsp;   &nbsp; &nbsp; &nbsp;  &nbsp;    &nbsp;  &nbsp; &nbsp;

################################################################################
#
# logging messages
#
accountInactive.message=Le compte de l\u2019utilisateur {0} est inactif.
accountExpired.message=Le compte de l\u2019utilisateur {0} est arriv\u00e9 \u00e0 expiration.
accountLocked.message=Le compte de l\u2019utilisateur {0} est verrouill\u00e9.
accountLockout.message=La r\u00e9initialisation du mot de passe de {0} a \u00e9t\u00e9 d\u00e9sactiv\u00e9e en raison de plusieurs \u00e9checs successifs de r\u00e9initialisation.
pwResetSuccess.message=Mot de passe de l\u2019utilisateur {0} modifi\u00e9.
pwResetFail.message=\u00c9chec de la tentative de r\u00e9initialisation du mot de passe de l\u2019utilisateur {0}.

################################################################################
#
# Password Reset lockout messages
#
lockOutEmailFrom=<Mot de passe-administrateur>
lockOutEmailSub=AVERTISSEMENT : avis de verrouillage de la r\u00e9initialisation de mot de passe
lockoutMsg.message=La r\u00e9initialisation du mot de passe de ce compte a \u00e9t\u00e9 d\u00e9sactiv\u00e9e en raison de plusieurs \u00e9checs successifs de r\u00e9initialisation.
lockOutEmailMsg=La r\u00e9initialisation du mot de passe de {0} a \u00e9t\u00e9 d\u00e9sactiv\u00e9e en raison de plusieurs \u00e9checs successifs de r\u00e9initialisation.
lockoutWarning.message=R\u00e9ponse incorrecte. Le verrouillage sera effectu\u00e9 apr\u00e8s {0} \u00e9chec(s) de r\u00e9ponse.
