/**
 * NE MODIFIEZ PAS ET NE SUPPRIMEZ PAS LES MENTIONS DE COPYRIGHT OU CET EN-T\u00caTE.
 *
 * Copyright (c) 2009 Sun Microsystems Inc. Tous droits r\u00e9serv\u00e9s.
 *
 * Le contenu de ce fichier est soumis aux conditions
 * de la Common Development and Distribution License
 * (la Licence). Vous n\u2019\u00eates pas autoris\u00e9 \u00e0 utiliser ce fichier sauf dans le
 * cadre de la Licence.
 *
 * Vous pouvez obtenir une copie de la Licence \u00e0 l\u2019adresse
 * https://opensso.dev.java.net/public/CDDLv1.0.html ou
 * opensso/legal/CDDLv1.0.txt
 * Consultez la Licence pour en savoir plus sur les permissions et
 * les limitations sp\u00e9cifiques r\u00e9gissant les langues dans le cadre de la License.
 *
 * Lors de la distribution du code couvert, incluez cet
 * mention d\u2019en-t\u00eate CDDL dans chaque fichier, ainsi que le fichier License
 * dans opensso/legal/CDDLv1.0.txt.
 * Le cas \u00e9ch\u00e9ant, ajoutez ce qui suit sous l\u2019en-t\u00eate CDDL,
 * en rempla\u00e7ant les champs entre crochets [] par
 * vos propres informations d\u2019identification :
 * "Parties prot\u00e9g\u00e9es par copyright [ann\u00e9e] [nom du d\u00e9tenteur du copyright]"
 *
 * $Id: EntitlementException_fr.properties,v 1.1 2009/12/26 03:53:25 cbasha Exp $
 */

1=Impossible de cr\u00e9er un nouvelle instance du privil\u00e8ge.
2=Impossible de cr\u00e9er un nouvelle instance du privil\u00e8ge car la classe d\u2019impl\u00e9mentation du privil\u00e8ge est absente.
3=Le nom du privil\u00e8ge ne peut pas \u00eatre vide.
4=L\u2019habilitation ne peut pas \u00eatre null.
5=Op\u00e9ration non prise en charge
6=La classe Application ne peut pas \u00eatre instanci\u00e9e.
7=XML ne peut pas \u00eatre analys\u00e9.
8=L\u2019emplacement WSDL {0} n\u2019est pas valide.

10=La session est non valide ou a expir\u00e9. Cela se produit en g\u00e9n\u00e9ral lorsqu\u2019une session reste inactive trop longtemps ou qu\u2019une tierce partie en annule la validit\u00e9.

50=Impossible d\u2019\u00e9crire l\u2019entr\u00e9e d\u2019index {0}.
51=Impossible de supprimer l\u2019entr\u00e9e d\u2019index {0}.
52=Impossible de lire l\u2019entr\u00e9e d\u2019index {0}.
55=Impossible de supprimer l\u2019entr\u00e9e d\u2019index {0} car le jeton de connexion unique de l\u2019administrateur est absent.
56=Impossible de lire l\u2019entr\u00e9e d\u2019index {0} car le jeton de connexion unique de l\u2019administrateur est absent.

100=L\u2019\u00e9valuation de la strat\u00e9gie a \u00e9chou\u00e9.
101=Impossible de cr\u00e9er un gestionnaire de strat\u00e9gies depuis le domaine {0}.
102=Impossible d\u2019obtenir l\u2019objet de strat\u00e9gie {0}.
103=Impossible d\u2019obtenir l\u2019objet objet {0] dans la strat\u00e9gie {1}.
104=Impossible d\u2019obtenir l\u2019objet condition {0] dans la strat\u00e9gie {1}.
105=Impossible de cr\u00e9er le privil\u00e8ge car l\u2019application {0} est introuvable dans le domaine {1}.
110=Impossible d\u2019obtenir le type d\u2019application {0}.

113=Impossible d\u2019\u00e9valuer l\u2019objet objet {0] dans la strat\u00e9gie {1}.
114=Impossible d\u2019\u00e9valuer l\u2019objet condition {0] dans la strat\u00e9gie {1}.

200=Impossible de s\u00e9rialiser l\u2019objet. 
201=Impossible de d\u00e9s\u00e9rialiser  l\u2019objet. 
202=Impossible de rendre persistante la strat\u00e9gie {0} dans le magasin de donn\u00e9es.
203=La strat\u00e9gie {0} n\u2019existe pas.
204=Impossible de r\u00e9cup\u00e9rer la strat\u00e9gie {0}.
205=Impossible de supprimer la strat\u00e9gie {0}.
206=Impossible de modifier la strat\u00e9gie {0}.
207=Impossible de rendre persistante la strat\u00e9gie {0} dans le magasin de donn\u00e9es car le jeton de connexion unique de l\u2019administrateur est absent.
208=Impossible de modifier la strat\u00e9gie {0} car le jeton de connexion unique de l\u2019administrateur est absent.
209=Impossible de r\u00e9cup\u00e9rer la strat\u00e9gie {0} car le jeton de connexion unique de l\u2019administrateur est absent.
210=Impossible d\u2019ajouter le privil\u00e8ge au magasin de donn\u00e9es. 
211=Impossible de supprimer la strat\u00e9gie {0} car le jeton de connexion unique de l\u2019administrateur est absent.
215=Impossible de rechercher des privil\u00e8ges. 
216=Impossible de rechercher des privil\u00e8ges car le jeton de connexion unique de l\u2019administrateur est absent.

220=Impossible d\u2019obtenir les noms d\u2019attribut d\u2019objet.
221=Impossible d\u2019ajouter l\u2019action \u00e0 l\u2019application.
222=Impossible d\u2019ajouter l\u2019action \u00e0 l\u2019application car l\u2019action {0} existe d\u00e9j\u00e0.
225=Impossible d\u2019obtenir les noms d\u2019attribut d\u2019objet car le jeton de connexion unique de l\u2019administrateur est absent.
226=Impossible d\u2019ajouter l\u2019action \u00e0 l\u2019application car le jeton de connexion unique de l\u2019administrateur est absent.
227=Impossible d\u2019obtenir les noms des sous-domaines.
228=L\u2019application existe d\u00e9j\u00e0
230=Impossible de supprimer l\u2019application {0}.
231=Impossible de modifier l\u2019application {0}.
240=Impossible de supprimer le type de l\u2019application {0}.
241=Impossible de modifier le type de l\u2019application {0}.
245=Impossible de supprimer le type de l\u2019application {0} car le jeton de connexion unique de l\u2019administrateur est absent.
246=Impossible de modifier le type de l\u2019application {0} car le jeton de connexion unique de l\u2019administrateur est absent.
247=Impossible d\u2019enregistrer l\u2019application {0} parce que ses ressources ne sont pas r\u00e9f\u00e9renc\u00e9es depuis un parent.
248=Impossible de r\u00e9cup\u00e9rer l\u2019application sous le domaine {0}.

250=Le nom du privil\u00e8ge Referral ne figure pas dans le privil\u00e8ge de r\u00e9f\u00e9rence.
251=Le mappage du nom de l\u2019application aux noms de ressources est absent du  privil\u00e8ge de r\u00e9f\u00e9rence.
252=Les domaines sont absents du privil\u00e8ge de r\u00e9f\u00e9rence.

260=Impossible d\u2019ajouter le privil\u00e8ge de r\u00e9f\u00e9rence car le jeton de connexion unique de l\u2019administrateur est absent.
261=Impossible d\u2019ajouter le privil\u00e8ge de r\u00e9f\u00e9rence.
262=Impossible de r\u00e9cup\u00e9rer le privil\u00e8ge de r\u00e9f\u00e9rence {0} car le jeton de connexion unique de l\u2019administrateur est absent.
263=Le privil\u00e8ge de r\u00e9f\u00e9rence {0} n\u2019existe pas.
264=Impossible de modifier le privil\u00e8ge de r\u00e9f\u00e9rence {0} car le jeton de connexion unique de l\u2019administrateur est absent.
265=Impossible de modifier le privil\u00e8ge de r\u00e9f\u00e9rence {0}.
266=Impossible de supprimer le privil\u00e8ge de r\u00e9f\u00e9rence {0} car le jeton de connexion unique de l\u2019administrateur est absent.
267=Impossible d\u2019ajouter le privil\u00e8ge de r\u00e9f\u00e9rence {0} car ses ressources ne sont pas r\u00e9f\u00e9rr\u00e9es depuis un parent.

270=Impossible d\u2019ajouter le privil\u00e8ge de r\u00e9f\u00e9rence au magasin de donn\u00e9es.
275=Impossible d\u2019obtenir la ressource de r\u00e9f\u00e9rence pour le domaine {0}.

280=Il a \u00e9t\u00e9 impossible de faire r\u00e9f\u00e9rence \u00e0 un privil\u00e8ge pour le sous-domaine {1} car l\u2019application, {2} n\u2019existait pas dans le domaine parent {0}.

285=Impossible d\u2019obtenir les noms de configuration du collecteur d\u2019attributs d\u2019objet car le jeton de connexion unique de l\u2019administrateur est absent.
286=Impossible d\u2019obtenir les noms de configuration du collecteur d\u2019attributs d\u2019objet.
287=Impossible d\u2019obtenir la configuration du collecteur d\u2019attributs d\u2019objet {0} car le jeton de connexion unique de l\u2019administrateur est absent.
288=Impossible d\u2019obtenir la configuration du collecteur d\u2019attributs d\u2019objet {0}.
289=Impossible de d\u00e9finir une configuration du collecteur d\u2019attributs d\u2019objet {0} car le jeton de connexion unique de l\u2019administrateur est absent.
290=Impossible de d\u00e9finir une configuration du collecteur d\u2019attributs d\u2019objet {0}.

300=La m\u00eame r\u00e8gle ne peut pas comporter deux types de caract\u00e8res g\u00e9n\u00e9riques.
301=Port non valide {0}
302=URL mal form\u00e9 {0}
303=Ressource non valide {0}
# TODO(jtb)
310=Classes Entitlement Subject non valides dans le privil\u00e8ge Application.

320=Pas de nom d\u2019application dans le privil\u00e8ge de d\u00e9l\u00e9gation.
321=L\u2019application {0} est introuvable.
322=Pas de ressource dans le privil\u00e8ge de d\u00e9l\u00e9gation.
323=Impossible de d\u00e9l\u00e9guer {0}.
324=Impossible de coder {0}.
325={0} introuvable.
326=Autorisation refus\u00e9e.
327=Les objets sont obligatoires.
328=Filtre de recherche incorrect {0}.

400=Valeur {1} non valide pour la propri\u00e9t\u00e9 {0}.
401=Valeur non valide {0}
402=La date de d\u00e9but, {0}, ne peut pas \u00eatre ult\u00e9rieure \u00e0 la date de fin, {1}
403=Impossible de cr\u00e9er l\u2019objet.

508=L\u2019\u00e9valuation de l\u2019objet \u00e9choue.
510=L\u2019\u00e9valuation de la condition \u00e9choue.

600=Impossible d\u2019obtenir les attributs d\u2019objet pour {0}.
601=Impossible de d\u00e9terminer si la valeur de l\u2019attribut est pr\u00e9sente pour l\u2019objet en question {0}.
602=Impossible d\u2019obtenir les noms d\u2019attribut d\u2019objet.

420=Ressource manquante dans l\u2019appel REST.
421=Identificateur d\u2019objet manquant dans l\u2019appel REST.
422=Action manquante dans l\u2019appel REST.
424=Les noms de ressources sont obligatoires.
425=Exception JSON.
426=L\u2019URL de notification est obligatoire pour le listener d\u2019habilitations.
427=Listener d\u2019habilitations de {0} introuvable.
428=Le nom de l\u2019application est requis dans le listener d\u2019habilitations.
429=Impossible de r\u00e9cup\u00e9rer les listeners du magasin de donn\u00e9es. Les donn\u00e9es des listeners semblent endommag\u00e9es.
430=Impossible de r\u00e9cup\u00e9rer les listeners du magasin de donn\u00e9es. L\u2019utilisateur admin n\u2019a pas de privil\u00e8ge de lecture.
431=Impossible d\u2019ajouter la notification car {0} n\u2019existe pas.
432=L\u2019application de d\u00e9l\u00e9gation est introuvable.
434=Impossible d\u2019authentifier la demande.

450=Impossible de rechercher des applications.
451=Impossible de rechercher des applications car le jeton de connexion unique de l\u2019administrateur est absent.

resource.validation.does.not.match.valid.resources={0} ne correspondait \u00e0 aucune ressource valide.
resource.validation.invalid.resource={0} n\u2019\u00e9tait pas valide.
