#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: libSAML_es.properties,v 1.11 2009/12/26 03:41:55 cbasha Exp $
#

onlinehelp.doc=saml.html

invalidRequestLogMessage=Solicitud no v\u00e1lida: enviando respuesta a
responseLogMessage=enviando respuesta a
requestLogMessage=Solicitud desde direcci\u00f3n IP
parseError=Error de an\u00e1lisis.
parserError=Error de analizador.
nullInput=Entrada nula.
wrongInput=Entrada err\u00f3nea.
missingAttribute=Falta el atributo.
oneElement=Debe contener exactamente un elemento.
requestVersionTooHigh=La versi\u00f3n de solicitud es demasiado alta.
requestVersionTooLow=La versi\u00f3n solicitada es demasiado baja.
assertionVersionTooHigh=La versi\u00f3n de aserci\u00f3n es demasiado alta.
assertionVersionTooLow=La versi\u00f3n de aserci\u00f3n es demasiado baja.
queryNotSupported=No se admite este tipo de consulta.
emptyElement=Elemento vac\u00edo.
moreElement=Se han incluido m\u00e1s elementos de los permitidos.
wrongAttrValue=Valor de atributo err\u00f3neo.
responseVersionTooHigh=La versi\u00f3n de respuesta es demasiado alta.
responseVersionTooLow=La versi\u00f3n de respuesta es demasiado baja.
errorCreateArtifact=No se ha podido crear AssertionArtifact.
errorCreateAssertion=No se ha podido crear aserci\u00f3n.
noDestIDMatchingArtifact=No se encuentra un id. de destino (destID) que coincida con el artefacto de entrada.
destIDNotMatch=No coincide el Id. de destino.
assertionTimeNotValid=La hora de la aserci\u00f3n no es v\u00e1lida.
missingSubjectConfirmation=Falta el elemento SubjectConfirmation.
missingConfirmationMethod=Falta el elemento ConfirmationMethod.
wrongConfirmationMethodValue=Valor de ConfirmationMethod err\u00f3neo.
missingSubjectConfirmationData=Falta el elemento SubjectConfirmationData.
wrongSubjectConfirmationData=SubjectConfirmationData err\u00f3neo.
wrongNameIdentifier=NameIdentifier err\u00f3neo.
cannotVerifySubject=No se ha podido verificar el asunto.
cannotMapSubject=No se ha podido asignar el asunto a un usuario local.
authenticationMethodInQueryNotMatch=No se ha podido encontrar una aserci\u00f3n que coincida con AuthenticationMethod en la consulta.
missingNameIdentifier=Falta el elemento NameIdentifier.
missingSubject=Falta el asunto.
errorGenerateID=No se ha podido generar Id. aleatorio.
invalidElement=La entrada contiene un elemento no v\u00e1lido.
invalidAttribute=La entrada contiene un atributo no v\u00e1lido.
missingAttributeValue=El valor del atributo est\u00e1 vac\u00edo o es nulo. 
adviceElementNotSupported=No se admite AdviceElement.
removeListError=No se pudo eliminar un objeto de la lista. 
addListError=No se pudo a\u00f1adir un objeto a la lista.
removeSetError=No se pudo eliminar un objeto del conjunto.
addSetError=No se pudo a\u00f1adir un objeto al conjunto.
invalidAction=La acci\u00f3n no es v\u00e1lida en su espacio de nombre especificado.
noElement=No se ha encontrado ning\u00fan elemento.
missingElement=Falta el elemento.
unsupportedCondition=No se admite la condici\u00f3n.
unsupportedElement=No se admite el elemento.
wrongNumberAttributes=N\u00famero de atributos transmitidos err\u00f3neo.
invalidNumber=Se ha encontrado un n\u00famero entero no v\u00e1lido.
missingBody=El mensaje no tiene cuerpo.
missingRequest=El cuerpo del mensaje no tiene solicitud.
unsupportedStatement=Las declaraciones admitidas no est\u00e1n presentes en el elemento RespondWith.
noMatchingAssertion= No se ha podido localizar una aserci\u00f3n coincidente.
unequalMatch=El n\u00famero de aserciones coincidentes no es el mismo que el n\u00famero de artefactos en la consulta.
cannotProcessRequest=No se puede procesar esta solicitud debido a un error grave del servidor.
cannotBuildResponse=La respuesta a la solicitud recibida no se puede crear debido a un error grave en el servidor.
localNameMissing=Parece que falta el nombre local de SOAPElement en SOAPMessage transmitido.
envelopeInvalid=El sobre no se ha formado correctamente o falta.
cannotVerifyIdentity=Un error interno est\u00e1 evitando que el receptor SOAP verifique la identidad del emisor.
# message for SAMLGenSourceID:
genSourceIDUsage=java SAMLGenSourceID <identificationURL>
nullSourceID=No se ha podido generar el Id. de origen.
wrongSourceIDLength=Longitud de SourceID err\u00f3nea.
wrongDateFormat=Formato de fecha err\u00f3neo.
missingStatement=La aserci\u00f3n no contiene ninguna declaraci\u00f3n.
mismatchRespondWith=La aserci\u00f3n no cumple los criterios de RespondWith en la solicitud recibida.
mismatchSourceID=Se ha encontrado un sourceID no v\u00e1lido en los artefactos enviados en la consulta.
mismatchDest=Las aserciones coincidentes encontradas no son para este solicitante.
missingTargetHost=No se pudo obtener el nombre de host de la URL de destino.
nullSSOToken=El Token SSO es nulo.
invalidSSOToken=El Token SSO no es v\u00e1lido.
wrongAuthType=Tipo de autenticaci\u00f3n no v\u00e1lido.
wrongConfigBasicAuth=Configuraci\u00f3n err\u00f3nea para autenticaci\u00f3n b\u00e1sica.
illegalFormatSOAPUrl=Formato no v\u00e1lido para URL de destinatario de SOAP.
sourceidDifferent=Distinto ID de origen contenido en los artefactos m\u00faltiples.
assertionArtifactError=No se pudo construir AssertionArtifact.
failedLocateSOAPUrl=No se pudo localizar Url de destinatario de SOAP utilizando ID de origen.
wrongPartnerSOAPUrl=Configuraci\u00f3n err\u00f3nea de URL de SOAP del socio.
failedCreateURLEndpoint=No se pudo crear URLEndpoint.
noReplyfromSOAPReceiver=No hay respuesta del destinatario de SAML SOAP.
missingSOAPEnvTag=Falta la etiqueta SOAPEnv.
missingSOAPBody=Falta SOAPBody.
missingChildTagName=Falta el nombre de la etiqueta secundaria.
wrongSOAPBody=El cuerpo de SOAP no contiene Fallo SOAP o Respuesta SAML.
wrongSOAPElement=Elemento SOAP err\u00f3neo dentro desSobre SOAP.
noSAMLResponse=Falta respuesta SAML en mensaje SOAP.
errorSAMLStatusCode=Excepci\u00f3n al obtener c\u00f3digo de estado SAML.
wrongNumberAssertions=Las aserciones en respuesta SAML no son iguales a los artefactos en la solicitud SAML.
unknownHost=Excepci\u00f3n de host desconocido lanzada en AssertionHandler.
noStatement=La aserci\u00f3n SAML no contiene ninguna declaraci\u00f3n.
nullSubjectConfirmationData=Los datos de confirmaci\u00f3n de asunto son nulos.
nullsubjectConfirmationMethod=El m\u00e9todo de confirmaci\u00f3n de asunto es nulo.
misMatchAssertion=Las aserciones devueltas no coinciden con los artefactos solicitados.
noSSOAssertion=No contiene una aserci\u00f3n SSO v\u00e1lida.
targetURL=La URL de destino es 
redirectTo=Redirigir a URL
artifactinSOAPRequest=Artefacto en Solicitud SOAP 
SOAPReceiverURL=URL de SAML SOAPReceiver es 
Artifact=Artefacto 
sendingSAMLRequest=Enviando consulta de artefacto SAML 
repliedSOAPMessage=Mensaje de respuesta de SOAP
accessGranted=Acceso a URL de destino garantizado.
targetForbidden=El sitio de destino especificado est\u00e1 prohibido.
noAssertioninResponse=No hay ninguna aserci\u00f3n en la respuesta SAML.
URLNotFoundException=URLNotFoundException
illegalNamingService=Nombre no v\u00e1lido del servicio de nombres.
missingTargetSite=Falta el par\u00e1metro TARGET en la solicitud.
nullInputParameter=El par\u00e1metro de entrada es nulo. 
untrustedSite=Se ha recibido una solicitud de un sitio en el que no se conf\u00eda.
misconfigurationError=Los datos est\u00e1n mal configurados.
soapFaultError=Error grave al formar el elemento de fallo soap.
missingSOAPMessageFactory=Falta la f\u00e1brica del mensaje SOAP.
cannotDetermineIPAddress=No se puede determinar la direcci\u00f3n IP del servidor en la SAMLUrl configurada.
missingSAMLURL=Falta SAMLUrl en la configuraci\u00f3n.
oneTarget=La aserci\u00f3n creada para el Artefacto s\u00f3lo debe contener un destino.
missingTarget=Falta el destino en la configuraci\u00f3n.
wrongAssertion=Esta aserci\u00f3n no se ha creado para este host local.
failAudienceRestrictionCondition=Error en AudienceRestrictionCondition.
assertionCreated=Aserci\u00f3n creada.
assertionArtifactCreated=Artefacto de aserci\u00f3n creado.
forAssertion=para aserci\u00f3n
assertionArtifactVerified=Artefacto de aserci\u00f3n verificado.
assertionArtifactRemoved=Artefacto de aserci\u00f3n eliminado.
assertionRemoved=Aserci\u00f3n eliminada.
errorEncodeResponse=No se ha podido codificar SAMLResponse.
errorDecodeResponse=No se ha podido decodificar la respuesta SAML (SAMLResponse).
missingSAMLResponse=Falta "SAMLResponse" de la solicitud HTTP (HttpRequest).
errorObtainResponse=No se ha podido obtener la respuesta de HttpRequest.
invalidResponse=La respuesta no es v\u00e1lida.
invalidAssertion=La aserci\u00f3n no es v\u00e1lida.
SAMLResponse=La respuesta SAML es 
mismatchAuthTypeandProtocol=El tipo de autenticaci\u00f3n y el protocolo (basado en SOAPUrl) no coinciden.
soapException=Se produce una excepci\u00f3n SOAP durante la creaci\u00f3n de un mensaje SOAP.
parseException=Se produce una excepci\u00f3n de an\u00e1lisis durante la creaci\u00f3n de un mensaje SOAP.
exception=Se produce una excepci\u00f3n en ArtifactHandler.
errorSigningResponse=No se ha podido firmar la respuesta.
alreadySigned=El objeto ya est\u00e1 firmado.
cannotVerifyResponse=No se puede verificar la firma XML de la respuesta.
cannotVerifyRequest=No se ha podido verificar la solicitud.
cannotFindCertAlias=No se ha podido encontrar el nombre de alias de certificado de este sitio.
assertionSignatureNotValid=La firma de la aserci\u00f3n no es v\u00e1lida.
nullkeystore=El almac\u00e9n de claves es nulo.
nullprivatekey=La clave privada es nula.
invalidalgorithm=Algoritmo de firma XML no v\u00e1lido.
invalidCanonicalizationMethod=M\u00e9todo de canonicalizaci\u00f3n de firma XML no v\u00e1lido.
invalidTransformAlgorithm=Algoritmo de transformaci\u00f3n de firma XML no v\u00e1lido.
noPrivilege=No se concede privilegio para realizar la tarea.
wrongformatStatusCode=Formato err\u00f3neo de c\u00f3digo de estado.
createArtifactError=No se puede crear el artefacto en SAMLAwareServlet.
failedAccountMapping=No se pudo encontrar la cuenta del usuario utilizando el Id. de origen.
missingDestID=Falta el destID.
emptyPartnerURLList=La lista PartnerURL est\u00e1 vac\u00eda.
noAuthNStatement=No hay AuthenticationStatement en aserci\u00f3n SSO.
nullPartnerUrl=Mapa URL del socio es nulo.
nullTrustedSite=No hay ning\u00fan sitio de confianza especificado en la administraci\u00f3n de servicios de SAML.
errorObtainAttributeMapper=No se ha podido obtener AttributeMapper del sitio.
errorObtainActionMapper=No se ha podido obtener ActionMapper del sitio.
nullAuthZDecision=Decisiones de autorizaci\u00f3n nulas.
untrustedCertificate=El certificado no es de confianza.
destIDNotFound=destID no est\u00e1 en los Sitios de socios de confianza.
failSetLocalFlag=Fallo en el m\u00e9todo setLocalFlag.
instancemapNull=La instancia Map es nula. 
instanceNotFound=No se encuentra la instancia de servidor de OpenSSO basada en sourceid. 
serverNotFound=Imposible encontrar el servidor para SDK remoto.
unknownLength=Longitud de contenido desconocida en HttpServletRequest.
largeContentLength=La longitud del contenido de la solicitud SOAP es demasiado extensa.
invalidConfig=Configuraci\u00f3n no v\u00e1lida.
artifactTimedOut=Se ha superado el tiempo de espera del artefacto.
assertionVersionNotSupport=No se admite la versi\u00f3n de aserci\u00f3n. Las versiones admitidas son 1.0 y 1.1. 
protocolVersionNotSupport=Versi\u00f3n de protocolo SAML no admitida. Las versiones admitidas son 1.0 y 1.1. 
missingElementValue=Falta el valor de este elemento. 
nullSubjectConfirmationMethod=SubjectConfirmationMethod es nulo.
missingSoapMessageFactory=No se ha podido obtener la instancia de la f\u00e1brica del mensaje.
invalidIDAttribute=Atributo de ID no v\u00e1lido.
nullKeyInfo=No se ha podido encontrar el elemento KeyInfo.
errorObtainPK=No se ha podido obtener la clave p\u00fablica.
failedCreateSSOToken=No se ha podido crear el token SSO.
nullSessionProvider=El proveedor de sesi\u00f3n es nulo.
serverError=Error del servidor. Compruebe el archivo de depuraci\u00f3n o registro del sitio del servidor.
failProcessArtifact=Error en el inicio de sesi\u00f3n \u00fanico mediante el perfil de artefacto SAML.
nullSubject=No se pudo encontrar el asunto de la aserci\u00f3n en la asignaci\u00f3n.
failedAccountMapping=Error al asignar la cuenta.
failProcessResponse=Error al procesar la respuesta SAML.
errorCanonical=Error al realizar la canonicalizaci\u00f3n en el nodo de entrada.
samlErrorKey=Respuesta de error de SAML.
