#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: libSAML2_es.properties,v 1.11 2009/12/26 03:41:55 cbasha Exp $
#

errorObtainingElement=Error al obtener el elemento DOM.
objectImmutable=No se puede modificar el objeto, ya que es inmutable.
emptyElementValue=El valor de este elemento est\u00e1 vac\u00edo.
nullInput=Entrada nula.
wrongInput=Entrada err\u00f3nea.
missingElementValue=Falta el valor de este elemento.
missingAttribute=Falta el atributo.
schemaViolation=Los datos no coinciden con el esquema.
missingElement=Falta el elemento.
missingElementValue=Falta el valor de este elemento.
invalidElement=La entrada contiene un elemento no v\u00e1lido.
moreElement=Se han incluido m\u00e1s elementos de los permitidos.
errorCreateArtifact=No se puede crear el artefacto.
nullLogoutRequest=Solicitud de cierre de sesi\u00f3n nula.
nullHostEntityID=Id. de entidad de host nulo.
nullRemoteEntityID=Id. de entidad remota nulo.
nullHostEntityRole=Rol de entidad de host nulo.
unknownHostEntityRole=Rol de entidad de host desconocido.
nullRealm=Dominio nulo.
nullManageIDRequest=Solicitud de Id. de administraci\u00f3n nula.
nullNameID=Identificador de nombre nulo.
invalidSSOToken=Token de inicio de sesi\u00f3n \u00fanico no v\u00e1lido.
inValidNameIDInfo=El formato de la cadena "NameIDInfo" no es correcto.
inValidNameIDInfoKey=El formato de la cadena de clave "NameIDInfo" no es correcto.
nullSSOToken=Token de inicio de sesi\u00f3n \u00fanico nulo
nullAttributes=Atributos nulos.
nullNameIDInfo=Informaci\u00f3n del identificador de nombre nula.
nullUserID=Id. de usuario nulo.
nullSPMetaAlias=Metalias del proveedor de servicios nulo.
nullIDPMetaAlias=Metalias del proveedor de identidad nulo.
idpNotFound=No se encuentra el proveedor de identidades.

missingVersion=La versi\u00f3n no est\u00e1 presente en la solicitud.
incorrectVersion=La versi\u00f3n de SAML es incorrecta.
missingIssueInstant=El instante de la emisi\u00f3n no est\u00e1 presente en la solicitud.
incorrectIssueInstant=El formato del instante de la emisi\u00f3n no es correcto.
missingIDAttr=El atributo de Id. no est\u00e1 presente en el mensaje de la solicitud de autenticaci\u00f3n.
missingStatus=El elemento de estado no est\u00e1 presente en el mensaje de respuesta.
missingStatusCode=El elemento de c\u00f3digo de estado no est\u00e1 presente en el mensaje de respuesta.
missingStatusCodeValue=El elemento de valor del c\u00f3digo de estado no est\u00e1 presente en el mensaje de respuesta.
missingNotOnOrAfterStr=El atributo "NotOnOrAfter" no est\u00e1 presente en el mensaje de la solicitud de cierre de sesi\u00f3n.
missingBaseIDorNameIDorEncryptedID=El Id. de base, el Id. de nombre o el Id. cifrado no est\u00e1 presente en el mensaje de la solicitud de cierre de sesi\u00f3n.
incorrectNotOnOrAfterStr=Atributo "NotOnOrAfter" incorrecto en el mensaje de la solicitud de cierre de sesi\u00f3n. 
cannotSignMessage=Error al intentar firmar el mensaje de la solicitud de autenticaci\u00f3n.
cannotSignResponse=Error al intentar firmar el mensaje de respuesta de SAML.
providerIDMissing=El Id. de proveedor no est\u00e1 presente.
noIDPEntry=La entrada de IDP no est\u00e1 presente.
noAttributes=No hay ning\u00fan atributo para este elemento.
invalidAssertionConsumerIndex=El valor de "AssertionConsumerServiceIndex" no es v\u00e1lido.
invalidAttributeConsumingSvcIdx=El valor de "AttributeConsumingServiceIndex" no es v\u00e1lido.
invalidProxyCount=El recuento del proxy no deber\u00eda ser un entero negativo.
ssoServiceNotFoundIDPProxy=El Proxy de IDP no pudo encontrar el punto final del servicio de inicio de sesi\u00f3n \u00fanico.
UnableToRedirectToPreferredIDP=El Proxy de IDP no pudo encontrar el IDP preferido para redireccionar.
nullRequestType=No se ha especificado el tipo de solicitud.
nullSPEntityID=El Id. de proveedor de servicios es nulo.
nullIDPEntityID=El Id. de proveedor de identidad es nulo.
nullSessionIndex=El \u00edndice de la sesi\u00f3n es nulo.
ssoServiceNotFound=No se ha encontrado la URL del servicio de inicio de sesi\u00f3n \u00fanico.
cannotGenerateID=No se ha podido generar un Id. exclusivo.
errorCreatingAuthnRequest=Error al crear la solicitud de autenticaci\u00f3n.
metaDataError=Error al recuperar los metadatos.
requestProcessingError=Error al procesar la solicitud de autenticaci\u00f3n.
requestProcessingMNIError=Error al procesar la solicitud de administraci\u00f3n de Id. de nombre.
LogoutRequestCreationError=Error al crear la solicitud de cierre de sesi\u00f3n. 
LogoutRequestProcessingError=Error al procesar la solicitud de cierre de sesi\u00f3n. 
errorGettingLogoutRequest=Error al obtener la solicitud de cierre de sesi\u00f3n.
missingLogoutRequest=Falta la solicitud de cierre de sesi\u00f3n.
missingLogoutResponse=Falta la respuesta de cierre de sesi\u00f3n.
LogoutResponseProcessingError=Error al procesar la respuesta de cierre de sesi\u00f3n.
errorCreatingLogoutResponse=Error al crear la respuesta de cierre de sesi\u00f3n.
errorRedirectingLogoutResponse=Error al redirigir la respuesta de cierre de sesi\u00f3n.
errorPostingLogoutResponse=Error al enviar la respuesta de cierre de sesi\u00f3n.
errorGettingLogoutResponse=Error al obtener la respuesta de cierre de sesi\u00f3n.
LogoutResponseNull=La respuesta de cierre de sesi\u00f3n es NULA.
NameIDNull=El Id. de nombre es nulo en la solicitud de cierre de sesi\u00f3n. 
ErrorSSOTokenManager=Error al recuperar el administrador de token SSO.
errorCreatingStatus=Error al crear el estado.
errorCreatingStatusCode=Error al crear el c\u00f3digo de estado.
errorCreatingIssuer=Error al crear el emisor.
nullDecodedStrFromSamlResponse=Cadena decodificada nula para la respuesta de cierre de sesi\u00f3n.
nullDecodedStrFromSamlRequest=Cadena decodificada nula para la solicitud de cierre de sesi\u00f3n.
nullInResponseToFromSamlResponse=Atributo "InResponseTo" no v\u00e1lido en la respuesta de cierre de sesi\u00f3n.
LogoutRequestIDandInResponseToDoNotMatch=Los atributos "LogoutRequestID" e "InResponseTo" no coinciden. 
errorMetaManager=Error al obtener la instancia del metadministrador.
metaAliasError=Error al recuperar el Id. de entidad del proveedor de servicios desde el metalias.
invalid_element=El elemento no es v\u00e1lido.
missing_local_name=Falta el nombre local de un elemento.
invalid_local_name=El nombre local de un elemento no es v\u00e1lido.
missing_version=Falta el atributo de versi\u00f3n de la aserci\u00f3n.
missing_assertion_id=Falta el atributo de Id. de la aserci\u00f3n.
missing_assertion_version=Falta el atributo de versi\u00f3n de la aserci\u00f3n.
missing_issue_instant=Falta el atributo de instante de emisi\u00f3n de la aserci\u00f3n.
invalid_date_format=La fecha y la hora no son v\u00e1lidas.
missing_subelements=No hay ning\u00fan elemento secundario presente.
missing_subelement_issuer=Falta el elemento secundario de emisor en la aserci\u00f3n.
unexpected_subelement=Se ha encontrado un elemento secundario inesperado.
invalid_count_number=El n\u00famero de recuento no es v\u00e1lido.
negative_count_number=El n\u00famero de recuento es negativo.
missing_confirmation_method=Falta el m\u00e9todo de confirmaci\u00f3n.
too_many_ids_specified=Se ha especificado m\u00e1s de un Id. en el objeto de confirmaci\u00f3n de asunto.
id_and_confirmationData_both_specified=Se han especificado tanto los datos de confirmaci\u00f3n de asunto como el Id. en el objeto de confirmaci\u00f3n de asunto.
need_at_least_one_id_or_on_SubjectConfirmation=Se debe especificar, al menos, un Id. o una confirmaci\u00f3n de asunto en un asunto
missing_name_identifier=Falta el identificador de nombre o la cadena est\u00e1 vac\u00eda.
invalid_name_identifier=El identificador de nombre no es v\u00e1lido o la cadena est\u00e1 vac\u00eda.
errorCreatingLogoutRequest=Error al crear la solicitud de cierre de sesi\u00f3n. 
sloServiceNotfound=No se ha encontrado la ubicaci\u00f3n del servicio de inicio de sesi\u00f3n \u00fanico.
errorRedirectingLogoutRequest=Error al redirigir la solicitud de cierre de sesi\u00f3n.
sloServiceListNotfound=No se ha encontrado la lista de ubicaciones del servicio de inicio de sesi\u00f3n \u00fanico.
sloResponseServiceLocationNotfound=No se ha encontrado la ubicaci\u00f3n del servicio de respuesta de inicio de sesi\u00f3n \u00fanico.
errorUserDN=Error al recuperar el elemento principal del token SSO.
errorInfoKeyString=Error al recuperar "NameIdInfoKey" del token SSO.
emptyDoc=Documento vac\u00edo.
errorGenerateKey=No se ha podido general la clave secreta.
unsupportedKeyAlg=Algoritmo de cifrado de clave p\u00fablica no admitido.
noCipherForPublicKeyAlg=No se ha podido obtener el algoritmo de cifrado de clave p\u00fablica especificado de la instancia de cifrado.
failedInitCipherWithPublicKey=No se ha podido inicializar el cifrado con la clave p\u00fablica.
failedEncryptingSecretKeyWithPublicKey=No se ha podido cifrar la clave secreta con la clave p\u00fablica.
invalidKeyStrength=Longitud no v\u00e1lida de la clave de cifrado de datos
unsupportedKeyAlg=Algoritmo de cifrado de datos no admitido
algSizeMismatch=La intensidad y el algoritmo de cifrado de datos no coinciden.
noCipherForDataEncAlg=No se ha podido obtener el algoritmo de cifrado de datos especificado de la instancia de cifrado.
failedInitCipherWithSecretKey=No se ha podido inicializar el cifrado con la clave secreta.
failedEncryptingData=No se han podido cifrar los datos.
failedMartializingEncryptedKey=No se pudo aplicar la clave cifrada.
missingElementEncryptedData=Falta el elemento de datos cifrados.
missingElementEncryptedKey=Falta el elemento de clave cifrada.
noCipher=No se ha podido obtener una instancia de cifrado.
failedInitCipherForDecrypt=No se ha podido inicializar el cifrado para el modo de descifrado.
failedLoadingEncryptedData=No se han podido cargar los datos cifrados.
failedLoadingEncryptedKey=No se ha podido cargar la clave cifrada.
noCipherForUnwrap=No se ha podido obtener una instancia de cifrado para la desenvoltura con la clave privada.
failedDecryptingSecretKey=No se ha podido descifrar la clave secreta.
failedDecryptingData=No se han podido descifrar los datos.
algNotSupported=No se admite el algoritmo de firma.
nullSigAlg=Falta el algoritmo de firma.
nullSig=Falta el valor de firma.
wrongInput=Rango de valores de \u00edndice incorrecto.
errorEncodeResponse=No se ha podido codificar la respuesta SAML (SAMLResponse).
errorDecodeResponse=No se ha podido decodificar la respuesta SAML (SAMLResponse).
missingSAMLResponse=Falta "SAMLResponse" de la solicitud HTTP (HttpRequest).
errorObtainResponse=No se ha podido obtener la respuesta de la solicitud HTTP (HttpRequest).
SSOFailed=Error en el inicio de sesi\u00f3n \u00fanico.
missingArtifact=Falta "SAMLArt" de la solicitud de HTTP.
errorObtainArtifact=No se ha podido obtener el artefacto de la solicitud HTTP.
postToTargetFailed=No se han podido publicar los datos en la ubicaci\u00f3n de destino.
errorGettingAuthnStatement=No se ha podido obtener el objeto "AuthnStatement".
noSubjectConfirmation=No hay ninguna confirmaci\u00f3n de asunto.
noAudienceRestriction=No hay ninguna restricci\u00f3n de destinatarios.
errorCreateArtifactResolve=No se pudo crear "ArtifactResolve".
errorInSOAPCommunication=No se pudo obtener "ArtifactResolve" debido a un error en la comunicaci\u00f3n SOAP.
errorInSOAPResponse=No se pudo obtener "ArtifactResponse" debido a la respuesta SOAP.
moreArtifactResponse=Se ha incluido m\u00e1s de un elemento "ArtifactResponse" en el cuerpo de SOAP.
cannotFindIDP=No se pudo encontrar IDP en funci\u00f3n del Id. de origen del artefacto.
cannotFindArtifactResolutionUrl=No se pudo encontrar la URL de resoluci\u00f3n de artefactos de IDP.
soapFaultInSOAPResponse=Error de SOAP en el mensaje SOAP.
missingArtifactResponse=Falta "ArtifactResponse" en el mensaje SOAP.
invalidSignature=Firma no v\u00e1lida en "ArtifactResponse".
invalidInResponseTo=Atributo" InResponseTo" no v\u00e1lido en "ArtifactResponse".
invalidIssuer=Emisor no v\u00e1lido en "ArtifactResponse".
invalidStatusCode=C\u00f3digo de estado no v\u00e1lido en "ArtifactResponse".
invalidSOAPMessge=El mensaje SOAP enviado por el cliente no es v\u00e1lido.
invalidSOAPEnvelope=El sobre del mensaje SOAP enviado por el cliente no es v\u00e1lido.
invalidSOAPEnvelope=El cuerpo del mensaje SOAP enviado por el cliente no es v\u00e1lido.
invalidArtifactResolve="ArtifactResolve" del cuerpo del mensaje SOAP no es v\u00e1lido.
invalidArtifactResolveSignature=La firma de "ArtifactResolve" del cuerpo del mensaje SOAP no es v\u00e1lido.
ArtifactResolveNotSigned=No se ha firmado "ArtifactResolve" cuando era necesario.
invalidArtifact=El artefacto de "ArtifactResolve" no es v\u00e1lido.
noArtifactResolve=El cuerpo del mensaje SOAP no contiene ning\u00fan "ArtifactResolve".
noArtifact="ArtifactResolve" del cuerpo del mensaje SOAP no contiene ning\u00fan artefacto.
unableToCreateSOAPMessage=No se puede crear un mensaje SOAP.
UnableToCreateArtifactResponse=No se puede crear la respuesta del artefacto SAML.
unsupportedRequest=No es una solicitud admitida
requestSuccess=La solicitud se ha realizado satisfactoriamente.
partialLogout=La solicitud de cierre de sesi\u00f3n se ha completado parcialmente.
sloSuccess=El cierre de sesi\u00f3n \u00fanico se ha realizado satisfactoriamente.
sloFailed=Error en el cierre de sesi\u00f3n \u00fanico. 
inValidResponse=Respuesta de cierre de sesi\u00f3n \u00fanico no v\u00e1lida.
inResponseToNoMatch=El atributo "InResponseTo" de la respuesta de cierre de sesi\u00f3n no coincide con ninguna solicitud.
spSloSuccess=SP ha iniciado satisfactoriamente el cierre de sesi\u00f3n \u00fanico.
idpSloSuccess=IDP ha iniciado satisfactoriamente el cierre de sesi\u00f3n \u00fanico.
ssoSuccess=Cierre de sesi\u00f3n \u00fanico realizado satisfactoriamente.
mniSuccess=Solicitud de administraci\u00f3n de Id. de nombre realizada satisfactoriamente.
mniFailed=Error en la solicitud de administraci\u00f3n de Id. de nombre.
unableToTerminate=No se ha podido finalizar la federaci\u00f3n.
unsupportedBinding=No se admite el enlace solicitado.
missingLocalName=Falta el nombre local en el mensaje SOAP.
invalidSOAPElement=El elemento ra\u00edz no es un sobre o es un espacio de nombre SOAP no v\u00e1lido.
missingSOAPBody=Falta el elemento de cuerpo de SOAP en el mensaje SOAP.
emptyBody=No presente ning\u00fan cuerpo de SOAP.
elementNotFound=Elemento no encontrado en el espacio de nombre samlp: 
errorLogoutRequest=No se ha podido obtener la solicitud de cierre de sesi\u00f3n desde la solicitud SOAP.
nullLogoutRequest=La solicitud de cierre de sesi\u00f3n es nula.
nullLogoutResponse=La respuesta de cierre de sesi\u00f3n es nula.
errorLogoutResponse=No se ha podido generar la respuesta de cierre de sesi\u00f3n.
errorLogoutResponseSOAP=No se ha podido generar el mensaje SOAP para la respuesta de cierre de sesi\u00f3n.
errorEncodingLogoutRespone=No se ha podido codificar la respuesta de cierre de sesi\u00f3n.
missingSigningCertAlias=Falta el alias del certificado firmado del proveedor.
nullKeyProviver=No se puede crear una instancia para el proveedor de claves.
invalidInResponseToInResponse=El atributo "InResponseTo" de la respuesta no es v\u00e1lido.
invalidStatusCodeInResponse=C\u00f3digo de estado no v\u00e1lido en la respuesta.
nullMetaManager=El metadministrador es nulo.
assertionNotEncrypted=No se ha cifrado la aserci\u00f3n.
missingAssertion=Falta la aserci\u00f3n en la respuesta.
invalidIssuerInRequest=El emisor de la solicitud no es v\u00e1lido.
invalidIssuerInResponse=El emisor de la respuesta no es v\u00e1lido.
invalidIssuerInAssertion=El emisor de la aserci\u00f3n no es v\u00e1lido.
mismatchIssuer=Los emisores de la(s) aserci\u00f3n(ones) o la respuesta son diferentes.
invalidSignatureOnAssertion=La firma de la aserci\u00f3n no es v\u00e1lida.
missingAuthnAssertion=La respuesta no contiene la aserci\u00f3n de autenticaci\u00f3n.
responseNotSigned=No se ha firmado la respuesta.
invalidSignatureOnResponse=La firma de la respuesta no es v\u00e1lida.
missingSubjectConfirmationData=Falta "SubjectConfirmationData".
missingRecipient=Falta el destinatario en la aserci\u00f3n.
wrongRecipient=El servicio de consumidor de aserciones no es el destinatario previsto.
invalidTimeOnSubjectConfirmationData=La hora de "SubjectConfirmationData" no es v\u00e1lida.
containedNotBefore="SubjectConfirmationData" conten\u00eda el atributo "NotBefore".
wrongInResponseToInAssertion=El atributo "InResponseTo" de la aserci\u00f3n es incorrecto.
missingConditions=Faltan las condiciones en la aserci\u00f3n.
missingAudienceRestriction=Falta la restricci\u00f3n de destinatarios.
audienceNotMatch=El proveedor de servicios no es el destinatario previsto.
signVerifyError=Error en la verificaci\u00f3n de firma.
invalidSessionIndex=El \u00edndice de sesi\u00f3n no es v\u00e1lido.
invalidSignInRequest=Firma no v\u00e1lida en la solicitud.
invalidSignInResponse=Firma no v\u00e1lida en la respuesta.
UnableToCreateAssertion=No se puede crear la aserci\u00f3n SAML.
UnableTofindBinding=No se puede encontrar el enlace de retorno.
UnableTofindACSURL=No se puede encontrar la URL del servicio de consumidor de aserciones.
UnSupportedReturnBinding=No se admite el enlace solicitado.
IDPMetaAliasNotFound=No se puede obtener el metalias de IDP desde la solicitud.
InvalidSAMLRequest=La solicitud SAML no es v\u00e1lida.
InvalidSAMLRequestID=El Id. de solicitud SAML no es v\u00e1lido.
MissingSAMLRequest=Falta Id. de solicitud de SAML.
UnableToRedirectToPreferredIDP=No se puede redireccionar al IDP preferido.
UnableToRedirectToAuth=No se puede redireccionar a la URL de autenticaci\u00f3n.
UnableToGetAuthnReq=No se puede obtener la solicitud de autenticaci\u00f3n.
UnableToCreateErrorResponse=No se puede crear la respuesta de error que se enviar\u00e1 a SP.
UnableToDOSSOOrFederation=No se puede realizar el inicio de sesi\u00f3n \u00fanico o la federaci\u00f3n.
entityid_invalid=No se ha especificado ning\u00fan Id. de entidad.
UnableToFindResponse=No se puede encontrar la respuesta correspondiente al artefacto.
UnableToFindEncryptKeyInfo=No se puede encontrar la informaci\u00f3n de clave de cifrado de la configuraci\u00f3n de entidad de SSO.
FailedToEncryptAssertion=No se puede cifrar la aserci\u00f3n.
FailedToEncryptAttribute=No se puede cifrar el atributo.
FailedToEncryptNameID=No se puede cifrar el Id. de nombre.
nameIDNotEncrypted=No se ha cifrado el Id. de nombre.
noUserMapping=No se ha asignado ning\u00fan usuario local.
failedAcctMapper=Asignador de cuentas de SP nulo.
failedAttrMapper=Asignador de atributos de SP nulo.
missingMessageParam=Falta el mensaje de par\u00e1metros HTTP en la solicitud.
invalidReceiver=El Id. de entidad recibido no es v\u00e1lido o de confianza.
ssoServiceNotfound=No se pudo encontrar la URL del servicio de inicio de sesi\u00f3n \u00fanico.
nullKeyProvider=No se puede obtener la instancia del proveedor de claves.
notSupportedHTTPMethod=No se admite el enlace del perfil de inicio de sesi\u00f3n \u00fanico especificado.
unsupportedSloBinding=No se admite el enlace del perfil de cierre de sesi\u00f3n \u00fanico especificado.
nullEntityID=Falta el Id. de entidad.
errorCreatingMNIRequest=Error al crear la solicitud del identificador de administraci\u00f3n de nombres.
invalidSOAPMessage=Mensaje SOAP no v\u00e1lido.
MetaAliasNotFound=No se puede obtener el metalias desde la solicitud.
mniServiceNotFound=URL del servicio de administraci\u00f3n de Id. de nombre no v\u00e1lida.
failedToGenResponseID=No se puede generar el Id. de respuesta.
errorSOAPFactory=Error al obtener la instancia de la f\u00e1brica SOAP.
UnableToGetResponseInfoFromCache=No se puede obtener la informaci\u00f3n de respuesta de la cach\u00e9 despu\u00e9s de regresar de la configuraci\u00f3n de la cookie de COT.
invalidDestination=El destino no es v\u00e1lido.
missingDiscoOffering=No se puede obtener la oferta de recursos de detecci\u00f3n.
missingUnivID=No se puede obtener el Id. universal.
unSupportedEncoding=Codificaci\u00f3n no admitida.
invalidRelayStateUrl=URL de estado de rel\u00e9 especificada no v\u00e1lida.
malformedURLSpecified=Se ha especificado una URL mal construida para la URL de estado de rel\u00e9.

### properties for SOAP Client & Handler
nullPEP=El identificador de entidad del punto de aplicaci\u00f3n de directivas (PEP) es nulo.
nullPDP=El identificador de punto de aplicaci\u00f3n de directivas (PEP) es nulo.
nullResponse=La respuesta es nula.
missingRequestHandler=No se puede encontrar el controlador de solicitudes.
invalidQuery=Consulta no v\u00e1lida.
nullSigningAlias=El alias de firma es nulo.
serverError=Error del servidor debido a un fallo en la configuraci\u00f3n o un mensaje SOAP no v\u00e1lido.
invalidQuerySignature=Firma no v\u00e1lida en la solicitud de consulta.
pdpMetaRetreivalError=Error al recuperar los metadatos del punto de decisi\u00f3n de directivas (PDP) para la entidad {0}.
pepMetaRetreivalError=Error al recuperar los metadatos del punto de aplicaci\u00f3n de directivas (PDP) para la entidad {0}.
missingChildTagName=Falta el nombre de etiqueta secundario.
invalidSOAPBody=El cuerpo de SOAP no contiene Fallo SOAP o Respuesta SAML.
invalidSOAPElement=Elemento SOAP no v\u00e1lido en el sobre SOAP.
invalidIssuer=El emisor de la respuesta no es v\u00e1lido: {2}
invalidHttpRequestFromECP=Solicitud HTTP no v\u00e1lida de ECP.
missingECPRelayState=El valor no est\u00e1 presente en el estado de rel\u00e9 de ECP.
missingECPRelayState=El valor no est\u00e1 presente en el estado de rel\u00e9 de ECP.
missingMustUnderstandECPRelayState=El atributo "mustUnderstand" no est\u00e1 presente en el estado de rel\u00e9 de ECP.
missingActorECPRelayState=El atributo de actor no est\u00e1 presente en el estado de rel\u00e9 de ECP.
invalidXMLBooleanValue=Valor booleano de XML no valido.
invalidECPRelayState=Nombre local del estado de rel\u00e9 de ECP no v\u00e1lido.
invalidECPNamesapce=URI de espacio de nombre de ECP no v\u00e1lido.
invalidECPRequest=Nombre local de la solicitud ECP no v\u00e1lido.
ecpReqTooManyIssuer=La solicitud ECP tiene demasiados elementos de emisor.
ecpReqIssuerNotFirst=El emisor deber\u00eda ser el primer elemento secundario de la solicitud ECP.
ecpReqTooManyIDPList=La solicitud ECP tiene demasiados elementos "IDPList".
invalidElementECPReq=La solicitud ECP tiene un elemento secundario no v\u00e1lido.
missingMustUnderstandECPRequest=El atributo "mustUnderstand" no est\u00e1 presente en la solicitud ECP.
missingActorECPRequest=El atributo de actor no est\u00e1 presente en la solicitud ECP.
missingIssuerECPRequest=El elemento secundario de emisor no est\u00e1 presente en la solicitud ECP.
invalidECPResponse=Nombre local de la respuesta ECP no v\u00e1lido.
missingAssertionConsumerServiceURLECPResponse=El atributo "AssertionConsumerServiceURL" no est\u00e1 presente en la respuesta ECP.
missingMustUnderstandECPResponse=El atributo "mustUnderstand" no est\u00e1 presente en la respuesta ECP.
missingActorECPResponse=El atributo de actor no est\u00e1 presente en la respuesta ECP.
assertionNotSigned=No se ha firmado la aserci\u00f3n.
unsupportedNameIDFormat=Formato de identificador de nombre no admitido.
unsupportedNameIDFormatSP=El proveedor de servicios no admite el formato de identificador de nombre {0}. 
unsupportedNameIDFormatIDP=El proveedor de identidades no admite el formato de identificador de nombre {0}. 
unsupportedNameIDFormatIDPSP=No se puede encontrar el formato de Id. de nombre admitido tanto por IDP como por SP.
attrAuthorityNotFound=No se ha encontrado la entidad de atributo.
errorSendingAttributeQuery=Error al enviar la consulta de atributo.
invalidInResponseToAttrQuery=InResponseTo de la respuesta no coincide con el Id. en AttributeQuery.
attrQueryIssuerInvalid=El emisor de AttributeQuery no es v\u00e1lido o no es de confianza.
attrQueryIssuerNotFound=No se ha encontrado el emisor de AttributeQuery.
attrQueryNotSigned=AttributeQuery no est\u00e1 firmado.
invalidSignatureAttrQuery=La firma de AttributeQuery no es v\u00e1lida.
unsupportedAttrQuerySubjectNameID=Formato de Id. de nombre no admitido en el asunto de consulta de atributo.
x509SubjectMappingNotConfigured=La asignaci\u00f3n de asunto X509 no est\u00e1 configurada.
nameIDMReqWrongID=S\u00f3lo debe existir un Id. de nombre, Id. de cifrado e Id. de base en el elemento NameIDMappingRequest.
nameIDMReqMissingNameIDPolicy=Falta NameIDMappingRequest en el elemento NameIDMappingRequest.
nameIDMRespWrongID=S\u00f3lo debe existir un Id. de nombre y un Id. de cifrado en el elemento NameIDMappingResponse.
nimServiceNotFound=URL del servicio de asignaci\u00f3n de Id. de nombre no encontrada.
nimServiceBindingUnsupport=Enlace de servicio de asignaci\u00f3n de Id. de nombre no admitido.
targetNameIDNotFound=No se ha encontrado el Id. de nombre solicitado.
targetNameIDNoChange=El Id. de nombre solicitado es el mismo que el original.
nullNIMRequest=Solicitud de asignaci\u00f3n de Id. de nombre no v\u00e1lida.
targetNameIDFormatUnsupported=Formato de Id. de nombre solicitado no admitido.
authnAuthorityNotFound=No se ha encontrado la entidad de autenticaci\u00f3n.
authnQueryIssuerInvalid=El emisor de AuthnQuery no es v\u00e1lido o no es de confianza.
authnQueryIssuerNotFound=No se ha encontrado el emisor de AuthnQuery.
invalidInResponseToAuthnQuery=InResponseTo de la respuesta no coincide con el Id. en AuthnQuery.
invalidSignatureAuthnQuery=La firma de AuthnQuery no es v\u00e1lida.
authnQueryNotSigned=No se ha firmado AuthnQuery.
errorSendingAuthnQuery=Error al enviar AuthnQuery.
unsupportedRole=Rol no admitido.
aIDReqServiceNotFound=No se ha encontrado el servicio de solicitud de Id. de aserci\u00f3n.
nullAssertionID=No se ha encontrado el Id. de aserci\u00f3n.
invalidAssertionID=Id. de aserci\u00f3n no v\u00e1lido.
samlAuthorityNotFound=No se ha encontrado la entidad de SAML.
assertionIDRequestIssuerNotFound=El emisor de AssertionIDRequest no es v\u00e1lido o no es de confianza.
invalidSignatureAssertionIDRequest=La firma en AssertionIDRequest no es v\u00e1lida.
errorSendingAssertionIDRequest=Error al enviar AssertionIDRequest.
invalidInResponseToAssertionIDRequest=InResponseTo de la respuesta no coincide con el Id. en AssertionIDRequest.
responseIssuerMismatch=El emisor de la respuesta no coincide con el Id. de entidad remota.
invalidAssertionRequester=Solicitante de aserci\u00f3n no v\u00e1lido.
assertionIDRequestIssuerInvalid=El emisor de AssertionIDRequest no es v\u00e1lido o no es de confianza.
affiliationNotFound=Afiliaci\u00f3n no encontrada.
spNotAffiliationMember=El proveedor de servicios no es un miembro de la afiliaci\u00f3n.
cannotCreateNameID=La creaci\u00f3n de NameID no est\u00e1 permitida por AuthnRequest.
unableToGenerateNameIDValue=No se puede generar el valor NameID.
invalidAuthnContextClassRef=AuthnContext no coincide con RequestedAuthnContext.
entityNotHosted=La entidad {0} ubicada en el dominio {1} no es una entidad alojada.
entityNotIDP=La entidad {0} ubicada en el dominio {1} no es un proveedor de identidades.
entityNotSP=La entidad {0} ubicada en el dominio {1} no es un proveedor de servicios.
#For SAMLv2 failover
invalidTimeOnResponse=Hora no v\u00e1lida en la respuesta.
invalidCertificate=El certificado de firmas no coincide con lo que se ha definido en los metadatos de entidad.
unknownPrincipal=Principal desconocido en la solicitud de Id. de nombre de administraci\u00f3n.
newNameIDSuccess=El identificador del nombre nuevo se ha realizado correctamente.
usedBearAssertion=Esta aserci\u00f3n s\u00f3lo se utiliza una vez. 
samlPostKey=Enviar datos de SAMLResponse 
failedToProcessSSOResponse=Error al procesar la respuesta de inicio de sesi\u00f3n \u00fanico.
failedToGetAssertionIDRequestMapper=Error al obtener el asignador de solicitudes de AssertionID.
failedToAuthenticateRequesterURI=Error al autenticar el solicitante utilizando el enlace de URI.
invalidAssertion=Aserci\u00f3n no v\u00e1lida.
unsupportedEncoding=No se admite la codificaci\u00f3n de caracteres.
failedToSendECPResponse=Error al enviar la respuesta ECP.
nullSessionProvider=El proveedor de sesi\u00f3n es nulo.
failedToGetIDPSSODescriptor=Error al obtener el elemento SSODescriptor de los metadatos IDP.
soapError=Error de SOAP.
failedToCreateArtifactResponse=Error al crear el objeto ArtifactResponse.
failedToCreateResponse=Error al crear el objeto Response.
failedToCreateSOAPMessage=Error al crear el mensaje SOAP.
failedToProcessQueryRequest=Fallo al procesar la solicitud de consulta.
failedToCreateAssertionIDRequest=Error al crear el objeto AssertionIDRequest.
nullPathInfo=No se encontr\u00f3 informaci\u00f3n de la ruta URI en la solicitud.
invalidMetaAlias=Metalias de entidad no v\u00e1lido.
failedToCreateAttributeQuery=Error al crear el objeto AttributeQuery.
failedToCreateAuthnQuery=Error al crear el objeto AuthnQuery.
nameIDMappingFailed=error en la asignaci\u00f3n de identificador de nombre.
failedToInitECPRequest=Error al iniciar la solicitud ECP.
singleLogoutFailed=Fallo de cierre de sesi\u00f3n \u00fanico. 
nullRequestUri=La URI de solicitud es nula
invalidRequestUri=No se pudo determinar el protocolo de federaci\u00f3n bas\u00e1ndose en la URI de solicitud.
noRedirectionURL=No se ha especificado ninguna URL de redirecci\u00f3n.
readerServiceFailed=Error del servicio de lector.
appLogoutFailed=No se pudo cerrar la sesi\u00f3n de la aplicaci\u00f3n.
# begin section for fedlet encode
result-encoded-pwd=La contrase\u00f1a codificada es
prompt-pwd=Introduzca la contrase\u00f1a que se va a codificar
btn-encode=Codificar
encode-another-pwd=Codificar otra contrase\u00f1a
failed-to-encode=Fallo al codificar la contrase\u00f1a.
# end section for fedlet encode
