#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amAuthCert_ja.properties,v 1.11 2009/12/26 03:51:44 cbasha Exp $
#
# Portions Copyrighted 2011-2014 ForgeRock AS
# Portions Copyrighted 2012-2014 Open Source Solution Technology Corporation
# Portions Copyrighted 2014 Nomura Research Institute, Ltd
#

onlinehelp.doc=certauth.html
authentication=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb

CERTex=\u4e0d\u660e\u306a\u8a8d\u8a3c\u5c40\u3002
CertNoContext=LDAP \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
CertExpired=\u8a3c\u660e\u66f8\u306e\u6709\u52b9\u671f\u9650\u304c\u5207\u308c\u307e\u3057\u305f\u3002
CertVerifyFailed=\u8a3c\u660e\u66f8\u3092\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
CertNoReg=\u767b\u9332\u6e08\u307f\u8a3c\u660e\u66f8\u306e\u691c\u7d22\u4e2d\u306e\u30a8\u30e9\u30fc\u3002
CertRevoked=\u8a3c\u660e\u66f8\u304c\u7834\u68c4\u3055\u308c\u307e\u3057\u305f\u3002
iCertNotValidYet=\u8a3c\u660e\u66f8\u306f\u307e\u3060\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093\u3002
CertIsNotValid=\u8a3c\u660e\u66f8\u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
iplanet-am-auth-cert-service-description=\u8a3c\u660e\u66f8
a101=LDAP \u3067\u8a3c\u660e\u66f8\u3092\u7167\u5408
a101.help=\u8a8d\u8a3c\u304c\u6210\u529f\u3059\u308b\u305f\u3081\u306b\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u3092\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u683c\u7d0d\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a1011=LDAP \u3067\u306e\u8a3c\u660e\u66f8\u306e\u691c\u7d22\u306b\u4f7f\u7528\u3059\u308b\u5bfe\u8c61 DN \u5c5e\u6027
a1011.help=\u8a3c\u660e\u66f8\u7528\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u3067\u3059\u3002
a1011.help.txt=\u8a3c\u660e\u66f8\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u3053\u306e\u5c5e\u6027\u3068\u8a3c\u660e\u66f8\u304b\u3089\u53d6\u5f97\u3057\u305f\u30b5\u30d6\u30b8\u30a7\u30af\u30c8 DN \u306e\u5024\u306b\u57fa\u3065\u3044\u305f\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u3092\u4f7f\u7528\u3057\u3066\u3001\
\u8a3c\u660e\u66f8\u7528\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u691c\u7d22\u3057\u307e\u3059\u3002
a102=CRL \u306b\u5bfe\u3057\u3066\u8a3c\u660e\u66f8\u3092\u7167\u5408
a102.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u3042\u308b\u8a3c\u660e\u66f8\u5931\u52b9\u30ea\u30b9\u30c8\u3068\u7167\u5408\u3055\u308c\u307e\u3059\u3002
a102.help.txt=\u8a3c\u660e\u66f8\u5931\u52b9\u30ea\u30b9\u30c8\u306f\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u30d7\u30ed\u30d3\u30b8\u30e7\u30cb\u30f3\u30b0\u3067\u304d\u307e\u3059\u3002\
\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u6709\u52b9\u306e\u5834\u5408\u3001\u3059\u3079\u3066\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u304c\u3053\u306e\u30ea\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u30c1\u30a7\u30c3\u30af\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
a102.help.uri=#tbd
a1023=CRL \u306b\u5bfe\u3057\u3066 CA \u8a3c\u660e\u66f8\u3092\u7167\u5408
a1023.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u3092\u767a\u884c\u3057\u305f CA \u8a3c\u660e\u66f8\u3082 CRL \u3068\u7167\u5408\u3055\u308c\u307e\u3059\u3002
a1024=\u30e1\u30e2\u30ea\u306b CRL \u3092\u30ad\u30e3\u30c3\u30b7\u30e5\u3059\u308b
a1024.help=CRL \u306f\u30e1\u30e2\u30ea\u306b\u30ad\u30e3\u30c3\u30b7\u30e5\u3055\u308c\u307e\u3059\u3002
a1025=CRLDistributionPoint \u304b\u3089 CA \u306e CRL \u3092\u66f4\u65b0\u3059\u308b
a1025.help=CRLDistributionPoint \u304b\u3089\u65b0\u3057\u3044 CA \u306e CRL \u3092\u30d5\u30a7\u30c3\u30c1\u3057\u3001Directory Server \u306e CRL \u3092\u66f4\u65b0\u3057\u307e\u3059\u3002
a1025.help.txt=CA \u8a3c\u660e\u66f8\u304c IssuingDistributionPoint \u3092\u542b\u3093\u3067\u3044\u308b\u304b\u3001CRLDistributionPoint \u62e1\u5f35\u8a2d\u5b9a\u3092\u6301\u3064\u5834\u5408\u3001OpenAM \u306f\u5fc5\u8981\u3067\u3042\u308c\u3070 \
\uff08\u4f8b\u3048\u3070 CRL \u304c\u53e4\u304f\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306f\uff09 CRL \u3092\u66f4\u65b0\u3057\u3088\u3046\u3068\u3057\u307e\u3059\u3002<br/>\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u66f4\u65b0\u304c\u5b9f\u884c\u3055\u308c\u308b\u3079\u304d\u304b\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002<br/>\
\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001CA \u306e CRL \u30c1\u30a7\u30c3\u30af\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a1021=LDAP \u3067\u306e CRL \u306e\u691c\u7d22\u306b\u4f7f\u7528\u3059\u308b\u767a\u884c\u8005 DN \u5c5e\u6027
a1021.help=CRL \u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b CA \u8a3c\u660e\u66f8\u304b\u3089\u53d6\u5f97\u3057\u305f\u5c5e\u6027\u306e\u540d\u524d\u3067\u3059\u3002
a1021.help.txt=\u5c5e\u6027\u540d\u304c\u4e00\u3064\u3060\u3051\u6307\u5b9a\u3055\u308c\u305f\u5834\u5408\u3001LDAP \u306e\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u306f (attrName=Value_of_the_corresponding_Attribute_from_SubjectDN) \u3068\u306a\u308a\u307e\u3059\u3002<br/>\
\u4f8b\u3048\u3070\u3001\u767a\u884c\u8005\u306e\u8a3c\u660e\u66f8\u306e\u30b5\u30d6\u30b8\u30a7\u30af\u30c8 DN \u304c 'C=US, CN=Some CA, serialNumber=123456' \u3067\u3001\u6307\u5b9a\u3055\u308c\u305f\u5c5e\u6027\u540d\u304c 'CN' \u306e\u5834\u5408\u3001\u4f7f\u7528\u3055\u308c\u308b\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u306f <code>(CN=Some CA)</code> \u3068\u306a\u308a\u307e\u3059\u3002<br/><br/>\
\u5c5e\u6027\u540d\u304c\u8907\u6570\u6307\u5b9a\u3055\u308c\u305f\u5834\u5408\u3001\u305d\u308c\u3089\u306f\u300c <code>,</code> \u300d\u3067\u533a\u5207\u3089\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002\u7d50\u679c\u7684\u306b LDAP \u306e\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u5024\u306f\u3001\
\u540d\u524d\u306e\u5c5e\u6027\u5024\u3092\u30ab\u30f3\u30de\u3067\u533a\u5207\u3063\u305f\u30ea\u30b9\u30c8\u3068\u306a\u308a\u3001\u691c\u7d22\u5c5e\u6027\u306f <code>cn</code> \u3068\u306a\u308a\u307e\u3059\u3002<br/>\
\u4f8b\u3048\u3070\u3001\u767a\u884c\u8005\u306e\u8a3c\u660e\u66f8\u306e\u30b5\u30d6\u30b8\u30a7\u30af\u30c8 DN \u304c 'C=US, CN=Some CA, serialNumber=123456' \u3067\u3001\u6307\u5b9a\u3055\u308c\u305f\u5c5e\u6027\u540d\u304c 'CN,serialNumber' \u306e\u5834\u5408\u3001\
\u4f7f\u7528\u3055\u308c\u308b\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u306f <code>cn=CN=Some CA,serialNumber=123456</code> \u3068\u306a\u308a\u307e\u3059\u3002<br/><br/>\
\u5c5e\u6027\u540d\u306e\u5024\u306e\u9806\u5e8f\u306f\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u5185\u306e crlDistributionPoint \u30a8\u30f3\u30c8\u30ea\u306e <code>cn</code> \u5c5e\u6027\u306e\u5024\u3068\u4e00\u81f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

a1022=CRL \u66f4\u65b0\u7528\u306e HTTP \u30d1\u30e9\u30e1\u30fc\u30bf
a1022.help=\u3053\u308c\u3089\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u306f\u3001\u8a8d\u8a3c\u5c40\u3078\u306e\u4efb\u610f\u306e HTTP \u306e CRL \u547c\u3073\u51fa\u3057\u306b\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
a1022.help.txt=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u307e\u305f\u306f CA \u8a3c\u660e\u66f8\u304c\u767a\u884c\u5206\u914d\u70b9\u62e1\u5f35\u3092\u542b\u3093\u3067\u3044\u308b\u5834\u5408\u3001OpenAM \u306f\u914d\u5e03\u30dd\u30a4\u30f3\u30c8\u304b\u3089 CRL \u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306b\u3053\u306e\u60c5\u5831\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\
\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u30ab\u30b9\u30bf\u30e0 HTTP \u30d1\u30e9\u30e1\u30fc\u30bf\u304c CRL \u8981\u6c42\u306b\u542b\u307e\u308c\u308b\u3053\u3068\u3092\u8a31\u53ef\u3057\u307e\u3059\u3002<br/><br/>\
\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059:<br/><br/>\
<code>param1=value1,param2=value</code>
a103=OCSP \u691c\u8a3c
a103.help=OCSP \u304c\u8a8d\u8b58\u3057\u3066\u3044\u308b\u8a3c\u660e\u66f8\u306e\u30aa\u30f3\u30e9\u30a4\u30f3\u8a3c\u660e\u66f8\u30b9\u30c6\u30fc\u30bf\u30b9\u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u691c\u8a3c\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a103.help.txt=\u8a3c\u660e\u66f8\u304c OCSP \u691c\u8a3c\u60c5\u5831\u3092\u542b\u3093\u3067\u3044\u308b\u5834\u5408\u3001 OpenAM \u306f\u8a8d\u8a3c\u30d7\u30ed\u30bb\u30b9\u306e\u4e00\u90e8\u3068\u3057\u3066\u8a3c\u660e\u66f8\u306e\u6709\u52b9\u6027\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u3001\
\u3053\u306e\u60c5\u5831\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>OCSP \u304c\u52d5\u4f5c\u3059\u308b\u305f\u3081\u306b\u3001 OpenAM \u30b5\u30fc\u30d0\u30fc\u306f\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u306b\u63a5\u7d9a\u3067\u304d\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a104=\u8a3c\u660e\u66f8\u304c\u683c\u7d0d\u3055\u308c\u3066\u3044\u308b LDAP \u30b5\u30fc\u30d0\u30fc
a104.help=\u8a3c\u660e\u66f8\u306e\u691c\u7d22\u306b\u4f7f\u7528\u3059\u308b LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a104.help.txt=\u8a3c\u660e\u66f8\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u8a3c\u660e\u66f8\u306e\u691c\u7d22\u306b\u4f7f\u7528\u3059\u308b LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u6c7a\u5b9a\u3059\u308b\u305f\u3081\u306b\u3053\u306e\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\
\u5358\u4e00\u306e\u30a8\u30f3\u30c8\u30ea\u306e\u5f62\u5f0f\u306f\u6b21\u306e\u3088\u3046\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059:<br/><br/><code>LDAP \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\u8907\u6570\u306e\u30a8\u30f3\u30c8\u30ea\u306e\u5834\u5408\u3001 OpenAM \u30b5\u30fc\u30d0\u30fc\u3068 LDAP \u30b5\u30fc\u30d0\u30fc\u9593\u306e\u9023\u643a\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002 \
\u5f62\u5f0f\u306f:<br/><br/><code>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d | \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\
\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30b5\u30a4\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u3042\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u5b8c\u5168\u540d\u3067\u3059\u3002
a105=LDAP \u691c\u7d22\u958b\u59cb DN
a105.help=\u8a3c\u660e\u66f8\u691c\u7d22\u306e\u305f\u3081\u306e LDAP \u30b5\u30fc\u30d0\u30fc\u5185\u306e\u958b\u59cb\u70b9\u3002
a105.help.txt=\u8907\u6570\u306e\u30a8\u30f3\u30c8\u30ea\u3092\u5165\u529b\u3059\u308b\u5834\u5408\u306f\u3001\u5404\u30a8\u30f3\u30c8\u30ea\u306b\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u3092\u4ed8\u3051\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\
\u8907\u6570\u306e\u30a8\u30f3\u30c8\u30ea\u306b\u3088\u308a\u3001\u4f7f\u7528\u4e2d\u306e OpenAM \u30b5\u30fc\u30d0\u30fc\u306b\u5fdc\u3058\u305f\u7570\u306a\u308b\u691c\u7d22\u30d9\u30fc\u30b9 DN \u3092\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002\u5f62\u5f0f\u306f:<br/><br/><code>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d | \u30d9\u30fc\u30b9 DN</code><br/><br/>\
\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30b5\u30a4\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u3042\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u5b8c\u5168\u540d\u3067\u3059\u3002
a106=LDAP \u30a2\u30af\u30bb\u30b9\u8a8d\u8a3c\u30bf\u30a4\u30d7
a107=LDAP \u30b5\u30fc\u30d0\u30fc\u306e\u4e3b\u4f53\u30e6\u30fc\u30b6\u30fc
a107.help=LDAP \u30b5\u30fc\u30d0\u30fc\u3078\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u4f7f\u7528\u3055\u308c\u308b\u30e6\u30fc\u30b6\u30fc\u306e DN \u3002
a107.help.txt=\u8a3c\u660e\u66f8\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u4e00\u81f4\u3059\u308b\u8a3c\u660e\u66f8\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b LDAP \u30b5\u30fc\u30d0\u30fc\u306b\u8a8d\u8a3c\u3057\u307e\u3059\u3002\
\u3053\u3053\u3067\u5165\u529b\u3057\u305f DN \u306f\u3001\u524d\u8ff0\u306e\u8a8d\u8a3c\u306b\u4f7f\u7528\u3055\u308c\u308b\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u8868\u3057\u3001LDAP \u30b5\u30fc\u30d0\u30fc\u3078\u306e\u691c\u7d22/\u8aad\u307f\u53d6\u308a\u6a29\u9650\u3092\u6301\u3063\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a108=LDAP \u30b5\u30fc\u30d0\u30fc\u306e\u4e3b\u4f53\u30d1\u30b9\u30ef\u30fc\u30c9
a108.help=\u8a8d\u8a3c\u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
a109=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb ID \u306e\u305f\u3081\u306e LDAP \u5c5e\u6027
a109.help=\u30e6\u30fc\u30b6\u30fc ID \u3068\u3057\u3066\u4f7f\u7528\u3067\u304d\u308b\u30e6\u30fc\u30b6\u30fc\u30a8\u30f3\u30c8\u30ea( CN \u3001 SN )\u306e\u6709\u52b9\u306a\u5c5e\u6027\u3092\u5165\u529b\u3057\u307e\u3059\u3002
a110=LDAP \u30a2\u30af\u30bb\u30b9\u306b SSL \u3092\u4f7f\u7528
a110.help=\u8a3c\u660e\u66f8\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001 LDAP \u30b5\u30fc\u30d0\u30fc\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306b SSL/TLS \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a111=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306b\u4f7f\u7528\u3059\u308b\u8a3c\u660e\u66f8\u30d5\u30a3\u30fc\u30eb\u30c9
a111.help=\u8a3c\u660e\u66f8\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u4e00\u81f4\u3059\u308b\u8a3c\u660e\u66f8\u3092 LDAP \u30b5\u30fc\u30d0\u30fc\u3067\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u53ef\u80fd\u306a\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u304b\u3089\u3001\
\u5024\u3092\u8aad\u307f\u53d6\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a1111=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306b\u4f7f\u7528\u3059\u308b\u305d\u306e\u4ed6\u306e\u8a3c\u660e\u66f8\u30d5\u30a3\u30fc\u30eb\u30c9
a1111.help=<i>\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306b\u4f7f\u7528\u3059\u308b\u8a3c\u660e\u66f8\u30d5\u30a3\u30fc\u30eb\u30c9</i>\u5c5e\u6027\u3067<i>\u305d\u306e\u4ed6</i>\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u5165\u529b\u304c\u8a8d\u8b58\u3055\u308c\u307e\u3059\u3002\
\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u3001\u30ab\u30b9\u30bf\u30e0\u8a3c\u660e\u66f8\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u30e6\u30fc\u30b6\u30fc\u306e\u691c\u7d22\u306e\u57fa\u790e\u3068\u3057\u3066\u4f7f\u7528\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002
a1112=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b SubjectAltNameExt \u5024\u30bf\u30a4\u30d7
a1112.help=\u6a19\u6e96\u306e\u8a3c\u660e\u66f8\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u3044\u305a\u308c\u304b\u306b\u512a\u5148\u3057\u3066\u30b5\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u5225\u540d\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a1112.help.txt=RFC822Name \u307e\u305f\u306f UPN \u3092\u9078\u629e\u3059\u308b\u3068\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u300c\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306b\u4f7f\u7528\u3059\u308b\u8a3c\u660e\u66f8\u30d5\u30a3\u30fc\u30eb\u30c9\u300d\u307e\u305f\u306f \
\u300c\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306b\u4f7f\u7528\u3059\u308b\u305d\u306e\u4ed6\u306e\u8a3c\u660e\u66f8\u30d5\u30a3\u30fc\u30eb\u30c9\u300d\u5c5e\u6027\u3088\u308a\u3082\u512a\u5148\u3055\u308c\u308b\u3053\u3068\u306b\u306a\u308a\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u3053\u306e\u6a5f\u80fd\u3092\u52d5\u4f5c\u3055\u305b\u308b\u305f\u3081\u306b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u306f\u3001<i>\u30b5\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u5225\u540d\u62e1\u5f35</i>\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a500=\u8a8d\u8a3c\u30ec\u30d9\u30eb
a500.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a500.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u304c\u6700\u4f4e\u3067\u3059\u3002
a113=\u4fe1\u983c\u3067\u304d\u308b\u30ea\u30e2\u30fc\u30c8\u30db\u30b9\u30c8
a113.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u3092\u4f9b\u7d66\u3059\u308b\u305f\u3081\u306e\u4fe1\u983c\u3067\u304d\u308bIP\u30a2\u30c9\u30ec\u30b9\u306e\u30ea\u30b9\u30c8\u3002
a113.help.txt=SSL/TLS \u901a\u4fe1\u304c\u3001\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u307e\u305f\u306f\u5206\u6563\u8a8d\u8a3c\u30b5\u30fc\u30d0\u30fc\u3067\u7d42\u4e86\u3057\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u3001\
\u6307\u5b9a\u3055\u308c\u305f<i>\u4fe1\u983c\u3067\u304d\u308b</i>\u30db\u30b9\u30c8( IP \u30a2\u30c9\u30ec\u30b9\u3067\u8b58\u5225)\u306e\u307f\u304c\u3001\u8a3c\u660e\u66f8\u30e2\u30b8\u30e5\u30fc\u30eb\u3078\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u306e\u4f9b\u7d66\u3092\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002\
<br/><br/>\u3053\u306e\u30ea\u30b9\u30c8\u306e\u6709\u52b9\u306a\u5024\u306f\u6b21\u306e\u901a\u308a\u3067\u3059:<ul><li>none</li><li>all</li><li>\u8907\u6570\u306e IP \u30a2\u30c9\u30ec\u30b9</li></ul><br/><br/>\
\u30c7\u30d5\u30a9\u30eb\u30c8\u5024 <i>none</i> \u306f\u3053\u306e\u6a5f\u80fd\u3092\u7121\u52b9\u306b\u3057\u307e\u3059\u3002
a115=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8a3c\u660e\u66f8\u7528 HTTP \u30d8\u30c3\u30c0\u30fc\u540d
a115.help=\u8a3c\u660e\u66f8\u3092\u542b\u3080 HTTP \u30ea\u30af\u30a8\u30b9\u30c8\u30d8\u30c3\u30c0\u306e\u540d\u524d\u3002<i>\u4fe1\u983c\u3055\u308c\u305f\u30ea\u30e2\u30fc\u30c8\u30db\u30b9\u30c8</i>\u30e2\u30fc\u30c9\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u3068\u304d\u306e\u307f\u4f7f\u7528\u3057\u307e\u3059\u3002
amAuthCert-eeh-debug-desc=\u30c7\u30d0\u30c3\u30b0\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
amAuthCert-ff-aliases-desc=\u8a3c\u660e\u66f8\u30e6\u30fc\u30b6\u30fc\u30a8\u30a4\u30ea\u30a2\u30b9
amAuthCert-debug.on=\u30aa\u30f3
amAuthCert-debug.off=\u30aa\u30d5
amAuthCert-debug.log=\u30ed\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8
emailAddr=emailAddr
emailAddrTag=\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9
noCert=\u30e6\u30fc\u30b6\u30fc\u8a3c\u660e\u66f8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
jssSockFactoryFail=JSS \u3067\u306e LDAP \u63a5\u7d9a\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f
NoCallbackHandler=\u5229\u7528\u3067\u304d\u308b\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30cf\u30f3\u30c9\u30e9\u304c\u3042\u308a\u307e\u305b\u3093
certificate=\u8a3c\u660e\u66f8
wrongLDAPServer=LDAP \u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30dd\u30fc\u30c8\u756a\u53f7\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
wrongStartDN=LDAP \u691c\u7d22\u958b\u59cb DN \u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noLDAPAttr=LDAP \u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306e\u5c5e\u6027\u540d\u306b\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noCRLAttr=CRL \u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306e\u5c5e\u6027\u540d\u306b\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noOtherAttr=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306e\u4ed6\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noURLCertAuth=URL \u8a3c\u660e\u66f8\u8a8d\u8a3c\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093\u3002

choiceNone=\u306a\u3057
choiceSimple=\u7c21\u6613
choiceCRAM-MD5=CRAM-MD5
choiceIssuerDN=\u767a\u884c\u8005 DN
choiceIssuerCN=\u767a\u884c\u8005 CN
choiceIssuer0=\u767a\u884c\u8005 O
choiceSerialNumber=\u30b7\u30ea\u30a2\u30eb\u756a\u53f7
choiceSubjectDN=\u5bfe\u8c61 DN
choiceSubjectCN=\u5bfe\u8c61 CN
choiceSubjectUID=\u5bfe\u8c61 UID
choiceSubject0=\u5bfe\u8c61 O
choiceEmail=\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9
choiceOther=\u305d\u306e\u4ed6
choiceRFC822Name=RFC822Name
choiceUPN=UPN
