#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amAuthLDAP_ja.properties,v 1.11 2009/12/26 03:51:44 cbasha Exp $
#

# Portions Copyrighted 2012-2015 ForgeRock AS.
# Portions Copyrighted 2014 Open Source Solution Technology Corporation
# Portions Copyrighted 2014 Nomura Research Institute, Ltd

onlinehelp.doc=ldapauth.html
authentication=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb
iplanet-am-auth-ldap-service-description=LDAP

UPerror=\u30e6\u30fc\u30b6\u30fc ID \u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u4e21\u65b9\u304c\u5fc5\u8981\u3067\u3059\u3002
classpathError=\u30af\u30e9\u30b9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30af\u30e9\u30b9\u30d1\u30b9\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NoServer=\u30b5\u30fc\u30d0\u30fc\u3068\u901a\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002
Naming=\u30cd\u30fc\u30df\u30f3\u30b0\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PasswordExp=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6709\u52b9\u671f\u9650: {0}
GraceLogins=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u6709\u52b9\u671f\u9650\u5207\u308c\u3067\u3059\u3001{0}\u56de\u306e\u7336\u4e88\u30ed\u30b0\u30a4\u30f3\u304c\u6b8b\u3063\u3066\u3044\u307e\u3059\u3002
TimeBeforeExpiration=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6709\u52b9\u671f\u9650: {0}
PasswordReset=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30ea\u30bb\u30c3\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
PasswdMismatch=\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u78ba\u8a8d\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
PasswordInvalid=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u73fe\u5728\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093\u3002
NewPasswordInvalid=\u65b0\u3057\u304f\u8a2d\u5b9a\u3057\u305f\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u73fe\u5728\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u306b\u6e96\u62e0\u3057\u3066\u3044\u307e\u305b\u3093\u3002
UPsame=\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5225\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u3082\u3046\u4e00\u5ea6\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
inPwdQual=\u65b0\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u306e\u8981\u4ef6\u3092\u6e80\u305f\u3057\u3066\u3044\u307e\u305b\u3093\u3002
pwdInHist=\u65b0\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u3001\u4ee5\u524d\u306b\u4f7f\u7528\u3055\u308c\u305f\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
pwdToShort=\u65b0\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u77ed\u3059\u304e\u307e\u3059\u3002
pwdToYoung=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u6700\u8fd1\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
PInvalid=\u5165\u529b\u3057\u305f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u7121\u52b9\u3067\u3059\u3002
PasswdSame=\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5225\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u3082\u3046\u4e00\u5ea6\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PasswdMinChars=\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u6307\u5b9a\u3059\u308b\u6587\u5b57\u6570\u304c\u8db3\u308a\u306a\u3044\u304b\u3001\u5909\u66f4\u306b\u5fc5\u8981\u306a\u671f\u9593\u3092\u6e80\u305f\u3057\u3066\u3044\u307e\u305b\u3093\u3002
a101=\u30d7\u30e9\u30a4\u30de\u30ea LDAP \u30b5\u30fc\u30d0\u30fc
a101.help=\u8a8d\u8a3c\u306b\u4f7f\u7528\u3059\u308b\u30d7\u30e9\u30a4\u30de\u30ea LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a101.help.txt=LDAP \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u8a8d\u8a3c\u7528\u306e\u30d7\u30e9\u30a4\u30de\u30ea\u30b5\u30fc\u30d0\u30fc\u3068\u3057\u3066\u3053\u306e\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\u5358\u4e00\u306e\u30a8\u30f3\u30c8\u30ea\u306f\u3001\u6b21\u306e\u5f62\u5f0f\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002:\
<br/><br/><code>LDAP \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\u8907\u6570\u306e\u30a8\u30f3\u30c8\u30ea\u306b\u3088\u308a\u3001 OpenAM \u30b5\u30fc\u30d0\u30fc\u3068 LDAP \u30b5\u30fc\u30d0\u30fc\u9593\u306e\u9023\u643a\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002\
\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059:<br/><br/><code>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d | \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\
\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30b5\u30a4\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u3042\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u5b8c\u5168\u540d\u3067\u3059\u3002
a102=\u30bb\u30ab\u30f3\u30c0\u30ea LDAP \u30b5\u30fc\u30d0\u30fc
a102.help=\u8a8d\u8a3c\u306b\u4f7f\u7528\u3055\u308c\u308b\u30bb\u30ab\u30f3\u30c0\u30ea\uff08\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\uff09 LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a102.help.txt=\u30d7\u30e9\u30a4\u30de\u30ea LDAP \u30b5\u30fc\u30d0\u30fc\u306b\u969c\u5bb3\u304c\u767a\u751f\u3057\u305f\u5834\u5408\u3001 LDAP \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30bb\u30ab\u30f3\u30c0\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u30d5\u30a7\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u3057\u307e\u3059\u3002\
\u5358\u4e00\u306e\u30a8\u30f3\u30c8\u30ea\u306f\u3001\u6b21\u306e\u5f62\u5f0f\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093:<br/><br/><code> LDAP \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\
\u8907\u6570\u306e\u30a8\u30f3\u30c8\u30ea\u306b\u3088\u308a\u3001 OpenAM \u30b5\u30fc\u30d0\u30fc\u3068 LDAP \u30b5\u30fc\u30d0\u30fc\u9593\u306e\u9023\u643a\u304c\u53ef\u80fd\u306b\u306a\u308a\u307e\u3059\u3002\
\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059:<br/><br/><code>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d | \u30b5\u30fc\u30d0\u30fc:\u30dd\u30fc\u30c8</code><br/><br/>\
<i>\u6ce8\u610f </i>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30b5\u30a4\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u3042\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u5b8c\u5168\u540d\u3067\u3059\u3002
a103=\u30e6\u30fc\u30b6\u30fc\u691c\u7d22\u306e\u958b\u59cb DN
a103.help=\u5f62\u5f0f: \u30b5\u30fc\u30d0\u30fc\u540d | \u691c\u7d22 DN<br>\u8907\u6570\u6307\u5b9a\u3059\u308b\u5834\u5408\u306f\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u3092\u30d7\u30ec\u30d5\u30a3\u30c3\u30af\u30b9\u3068\u3057\u3066\u4ed8\u3051\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a103.help.txt=\u5358\u4e00\u306e\u30b5\u30fc\u30d0\u30fc\u3060\u3051\u3092\u691c\u7d22\u3059\u308b\u30d9\u30fc\u30b9 DN \u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u591a\u91cd\u5316\u3057\u305f OpenAM \u30b5\u30fc\u30d0\u30fc\u3067\u306f\u3001\u691c\u7d22\u306b\u7570\u306a\u308b\u30d9\u30fc\u30b9 DN \u3092\u6301\u3064\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059:<br/><br/><code>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d | \u691c\u7d22 DN</code><br/><br/>\
<i>\u6ce8\u610f </i>\u30ed\u30fc\u30ab\u30eb\u30b5\u30fc\u30d0\u30fc\u540d\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30b5\u30a4\u30c8\u306e\u30ea\u30b9\u30c8\u306b\u3042\u308b\u30b5\u30fc\u30d0\u30fc\u306e\u5b8c\u5168\u540d\u3067\u3059\u3002
a104=\u30d0\u30a4\u30f3\u30c9\u30e6\u30fc\u30b6\u30fc DN
a104.help=LDAP \u30b5\u30fc\u30d0\u30fc\u3078\u306e\u8a8d\u8a3c\u306e\u305f\u3081\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u4f7f\u7528\u3059\u308b\u7ba1\u7406\u8005\u30e6\u30fc\u30b6\u30fc\u306e DN
a104.help.txt=LDAP \u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u30ea\u30bb\u30c3\u30c8\u306e\u3088\u3046\u306a\u6a5f\u80fd\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u7ba1\u7406\u8005\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u5fc5\u8981\u3068\u3057\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i><code>cn=Directory Manager</code> \u306f\u5b9f\u904b\u7528\u306e\u30b7\u30b9\u30c6\u30e0\u3067\u306f\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
a104.help.uri=#tbd
a105=\u30d0\u30a4\u30f3\u30c9\u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9
a105.help=\u7ba1\u7406\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u307e\u3059\u3002
a106=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u53d6\u5f97\u306b\u4f7f\u7528\u3059\u308b\u5c5e\u6027
a106.help=LDAP \u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u8a8d\u8a3c\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u3053\u306e\u5c5e\u6027\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a106.help.txt=\u8a8d\u8a3c\u6e08\u307f\u30e6\u30fc\u30b6\u30fc\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u3067\u3059\u3002\u901a\u5e38\u3001\u3053\u308c\u306f\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u3068\u540c\u3058\u306b\u306a\u308a\u307e\u3059\u3002\
\u5024\u306f\u8a8d\u8a3c\u306b\u4f7f\u7528\u3055\u308c\u308b\u30e6\u30fc\u30b6\u30fc\u306e\u540d\u524d\u306b\u306a\u308a\u307e\u3059\u3002
a107=\u8a8d\u8a3c\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u306e\u691c\u7d22\u306b\u4f7f\u7528\u3059\u308b\u5c5e\u6027
a107.help=\u3053\u306e\u30ea\u30b9\u30c8\u3067\u6307\u5b9a\u3055\u308c\u305f\u5c5e\u6027\u306b\u3088\u308a\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u304c\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002
a107.help.txt=uid \u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f\u3001\u691c\u7d22\u30d5\u30a3\u30eb\u30bf <code>uid=<i>user</i></code> \u3067\u8868\u73fe\u3057\u307e\u3059\u3002\
 uid \u3068 cn \u306a\u3069\u306e\u3088\u3046\u306b\u8907\u6570\u306e\u5024\u304c\u5b58\u5728\u3059\u308b\u5834\u5408\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u6b21\u306e\u3088\u3046\u306a\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002 <code>(|(uid=<i>user</i>)(cn=<i>user</i>))</code>
a108=\u30e6\u30fc\u30b6\u30fc\u691c\u7d22\u30d5\u30a3\u30eb\u30bf
a108.help=\u3053\u306e\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u306f\u3001\u6a19\u6e96\u306e\u30e6\u30fc\u30b6\u30fc\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u306b\u4ed8\u52a0\u3055\u308c\u307e\u3059\u3002
a108.help.txt=\u3053\u306e\u5c5e\u6027\u306f\u3001\u6a19\u6e96\u306e\u30d5\u30a3\u30eb\u30bf\u306b\u30ab\u30b9\u30bf\u30e0\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u3092\u8ffd\u52a0\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002\u305f\u3068\u3048\u3070: \
<code>(objectClass=person)</code> \u306f\u3001\u6b21\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u691c\u7d22\u30d5\u30a3\u30eb\u30bf\u306b\u306a\u308a\u307e\u3059\u3002<br/><br/>\
<code>(&(uid=<i>user</i>)(objectClass=person))</code>
a109=\u691c\u7d22\u7bc4\u56f2
a109.help=\u4e00\u81f4\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u691c\u7d22\u3059\u308b Directory Server \u306e\u968e\u5c64\u3002
a109.help.txt=\u3053\u306e\u5c5e\u6027\u306f\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u3069\u306e\u3088\u3046\u306b\u691c\u7d22\u3055\u308c\u308b\u304b\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002<br/><br/>\
<ul><li><code>\u30aa\u30d6\u30b8\u30a7\u30af\u30c8</code>: \u30d9\u30fc\u30b9 DN \u306e\u307f\u304c\u691c\u7d22\u3055\u308c\u307e\u3059</li>\
<li><code>1\u30ec\u30d9\u30eb</code>: \u4e00\u3064\u306e\u968e\u5c64\u4ee5\u4e0b\uff08\u304b\u3064\u30d9\u30fc\u30b9 DN \u3067\u306f\u306a\u3044\uff09\u304c\u691c\u7d22\u3055\u308c\u307e\u3059</li>\
<li><code>\u30b5\u30d6\u30c4\u30ea\u30fc</code>: \u30d9\u30fc\u30b9 DN \u306e\u4e0b\u306e\u3059\u3079\u3066\u306e\u30ec\u30d9\u30eb\u304c\u691c\u7d22\u3055\u308c\u307e\u3059</li></ul>
a111=\u30e6\u30fc\u30b6\u30fc DN \u3092\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u8fd4\u3059
a111.help=\u8a8d\u8a3c\u30d7\u30ea\u30f3\u30b7\u30d1\u30eb\u3068\u3057\u3066\u3001 DN \u3068\u30e6\u30fc\u30b6\u30fc\u540d\u306e\u3069\u3061\u3089\u304c\u8fd4\u3055\u308c\u308b\u304b\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
## Note level should have the highest
## number for i18N key since it should
## be the last attribute when viewed in
## the adminconsole
a500=\u8a8d\u8a3c\u30ec\u30d9\u30eb
a500.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a500.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u304c\u6700\u4f4e\u3067\u3059\u3002
a114=\u30e6\u30fc\u30b6\u30fc\u4f5c\u6210\u5c5e\u6027
a114.help=\u52d5\u7684\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3059\u308b\u305f\u3081\u3001\u5916\u90e8\u5c5e\u6027\u3078\u306e\u30ed\u30fc\u30ab\u30eb\u5c5e\u6027\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a114.help.txt=\u52d5\u7684\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u4f5c\u6210\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408; \u3053\u306e\u6a5f\u80fd\u306b\u3088\u308a\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u6e08\u307f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u53d6\u5f97\u3057\u305f\u5c5e\u6027/\u5024\u3068\u3001\
\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u5185\u306e\u4e00\u81f4\u3059\u308b\u30a2\u30ab\u30a6\u30f3\u30c8\u306b\u30d7\u30ed\u30d3\u30b8\u30e7\u30cb\u30f3\u30b0\u3055\u308c\u308b\u5c5e\u6027/\u5024\u3068\u3092\u30de\u30c3\u30d4\u30f3\u30b0\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
<br/><br/>\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059: <br/><br/><code>\u30ed\u30fc\u30ab\u30eb\u5c5e\u60271|\u5916\u90e8\u5c5e\u60271</code>
a115=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6700\u5c0f\u6841\u6570
a115.help=\u30e6\u30fc\u30b6\u30fc\u304c\u8a8d\u8a3c\u306e\u4e00\u90e8\u3068\u3057\u3066\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30ea\u30bb\u30c3\u30c8\u3057\u305f\u3068\u304d\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6700\u5c0f\u6841\u6570\u5236\u9650\u304c\u5f37\u5236\u3055\u308c\u307e\u3059\u3002
a115.help.txt=\u30e6\u30fc\u30b6\u30fc\u304c\u8a8d\u8a3c\u30d7\u30ed\u30bb\u30b9\u306e\u4e00\u90e8\u3068\u3057\u3066\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30ea\u30bb\u30c3\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u3001\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6700\u5c0f\u9577\u3092\u5f37\u5236\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
\u3053\u308c\u306f\u3001 LDAP \u30b5\u30fc\u30d0\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u9577\u3055\u306e\u5236\u5fa1\u304b\u3089\u72ec\u7acb\u3057\u3066\u3044\u307e\u3059\u3002\
\u5916\u90e8 LDAP \u30b5\u30fc\u30d0\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u304c\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u9577\u3055\u3092\u5f37\u5236\u3057\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u6df7\u4e71\u3092\u907f\u3051\u308b\u305f\u3081\u306b\u3053\u306e\u5024\u30920\u306b\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a116=LDAP Behera \u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u30b5\u30dd\u30fc\u30c8
a116.help=\u65b0\u3057\u3044 LDAP \u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u306e\u30b5\u30dd\u30fc\u30c8\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a116.help.txt=LDAP Behera \u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u306f\u3001 OpenDJ \u306a\u3069\u306e\u3088\u3046\u306a\u65b0\u3057\u3044 LDAP \u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u3002\
\u3053\u306e\u6a5f\u80fd\u304c\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u3001\u53e4\u3044 Netscape \u306e VCHU \u30d1\u30b9\u30ef\u30fc\u30c9\u30dd\u30ea\u30b7\u30fc\u6a19\u6e96\u304c\u9069\u7528\u3055\u308c\u307e\u3059\u3002
a117=\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u8a3c\u660e\u66f8\u3092\u4fe1\u983c\u3059\u308b
a117.help=\u3059\u3079\u3066\u306e\u8a3c\u660e\u66f8\u3092\u4fe1\u983c\u3059\u308b <code>X509TrustManager</code> \u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a117.help.txt=\u3053\u306e\u6a5f\u80fd\u306b\u3088\u308a\u3001 LDAP \u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u81ea\u5df1\u7f72\u540d\u8a3c\u660e\u66f8\u3084\u7121\u52b9\u306a\u8a3c\u660e\u66f8(\u7121\u52b9\u306a\u30db\u30b9\u30c8\u540d\u306a\u3069)\u306b\u3088\u3063\u3066\u4fdd\u8b77\u3055\u308c\u305f \
LDAP \u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u901a\u5e38\u306e\u8a3c\u660e\u66f8\u691c\u8a3c\u30d7\u30ed\u30bb\u30b9\u3092\u56de\u907f\u3059\u308b\u3088\u3046\u306b\u6ce8\u610f\u3057\u3066\u3053\u306e\u6a5f\u80fd\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a118=LDAP \u63a5\u7d9a\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u9593\u9694
a118.help=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b OpenAM \u304c\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u8981\u6c42\u3092\u9001\u4fe1\u3059\u308b\u983b\u5ea6\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
a118.help.txt=\u3053\u306e\u8a2d\u5b9a\u306f\u3001 OpenAM \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u691c\u7d22\u8981\u6c42\u3092\u9001\u4fe1<b>\u3059\u3079\u304d</b>\u983b\u5ea6\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002 \
\u63a5\u7d9a\u304c\uff08\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30a8\u30e9\u30fc\u306a\u3069\u306b\u8d77\u56e0\u3057\u3066\uff09\u5fdc\u7b54\u3057\u306a\u304f\u306a\u3063\u305f\u5834\u5408\u3001\u554f\u984c\u304c\u691c\u51fa\u3055\u308c\u308b\u307e\u3067\u306b\u3053\u306e\u9593\u9694\u306e\u6642\u9593\u304c\u304b\u304b\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002 \
\u6b63\u78ba\u306a\u9593\u9694\u3092\u5b9a\u7fa9\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u6642\u9593\u5358\u4f4d\u30d1\u30e9\u30e1\u30fc\u30bf\u3068\u3068\u3082\u306b\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30bc\u30ed\u307e\u305f\u306f\u8ca0\u306e\u5024\u306f\u3001\
\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u8981\u6c42\u3092\u7121\u52b9\u306b\u3059\u308b\u3053\u3068\u306b\u306a\u308a\u307e\u3059\u3002
a119=LDAP \u63a5\u7d9a\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u6642\u9593\u5358\u4f4d
a119.help=\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u9593\u9694\u306e\u8a2d\u5b9a\u306b\u5bfe\u5fdc\u3059\u308b\u6642\u9593\u5358\u4f4d\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
a119.help.txt=\u3053\u306e\u8a2d\u5b9a\u306f\u3001 OpenAM \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306b\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u691c\u7d22\u8981\u6c42\u3092\u9001\u4fe1<b>\u3059\u3079\u304d</b>\u983b\u5ea6\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002 \
\u63a5\u7d9a\u304c\uff08\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30a8\u30e9\u30fc\u306a\u3069\u306b\u8d77\u56e0\u3057\u3066\uff09\u5fdc\u7b54\u3057\u306a\u304f\u306a\u3063\u305f\u5834\u5408\u3001\u554f\u984c\u304c\u691c\u51fa\u3055\u308c\u308b\u307e\u3067\u306b\u3053\u306e\u9593\u9694\u306e\u6642\u9593\u304c\u304b\u304b\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002 \
\u6b63\u78ba\u306a\u9593\u9694\u3092\u5b9a\u7fa9\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30cf\u30fc\u30c8\u30d3\u30fc\u30c8\u9593\u9694\u30d1\u30e9\u30e1\u30fc\u30bf\u3068\u3068\u3082\u306b\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
a1191=\u79d2
a1192=\u5206
a1193=\u6642\u9593
a120=LDAP \u64cd\u4f5c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
a120.help=OpenAM \u304c\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306e\u5fdc\u7b54\u3092\u5f85\u3064\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u6642\u9593\u3092\u79d2\u5358\u4f4d\u3067\u5b9a\u7fa9\u3057\u307e\u3059 - 0 \u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u306a\u3044\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002
a120.help.txt=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u306e\u30db\u30b9\u30c8\u304c\u5b8c\u5168\u306b\u30c0\u30a6\u30f3\u3057\u3066\u3044\u308b\u304b TCP \u63a5\u7d9a\u304c\u7121\u52b9\u306b\u306a\u3063\u305f\u5834\u5408\u3001OS \u3084 JVM \u304b\u3089\u306e \
\u64cd\u4f5c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c\u9069\u7528\u3055\u308c\u308b\u307e\u3067 OpenAM \u306f\u5f85\u6a5f\u3057\u307e\u3059\u3002 \u3057\u304b\u3057\u3001\u3053\u306e\u8a2d\u5b9a\u306f OpenAM \u81ea\u8eab\u306e\u4e2d\u3067\u3088\u308a\u7d30\u304b\u3044\u5236\u5fa1\u3092\u53ef\u80fd\u306b\u3057\u307e\u3059\u3002 \
\u5024 <code>0</code> \u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c OpenAM \u306e\u30ec\u30d9\u30eb\u3067\u9069\u7528\u3055\u308c\u3066\u3044\u306a\u3044\u3053\u3068\u3068\u3001JVM \u3084 OS \u304b\u3089\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c\u9069\u7528\u3055\u308c\u308b\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002
AcctInactive=\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u304b\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3059\u308b\u304b\u3001\u30ed\u30c3\u30af\u3092\u89e3\u9664\u3057\u3066\u3001\u7d9a\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
#ExceedRetryLimit=Exceed password retry limit. Please try later.
ExceedRetryLimit=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
noUserMatchFound=\u30e6\u30fc\u30b6\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
multipleUserMatchFound=\u3053\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u4e00\u81f4\u3059\u308b\u9805\u76ee\u304c\u8907\u6570\u3042\u308a\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u554f\u984c\u3092\u89e3\u6c7a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
Nosecserver=\u30bb\u30ab\u30f3\u30c0\u30ea\u30b5\u30fc\u30d0\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

choiceObject=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8
choiceOneLevel=1 \u30ec\u30d9\u30eb
choiceSubTree=\u30b5\u30d6\u30c4\u30ea\u30fc

HostInvalid=\u7121\u52b9\u306a\u30db\u30b9\u30c8\u540d\u3002
HostUnknown=\u4e0d\u660e\u306a\u30db\u30b9\u30c8 {0}\u3002
SchBaseInvalid=\u7121\u52b9\u306a\u691c\u7d22\u30d9\u30fc\u30b9\u3002
PwdInvalid=\u7121\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
FConnect=\u63a5\u7d9a\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
CredInvalid=\u7121\u52b9\u306a\u8a3c\u660e\u60c5\u5831\u3002
UsrNotExist=\u30e6\u30fc\u30b6\u30fc\u304c\u5b58\u5728\u3057\u307e\u305b\u3093:
UNAttr=\u30e6\u30fc\u30b6\u30fc\u30cd\u30fc\u30df\u30f3\u30b0\u5c5e\u6027\u304c null \u3067\u3059\u3002
USchAttr=\u30e6\u30fc\u30b6\u30fc\u691c\u7d22\u5c5e\u6027\u306b\u306f\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5024\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
days=\u65e5
hours=\u6642\u9593
minutes=\u5206
seconds=\u79d2
i18nTrue=\u6709\u52b9
i18nFalse=\u7121\u52b9

