<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Atributos del Agente de detecci&#243;n - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="agentconfig.discoveryagentprofile"></a><h4>Atributos del Agente de detecci&#243;n</h4>
<p>El perfil del agente de detecci&#243;n contiene la configuraci&#243;n de la entidad
emisora de confianza utilizada por el cliente/perfil de servicios web con el
fin de comunicarse con el servicio de detecci&#243;n de Liberty para el
registro y las b&#250;squedas de servicios web, y para obtener las credenciales
de seguridad.</p>

<a name="gglro"></a><h5>Grupo</h5>
<p>El mecanismo de grupo permite definir un conjunto de tipos de agentes
similares. Debe definirse el grupo antes de incluir un agente espec&#237;fico en
un conjunto. </p>

<a name="gglpn"></a><h5>Mot de passe</h5>
<p>Define la contrase&#241;a del Agente de detecci&#243;n.</p>

<a name="ggloy"></a><h5>Confirmar contrase&#241;a</h5>
<p> Confirme la contrase&#241;a.</p>

<a name="ggtwd"></a><h5>Estado</h5>
<p>Define si el agente estar&#225; activo o inactivo en el sistema. 
De forma predeterminada esta opci&#243;n est&#225; establecida en Activo, lo que indica
que el agente participar&#225; a la hora de proteger solicitudes de servicios
web procedentes de clientes de servicios web, y que validar&#225; respuestas de
servicios web procedentes de un proveedor de servicios web.</p>

<a name="ggloo"></a><h5>Ubicaci&#243;n del dep&#243;sito de configuraci&#243;n de agentes</h5>
<p>Este atributo define la ubicaci&#243;n del agente del dep&#243;sito de configuraci&#243;n para
el agente de detecci&#243;n. </p>

<a name="gglqv"></a><h5>Alias de clave privada</h5>
<p>Este atributo define el alias de clave privada del certificado que se
ha utilizado para firmar la solicitud del servicio web, o descifrar la
respuesta de servicios web.</p>

<a name="gglny"></a><h5>Punto final del servicio de detecci&#243;n</h5>
<p>Este atributo define el punto final del servicio de detecci&#243;n con el
que el cliente de la entidad emisora de confianza establece comunicaciones para
los registros y las b&#250;squedas de servicios.</p>

<a name="gglra"></a><h5>Punto final del servicio web de autenticaci&#243;n</h5>
<p>Este atributo define el punto final del servicio de autenticaci&#243;n que utiliza
el cliente de servicios web para la autenticaci&#243;n mediante el token SSO
del usuario final con el fin de recibir la oferta de recursos
del servicio de detecci&#243;n (denominada tambi&#233;n oferta de recursos de bootstrapping).</p>
<br/>

</body>
</html>
