<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para modificar un perfil de c&#237;rculo de confianza - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fsauthdomainsedit"></a><h4>Para modificar un perfil de c&#237;rculo de confianza</h4><a name="indexterm-57"></a><p>Siga este procedimiento para editar los atributos generales configurados de un c&#237;rculo
de confianza existente o para agregar proveedores a &#233;ste. El punto de
partida es C&#237;rculo de confianza en la interfaz Federaci&#243;n.</p><ol>
<li><b>Haga clic en el nombre de un c&#237;rculo de confianza configurado para
modificar su perfil o para agregarle proveedores.</b><p>Aparece la p&#225;gina Editar c&#237;rculo de confianza.</p></li>
<li><b>Escriba los nuevos valores o edite los valores existentes para los atributos
generales del c&#237;rculo de confianza:</b><dl><dt>Nombre</dt>
<dd><p>El valor est&#225;tico de este atributo es el nombre proporcionado al crear el c&#237;rculo de confianza.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>El valor de este atributo es una descripci&#243;n del c&#237;rculo de confianza. Puede modificar la descripci&#243;n introducida anteriormente si es necesario.</p></dd>
<dt>URL del servicio de escritor de IDFF</dt>
<dd><p>Este atributo especifica la ubicaci&#243;n del servicio que escribe la cookie del dominio com&#250;n. La URL presenta el formato <tt><b> http://</tt><i>common-domain-host</i><tt>:</tt><i>port</i><tt>/common/idffwriter </b></tt> .</p></dd>
<dt>URL del servicio de lector de IDFF</dt>
<dd><p>Este atributo especifica la ubicaci&#243;n del servicio que lee la cookie del dominio com&#250;n. La URL presenta el formato <tt><b> http://</tt><i>common-domain-host</i><tt>:</tt><i>port</i><tt>/common/idffreader </b></tt> .</p></dd>
<dt>URL de escritor de SAML2</dt>
<dd><p>Este atributo especifica la ubicaci&#243;n del servicio de escritor de SAML2 que escribe la cookie en el dominio com&#250;n. La URL presenta el formato <tt><b>http://</tt><i>common-domain-host</i><tt>:</tt><i> port</i><tt>/common/saml2writer</b></tt></p></dd>
<dt>URL de lector de SAML2</dt>
<dd><p>Este atributo especifica la ubicaci&#243;n del servicio de escritor de SAML2 que escribe la cookie en el dominio com&#250;n. La URL presenta el formato <tt><b>http://</tt><i>common-domain-host</i><tt>:</tt><i> port</i><tt>/common/saml2reader</b></tt></p></dd>
<dt>Estado</dt>
<dd><p>El estado predeterminado es &#8220;Activo&#8221; (Active). Si se selecciona la opci&#243;n Inactivo, se deshabilita la comunicaci&#243;n con el c&#237;rculo de confianza.</p></dd>
</dl>
</li>
<li><b>Elija uno o varios de los proveedores disponibles y haga clic en
la flecha Agregar para seleccionarlos.</b><p>La lista proporcionada contiene los nombres de las entidades creadas y rellenadas
con proveedores. Para obtener m&#225;s informaci&#243;n, consulte <a href="federation.fsauthdomainsselectprovider.html">Para agregar proveedores a un c&#237;rculo de confianza</a>.</p></li>
<li><b>Haga clic en Guardar para completar la operaci&#243;n.</b></li></ol>
<br/>

</body>
</html>
