#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amPasswordResetModuleMsgs.properties,v 1.5 2009/02/13 08:43:19 Pierrot Exp $
#
#

pwResetSuccess.title=Password Reset Confirmation
pwConsole.title=OpenSSO (Password Reset)
userValidate.title=Password Reset User Validation
pwQuestion.title=Password Question for {0}

#
# buttons
#
next.button=Next
previous.button=Previous
ok.button=OK

#
# message titles
#
error.title=Error
invalidURL.title=Invalid URL
uncaughtException.title=Error

#
# message and error
#
userNotExists.message=The password cannot be reset for this user.
logUserNotExists.message=An attempt was made to reset the password of an invalid user, {0}.
multipleUsersExists.message=There is more than one user matching the specified value. Enter a different value, or contact your administrator for assistance.
passResetError.message=Cannot change your password. Contact your administrator for assistance.
emailNotify.message=An email has been sent to your account with your new password.
wrongAnswer.message=Incorrect answer entered.
resetPassMail.message=Your OpenSSO password was changed to:  {0}
noQuestions.message=There are no questions configured for you.
noAnswers.message=An answer for the secret questions does not exist.
attemptEmail.message=An attempt was made to reset your password. If this was not done by you, contact your administrator.
resetSubject.message=OpenSSO Password Reset
attemptSubject.message=OpenSSO Password Reset
pwResetDisabled.message=The Password Reset Service is currently disabled. Contact your administrator.
missingUserAttr.message=Enter a value.
missingAnswer.message=Enter values for all fields.
invalidURL.message=You have entered an invalid URL.
uncaughtException.message=An error occurred while processing this request. Contact your administrator.
noEmail.message=We are unable to send password to you. Contact your administrator.
userNotActive.message=This user is not active. Contact your administrator.
userAccountExpired.message=User account is expired. Contact your administrator.
sendEmailFailed.message=Your password has been reset but we are unable to send it to you. Contact your administrator.

#
# labels
#
fromAddress.label=<Password-Administrator>
sunLogo.label=Sun Microsystems Logo
product.label=OpenSSO
javaLogo.label=Sun Java System Software

#
# copyright text
#
copyright.text=Copyright \u00a9 2008 Sun Microsystems, Inc.  All rights reserved.  Sun Microsystems, Inc. has intellectual property rights relating to technology embodied in the product that is described in this document. In particular, and without limitation, these intellectual property rights may include one or more of the U.S. patents listed at http://www.sun.com/patents and one or more additional patents or pending patent applications in the U.S. and in other countries.U.S. Government Rights - Commercial software.  Government users are subject to the Sun Microsystems, Inc. standard license agreement and applicable provisions of the FAR and its supplements.  Use is subject to license terms.  This distribution may include materials developed by third parties.Sun,  Sun Microsystems and  the Sun logo are trademarks or registered trademarks of Sun Microsystems, Inc. in the U.S. and other countries.<br /><br />Copyright \u00a9 2008 Sun Microsystems, Inc. Tous droits r\u00e9serv\u00e9s.   Sun Microsystems, Inc. d\u00e9tient les droits de propriete intellectuels relatifs \u00e0 la technologie incorpor\u00e9e dans le produit d\u00e9crit dans ce document. En particulier, et ce sans limitation, ces droits de propri\u00e9t\u00e9 intellectuelle peuvent inclure un ou plusieurs des brevets am\u00e9ricains r\u00e9pertori\u00e9s \u00e0 l'adresse http://www.sun.com/patents, et un ou plusieurs brevets suppl\u00e9mentaires ou demandes de brevet en instance aux \u00c9tats-Unis et dans d'autres pays. Soumis \u00e0 la l\u00e9gislation am\u00e9ricaine - Logiciel commercial.  Les utilisateurs gouvernementaux sont soumis au contrat de licence standard de Sun Microsystems, Inc. et aux dispositions applicables du FAR et de ses compl\u00e9ments.    L'utilisation est soumise \u00e0 des conditions de licence.  Cette distribution peut comprendre des composants d\u00e9velopp\u00e9s par des tiers. Sun, Sun Microsystems et le logo Sun sont des marques de fabrique ou des marques d\u00e9pos\u00e9es de Sun Microsystems, Inc. aux \u00c9tats-Unis et dans d'autres pays.

################################################################################
#
# logging messages
#
accountInactive.message=Account is not active for user {0}.
accountExpired.message=Account has expired for user {0}.
accountLocked.message=Account is locked for user {0}.
accountLockout.message=Password Reset for {0} has been deactivated due to successive password reset failures.
pwResetSuccess.message=Password was changed for user {0}.
pwResetFail.message=An attempt to reset password for user {0} was unsuccessful.

################################################################################
#
# Password Reset lockout messages
#
lockOutEmailFrom=<Password-Administrator>
lockOutEmailSub=WARNING: Password Reset Lockout Notice
lockoutMsg.message=Password Reset has been deactivated for this account due to successive password reset failures.
lockOutEmailMsg=Password Reset for {0} has been deactivated due to successive password reset failures.
lockoutWarning.message=Incorrect answer entered. Lockout will occur after next {0} answer failure(s).
