#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amSession_ja.properties,v 1.11 2009/12/26 03:51:45 cbasha Exp $
#

# Portions Copyrighted 2012 ForgeRock Inc
# Portions Copyrighted 2012 Open Source Solution Technology Corporation

onlinehelp.doc=session.html
unexpectedResponse=\u4e88\u671f\u3057\u306a\u3044\u6570\u306e\u5fdc\u7b54\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
unexpectedSession=\u4e88\u671f\u3057\u306a\u3044\u6570\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002
invalidSessionID=\u7121\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3 ID\u3002
invalidSessionState=\u30bb\u30c3\u30b7\u30e7\u30f3\u72b6\u614b\u304c\u7121\u52b9\u3067\u3059\u3002
protectedPropertyNoClientToken=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8b58\u5225\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u5834\u5408\u306f\u3001\u4fdd\u8b77\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
protectedPropertyNoSSOTokenMgrInstance=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30c8\u30fc\u30af\u30f3\u3092\u691c\u8a3c\u3059\u308b\u305f\u3081\u306e SSOTokenManager \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u53d6\u5f97\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
protectedPropertyInvalidClientToken=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30c8\u30fc\u30af\u30f3\u304c\u7121\u52b9\u306a\u305f\u3081\u3001\u4fdd\u8b77\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
protectedPropertyNoAdminToken=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30c8\u30fc\u30af\u30f3\u3092\u691c\u8a3c\u3059\u308b\u305f\u3081\u306e\u7ba1\u7406\u8005\u30c8\u30fc\u30af\u30f3\u3092\u53d6\u5f97\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
protectedPropertyNoPermission=\u4fdd\u8b77\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3059\u308b\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u3042\u308a\u307e\u305b\u3093\u3002\u62d2\u5426\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u66f4\u65b0\u8981\u6c42\u3002
unexpectedEOF=\u4e88\u671f\u3057\u306a\u3044\u30d5\u30a1\u30a4\u30eb\u306e\u7d42\u308f\u308a\u3002
readRandomDeviceFailed=\u30e9\u30f3\u30c0\u30e0\u30c7\u30d0\u30a4\u30b9\u306e\u8aad\u307f\u53d6\u308a\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
noPrivilege=\u3053\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306e\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
sessionNotObtained=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u53d6\u5f97\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
unknownRequestMethod=\u4e0d\u660e\u306a\u8981\u6c42\u30e1\u30bd\u30c3\u30c9\u3067\u3059\u3002
iplanet-am-session-service-description=\u30bb\u30c3\u30b7\u30e7\u30f3
sessionTimedOut=\u30bb\u30c3\u30b7\u30e7\u30f3\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3002
sessionNotTimedOut=\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
propertyMustBeSet=com.iplanet.am.localserver.{protocol,host,port} \u306f\u3001\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u30e2\u30fc\u30c9\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
restrictionViolation=\u5236\u9650\u4ed8\u304d\u30c8\u30fc\u30af\u30f3\u3092\u4e0d\u6b63\u306b\u4f7f\u7528\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002
appTokenInvalid=\u671f\u9650\u5207\u308c\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30c8\u30fc\u30af\u30f3\u306f\u7121\u52b9\u3067\u3059\u3002
emptyTrustedSourceList=\u4fe1\u983c\u30bd\u30fc\u30b9\u30ea\u30b9\u30c8\u307e\u305f\u306f\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u30b5\u30fc\u30d0\u30fc\u30ea\u30b9\u30c8\u306b\u30a8\u30f3\u30c8\u30ea\u304c\u3042\u308a\u307e\u305b\u3093\u3002
unsupportedFunction=\u95a2\u6570\u304c\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
SessionTableNotFound=\u30bb\u30c3\u30b7\u30e7\u30f3\u30b9\u30c8\u30a2\u306b\u30bb\u30c3\u30b7\u30e7\u30f3\u30c6\u30fc\u30d6\u30eb\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
getValidSessionsError=\u6307\u5b9a\u3057\u305f\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u6709\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
a101=\u6700\u5927\u30bb\u30c3\u30b7\u30e7\u30f3\u6642\u9593
a101.help=(\u5206)
a102=\u6700\u5927\u30a2\u30a4\u30c9\u30eb\u6642\u9593
a102.help=(\u5206)
a103=\u6700\u5927\u30ad\u30e3\u30c3\u30b7\u30e5\u6642\u9593
a103.help=(\u5206)
a104=\u30bb\u30c3\u30b7\u30e7\u30f3\u30b5\u30fc\u30d3\u30b9\u306e\u72b6\u614b
a105=\u691c\u7d22\u7d50\u679c\u306e\u6700\u5927\u6570
a105.help=\u5341\u5206\u306a\u30b7\u30b9\u30c6\u30e0\u30ea\u30bd\u30fc\u30b9\u304c\u5272\u308a\u5f53\u3066\u3089\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u306e\u5c5e\u6027\u306b\u5927\u304d\u306a\u5024 (1000 \u3088\u308a\u5927\u304d\u3044) \u3092\u8a2d\u5b9a\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
a106=\u691c\u7d22\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
a106.help=(\u79d2)
a107=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc
a108=\u30bb\u30c3\u30b7\u30e7\u30f3\u30b9\u30c8\u30a2\u30e6\u30fc\u30b6\u30fc
a109=\u30bb\u30c3\u30b7\u30e7\u30f3\u30b9\u30c8\u30a2\u30d1\u30b9\u30ef\u30fc\u30c9
a110=\u30bb\u30c3\u30b7\u30e7\u30f3\u30af\u30e9\u30b9\u30bf\u30b5\u30fc\u30d0\u30fc\u30ea\u30b9\u30c8
a111=\u6700\u5927\u5f85\u3061\u6642\u9593
a111.help=\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u53d6\u5f97\u6642\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8 (\u30df\u30ea\u79d2\u5358\u4f4d) \u3092\u8aad\u307f\u53d6\u308a\u307e\u3059\u3002
a112=JDBC \u30c9\u30e9\u30a4\u30d0\u5b9f\u88c5\u30af\u30e9\u30b9\u540d
a113=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 URL
a114=\u6700\u5c0f\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba
a115=\u6700\u5927\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba
a116=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5909\u66f4\u901a\u77e5\u3092\u6709\u52b9
a117=\u5272\u308a\u5f53\u3066\u5236\u9650\u3092\u6709\u52b9
a118=\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u30e6\u30fc\u30b6\u30fc\u30bb\u30c3\u30b7\u30e7\u30f3
a118.help=\u30e6\u30fc\u30b6\u30fc\u306b\u8a31\u53ef\u3055\u308c\u3066\u3044\u308b\u4e26\u884c\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u6700\u5927\u6570\u3002
a119=\u5272\u308a\u5f53\u3066\u5236\u9650\u306e\u8aad\u307f\u53d6\u308a\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
a119.help=\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u53d6\u5f97\u306e\u305f\u3081\u306e\u6700\u5927\u5f85\u3061\u6642\u9593 (\u30df\u30ea\u79d2\u5358\u4f4d) \u3002
a119b=\u30bb\u30c3\u30b7\u30e7\u30f3\u5236\u9650\u304c\u3044\u3063\u3071\u3044\u306b\u306a\u3063\u305f\u5834\u5408\u306b\u751f\u3058\u308b\u52d5\u4f5c
a119b.help=DENY_ACCESS (\u65b0\u3057\u3044\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u4f5c\u6210\u8981\u6c42\u304c\u62d2\u5426\u3055\u308c\u308b)<br/>DESTROY_NEXT_EXPIRING (\u6b21\u306e\u6709\u52b9\u671f\u9650\u5207\u308c\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7834\u68c4\u3055\u308c\u308b)<br/>DESTROY_OLDEST_SESSION (\u6700\u3082\u53e4\u3044\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7834\u68c4\u3055\u308c\u308b)<br/>DESTROY_OLD_SESSIONS (\u4ee5\u524d\u306e\u3059\u3079\u3066\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7834\u68c4\u3055\u308c\u308b)
a119c=\u30bb\u30c3\u30b7\u30e7\u30f3\u30ea\u30dd\u30b8\u30c8\u30ea\u304c\u30c0\u30a6\u30f3\u3057\u3066\u3044\u308b\u6642\u306b\u30e6\u30fc\u30b6\u30fc\u306e\u30ed\u30b0\u30a4\u30f3\u3092\u62d2\u5426\u3059\u308b
a119c.help=\u3053\u306e\u5c5e\u6027\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u5236\u9650\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u6709\u52b9\u3068\u306a\u308a\u307e\u3059\u3002
a120=\u901a\u77e5\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
a120.help=\u3053\u308c\u3089\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5909\u66f4\u6642\u306b\u901a\u77e5\u3092\u9001\u4fe1\u3057\u307e\u3059\u3002
a121=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u304c\u6709\u52b9
a121b=DN \u5236\u9650\u306e\u307f\u6709\u52b9
a121b.help=\u3053\u306e\u5c5e\u6027\u306f\u3001Cookie \u306e\u30cf\u30a4\u30b8\u30e3\u30c3\u30af\u8efd\u6e1b\u30e2\u30fc\u30c9\u3067\u5236\u9650\u3092\u8a2d\u3051\u3066\u3044\u308b\u3068\u304d\u306b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304b\u3089 IP \u30a2\u30c9\u30ec\u30b9\u3092\u53d7\u3051\u4ed8\u3051\u308b\u3053\u3068\u306b\u5bfe\u3057\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u53b3\u683c\u306a DN \u30c1\u30a7\u30c3\u30af\u3092\u5b9f\u884c\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a122=\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u8abf\u6574\u306e\u6709\u52b9\u5316
a123=\u30bb\u30c3\u30b7\u30e7\u30f3\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u30cf\u30f3\u30c9\u30e9\u306e\u5b9f\u88c5
a123.help=\u30bb\u30c3\u30b7\u30e7\u30f3\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u30cf\u30f3\u30c9\u30e9\u306e\u5b9f\u88c5\u3092\u30ea\u30b9\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 impl \u30af\u30e9\u30b9\u306e\u5b8c\u5168\u4fee\u98fe\u540d\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a124=\u30bb\u30c3\u30b7\u30e7\u30f3\u6301\u7d9a\u3068\u9ad8\u53ef\u7528\u6027\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u6709\u52b9\u5316
a124.help=\u6709\u52b9\u306b\u3059\u308b\u3068\u3001\u30d5\u30eb\u30bb\u30c3\u30b7\u30e7\u30f3\u6301\u7d9a\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u3055\u3089\u306b\u30af\u30e9\u30b9\u30bf\u74b0\u5883\u3068\u7d44\u307f\u5408\u308f\u305b\u308b\u3053\u3068\u3067\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u9ad8\u53ef\u7528\u6027\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
a125=LDAP URL
a125.help=\u500b\u5225\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u6301\u7d9a\u7528\u306e LDAP URL \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u30bb\u30c3\u30b7\u30e7\u30f3\u6301\u7d9a\u306e\u305f\u3081\u306e\u306b\u7d44\u307f\u8fbc\u307f OpenDJ \u307e\u305f\u306f\u5916\u90e8\u8a2d\u5b9a\u30b9\u30c8\u30a2\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u7a7a\u767d\u306e\u307e\u307e\u306b\u3057\u307e\u3059\u3002
a126=LDAP \u30eb\u30fc\u30c8 DN
a126.help=\u5916\u90e8\u30b9\u30c8\u30a2\u306b Session \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u542b\u3080\u305f\u3081\u306e\u30eb\u30fc\u30c8\u30b3\u30f3\u30c6\u30ca DN \u3002
a127=LDAP \u30e6\u30fc\u30b6\u30fc DN
a128=LDAP \u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9
a129=\u6700\u5c0f\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba
a130=\u6700\u5927\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba
a131=\u6700\u5927\u63a5\u7d9a\u5f85\u3061\u6642\u9593
a131.help=\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u691c\u7d22\u306e\u305f\u3081\u306e\u8aad\u307f\u8fbc\u307f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8(\u30df\u30ea\u79d2)\u3002
p101=\u3059\u3079\u3066\u306e\u6709\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u53d6\u5f97
p102=\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u7834\u68c4
p103=\u3059\u3079\u3066\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3078\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30ea\u30b9\u30ca\u30fc\u306e\u8ffd\u52a0

choiceActive=\u30a2\u30af\u30c6\u30a3\u30d6
choiceInactive=\u975e\u30a2\u30af\u30c6\u30a3\u30d6
choiceDeleted=\u524a\u9664\u3055\u308c\u307e\u3057\u305f
choiceON=\u30aa\u30f3
choiceOFF=\u30aa\u30d5
choiceYES=\u306f\u3044
choiceNO=\u3044\u3044\u3048
choiceDenyAccess=DENY_ACCESS
choiceDestroyNextExpiring=DESTROY_NEXT_EXPIRING
choiceDestroyOldSession=DESTROY_OLDEST_SESSION
choiceDestroyAll=DESTROY_OLD_SESSIONS
i18nTrue=\u6709\u52b9
i18nFalse=\u7121\u52b9
