#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amLDAPv3Repo_ja.properties,v 1.11 2009/12/26 03:51:45 cbasha Exp $
#
#

0=LDAP \u30a8\u30e9\u30fc 0: \u64cd\u4f5c\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002
1=LDAP \u30a8\u30e9\u30fc 1: LDAP \u30b5\u30fc\u30d0\u30fc\u3067\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
2=LDAP \u30a8\u30e9\u30fc 2: \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u3088\u3063\u3066\u9001\u4fe1\u3055\u308c\u305f\u8981\u6c42\u306f LDAP \u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u53b3\u5bc6\u306b\u6e96\u62e0\u3057\u3066\u3044\u306a\u3044\u305f\u3081\u3001LDAP \u30b5\u30fc\u30d0\u30fc\u306f\u305d\u306e\u8981\u6c42\u3092\u6b63\u3057\u304f\u89e3\u91c8\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
3=LDAP \u30a8\u30e9\u30fc 3: \u691c\u7d22\u51e6\u7406\u3092\u6700\u5927\u6642\u9593\u5236\u9650\u5185\u306b\u5b8c\u4e86\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 
4=LDAP \u30a8\u30e9\u30fc 4: \u6700\u5927\u6570\u3092\u8d85\u3048\u308b\u691c\u7d22\u7d50\u679c\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002 
5=LDAP \u30a8\u30e9\u30fc 5: \u6307\u5b9a\u3057\u305f\u5c5e\u6027\u3068\u5024\u304c\u30a8\u30f3\u30c8\u30ea\u5185\u306b\u898b\u3064\u304b\u3089\u306a\u3044 (\u4e00\u81f4\u3059\u308b\u5024\u304c\u898b\u3064\u304b\u3089\u306a\u3044) \u5834\u5408\u306b LDAP \u6bd4\u8f03\u51e6\u7406\u306b\u3088\u3063\u3066\u8fd4\u3055\u308c\u308b\u5024\u3067\u3059\u3002 
6=LDAP \u30a8\u30e9\u30fc 6: \u6307\u5b9a\u3057\u305f\u5c5e\u6027\u3068\u5024\u304c\u30a8\u30f3\u30c8\u30ea\u5185\u306b\u898b\u3064\u304b\u3063\u305f (\u4e00\u81f4\u3059\u308b\u5024\u304c\u898b\u3064\u304b\u3063\u305f) \u5834\u5408\u306b LDAP \u6bd4\u8f03\u51e6\u7406\u306b\u3088\u3063\u3066\u8fd4\u3055\u308c\u308b\u5024\u3067\u3059\u3002 
7=LDAP \u30a8\u30e9\u30fc 7: \u6307\u5b9a\u3057\u305f\u8a8d\u8a3c\u65b9\u6cd5\u306f\u3001\u63a5\u7d9a\u5148\u306e LDAP \u30b5\u30fc\u30d0\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 
8=LDAP \u30a8\u30e9\u30fc 8: \u63a5\u7d9a\u5148\u306e LDAP \u30b5\u30fc\u30d0\u30fc\u306f\u3001\u3088\u308a\u5f37\u5ea6\u304c\u4e0a\u306e\u8a8d\u8a3c\u65b9\u6cd5 (LDAP_AUTH_SIMPLE \u3088\u308a\u4e0a) \u3092\u5fc5\u8981\u3068\u3057\u307e\u3059\u3002
9=LDAP \u30a8\u30e9\u30fc 9: LDAP \u30b5\u30fc\u30d0\u30fc\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u5225\u306e LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u53c2\u7167\u3059\u308b\u3088\u3046\u306b\u3057\u3066\u3044\u307e\u3059\u3002\u53c2\u7167\u51e6\u7406\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u3066\u3044\u307e\u3059\u3002  
10=LDAP \u30a8\u30e9\u30fc 10: \u8981\u6c42\u3055\u308c\u305f\u30a8\u30f3\u30c8\u30ea\u3092\u30b5\u30fc\u30d0\u30fc\u304c\u4fdd\u6301\u3057\u3066\u3044\u307e\u305b\u3093\u3002 
11=LDAP \u30a8\u30e9\u30fc 11: \u8fd4\u3055\u308c\u308b\u6700\u5927\u30a8\u30f3\u30c8\u30ea\u6570\u306e\u7ba1\u7406\u5236\u9650\u3092\u8d85\u3048\u307e\u3057\u305f\u3002 
12=LDAP \u30a8\u30e9\u30fc 12: \u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30af\u30ea\u30c6\u30a3\u30ab\u30eb\u3068\u3057\u3066\u30de\u30fc\u30af\u3055\u308c\u3066\u3044\u3066\u3001(1) \u30b5\u30fc\u30d0\u30fc\u3067\u8a8d\u8b58\u307e\u305f\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u3001(2) \u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306b\u5bfe\u3057\u3066\u9069\u5207\u3067\u306a\u3044\u3001\u306e\u3044\u305a\u308c\u304b\u3067\u3042\u308b LDAP v3 \u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f\u3002 
13=LDAP \u30a8\u30e9\u30fc 13: \u3053\u306e\u64cd\u4f5c\u306b\u306f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4fdd\u8b77\u3055\u308c\u305f\u63a5\u7d9a\u304c\u5fc5\u8981\u3067\u3059\u3002
14=LDAP \u30a8\u30e9\u30fc 14: SASL \u30d0\u30a4\u30f3\u30c9\u4e2d\u3067\u3059\u3002
15=LDAP \u30a8\u30e9\u30fc 15: 
16=LDAP \u30a8\u30e9\u30fc 16: \u6307\u5b9a\u3057\u305f\u5c5e\u6027\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
17=LDAP \u30a8\u30e9\u30fc 17: \u6307\u5b9a\u3057\u305f\u5c5e\u6027\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
18=LDAP \u30a8\u30e9\u30fc 18: \u4e0d\u9069\u5207\u306a\u7167\u5408\u306e\u30bf\u30a4\u30d7\u304c\u4f7f\u7528\u3055\u308c\u307e\u3057\u305f\u3002
19=LDAP \u30a8\u30e9\u30fc 19: LDAP \u30b5\u30fc\u30d0\u30fc\u3067\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
20=LDAP \u30a8\u30e9\u30fc 20: \u5c5e\u6027\u306b\u8ffd\u52a0\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u308b\u5024\u306f\u3001\u3059\u3067\u306b\u5c5e\u6027\u5185\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
21=LDAP \u30a8\u30e9\u30fc 21: \u8981\u6c42\u306b\u7121\u52b9\u306a\u69cb\u6587\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
22=LDAP \u30a8\u30e9\u30fc: 22
23=LDAP \u30a8\u30e9\u30fc: 23
24=LDAP \u30a8\u30e9\u30fc: 24
25=LDAP \u30a8\u30e9\u30fc: 25
26=LDAP \u30a8\u30e9\u30fc: 26
27=LDAP \u30a8\u30e9\u30fc: 27
28=LDAP \u30a8\u30e9\u30fc: 28
29=LDAP \u30a8\u30e9\u30fc: 29
30=LDAP \u30a8\u30e9\u30fc: 30
31=LDAP \u30a8\u30e9\u30fc: 31
32=LDAP \u30a8\u30e9\u30fc 32: \u8981\u6c42\u306e\u4e2d\u3067\u6307\u5b9a\u3057\u305f\u30a8\u30f3\u30c8\u30ea\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
33=LDAP \u30a8\u30e9\u30fc 33: \u30a8\u30a4\u30ea\u30a2\u30b9\u3067\u554f\u984c\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
34=LDAP \u30a8\u30e9\u30fc 34: \u6307\u5b9a\u3057\u305f\u8b58\u5225\u540d (DN) \u304c\u7121\u52b9\u306a\u69cb\u6587\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u3002
35=LDAP \u30a8\u30e9\u30fc 35: \u6307\u5b9a\u3057\u305f\u30a8\u30f3\u30c8\u30ea\u306f "\u30ea\u30fc\u30d5" \u30a8\u30f3\u30c8\u30ea\u3067\u3059\u3002
36=LDAP \u30a8\u30e9\u30fc 36: \u30a8\u30a4\u30ea\u30a2\u30b9\u306e\u30c7\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
37=LDAP \u30a8\u30e9\u30fc: 37
38=LDAP \u30a8\u30e9\u30fc: 38
39=LDAP \u30a8\u30e9\u30fc: 39
40=LDAP \u30a8\u30e9\u30fc: 40
41=LDAP \u30a8\u30e9\u30fc: 41
42=LDAP \u30a8\u30e9\u30fc: 42
43=LDAP \u30a8\u30e9\u30fc: 43
44=LDAP \u30a8\u30e9\u30fc: 44
45=LDAP \u30a8\u30e9\u30fc: 45
46=LDAP \u30a8\u30e9\u30fc: 46
47=LDAP \u30a8\u30e9\u30fc: 47
48=LDAP \u30a8\u30e9\u30fc 48: \u30b5\u30fc\u30d0\u30fc\u306b\u63d0\u4f9b\u3055\u308c\u308b\u8a8d\u8a3c\u304c\u9069\u5207\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
49=LDAP \u30a8\u30e9\u30fc 49: \u8a8d\u8a3c\u306e\u305f\u3081\u306b\u30b5\u30fc\u30d0\u30fc\u306b\u63d0\u4f9b\u3055\u308c\u308b\u8cc7\u683c\u60c5\u5831\u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
50=LDAP \u30a8\u30e9\u30fc 50: \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f\u3001\u3053\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306e\u30a2\u30af\u30bb\u30b9\u6a29\u9650\u3092\u6301\u305f\u306a\u3044\u30e6\u30fc\u30b6\u30fc\u3068\u3057\u3066\u8a8d\u8a3c\u3055\u308c\u3066\u3044\u307e\u3059\u3002
51=LDAP \u30a8\u30e9\u30fc 51: LDAP \u30b5\u30fc\u30d0\u30fc\u304c\u30d3\u30b8\u30fc\u72b6\u614b\u3067\u3059\u3002
52=LDAP \u30a8\u30e9\u30fc 52: LDAP \u30b5\u30fc\u30d0\u30fc\u304c\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002
53=LDAP \u30a8\u30e9\u30fc 53: \u6307\u5b9a\u3055\u308c\u305f\u64cd\u4f5c\u3092 LDAP \u30b5\u30fc\u30d0\u30fc\u304c\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
54=LDAP \u30a8\u30e9\u30fc 54: \u30eb\u30fc\u30d7\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
56=LDAP \u30a8\u30e9\u30fc: 56
57=LDAP \u30a8\u30e9\u30fc: 57
58=LDAP \u30a8\u30e9\u30fc: 58
59=LDAP \u30a8\u30e9\u30fc: 59
60=LDAP \u30a8\u30e9\u30fc 60: \u691c\u7d22\u8981\u6c42\u3067 "\u30b5\u30fc\u30d0\u30fc\u5074\u30bd\u30fc\u30c8" \u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u304c "\u4eee\u60f3\u30ea\u30b9\u30c8\u8868\u793a" \u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u3068\u3068\u3082\u306b\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3067\u3057\u305f\u3002
61=LDAP \u30a8\u30e9\u30fc 61: \u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u7bc4\u56f2\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
62=LDAP \u30a8\u30e9\u30fc: 62
63=LDAP \u30a8\u30e9\u30fc: 63
64=LDAP \u30a8\u30e9\u30fc 64: \u540d\u524d\u4ed8\u3051\u9055\u53cd\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
65=LDAP \u30a8\u30e9\u30fc 65: \u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306f\u30c7\u30fc\u30bf\u3092\u8ffd\u52a0\u307e\u305f\u306f\u5909\u66f4\u3059\u308b\u305f\u3081\u3001\u30c7\u30fc\u30bf\u306f\u30b9\u30ad\u30fc\u30de\u306b\u6e96\u62e0\u3057\u306a\u304f\u306a\u308a\u307e\u3059\u3002
66=LDAP \u30a8\u30e9\u30fc 66: \u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306f\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30c4\u30ea\u30fc\u5185\u3067\u4e0b\u4f4d\u306b\u30a8\u30f3\u30c8\u30ea\u3092\u6301\u305f\u306a\u3044\u30a8\u30f3\u30c8\u30ea (\u3064\u307e\u308a "\u30ea\u30fc\u30d5" \u30a8\u30f3\u30c8\u30ea) \u306b\u5bfe\u3057\u3066\u306e\u307f\u5b9f\u884c\u53ef\u80fd\u3067\u3059\u3002
67=LDAP \u30a8\u30e9\u30fc 67: \u6307\u5b9a\u3057\u305f\u51e6\u7406\u306f\u76f8\u5bfe\u8b58\u5225\u540d (RDN) \u3067\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
68=LDAP \u30a8\u30e9\u30fc 68: \u6307\u5b9a\u3057\u305f\u30a8\u30f3\u30c8\u30ea\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
69=LDAP \u30a8\u30e9\u30fc 69: \u6307\u5b9a\u3057\u305f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9\u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
70=LDAP \u30a8\u30e9\u30fc: 70
71=LDAP \u30a8\u30e9\u30fc 71: \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f\u3001"DN \u306e\u5909\u66f4" \u64cd\u4f5c\u3092\u8981\u6c42\u3059\u308b\u3053\u3068\u3067\u3001\u30a8\u30f3\u30c8\u30ea\u3092 LDAP \u30b5\u30fc\u30d0\u30fc\u9593\u3067\u79fb\u52d5\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
72=LDAP \u30a8\u30e9\u30fc: 72
73=LDAP \u30a8\u30e9\u30fc: 73
74=LDAP \u30a8\u30e9\u30fc: 74
75=LDAP \u30a8\u30e9\u30fc: 75
76=LDAP \u30a8\u30e9\u30fc: 76
77=LDAP \u30a8\u30e9\u30fc: 77
78=LDAP \u30a8\u30e9\u30fc: 78
79=LDAP \u30a8\u30e9\u30fc: 79
80=LDAP \u30a8\u30e9\u30fc 80: \u767a\u751f\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u305d\u306e\u4ed6\u306e\u7a2e\u985e\u306e\u30a8\u30e9\u30fc\u7528\u306e\u4e00\u822c\u7684\u306a\u7d50\u679c\u30b3\u30fc\u30c9\u3067\u3059\u3002
81=LDAP \u30a8\u30e9\u30fc 81: LDAP \u30b5\u30fc\u30d0\u30fc\u3068\u901a\u4fe1\u3067\u304d\u307e\u305b\u3093\u3002
82=LDAP \u30a8\u30e9\u30fc: 82
83=LDAP \u30a8\u30e9\u30fc: 83
84=LDAP \u30a8\u30e9\u30fc: 84
85=LDAP \u30a8\u30e9\u30fc 85: \u51e6\u7406\u3092\u6700\u5927\u5236\u9650\u6642\u9593\u5185\u306b\u5b8c\u4e86\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
86=LDAP \u30a8\u30e9\u30fc: 86
87=LDAP \u30a8\u30e9\u30fc: 87
88=LDAP \u30a8\u30e9\u30fc: 88
89=LDAP \u30a8\u30e9\u30fc 89: \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304b\u3089\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u307e\u305f\u306f\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u3068\u304d\u306b\u30011 \u3064\u4ee5\u4e0a\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u6b63\u3057\u304f\u6307\u5b9a\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
90=LDAP \u30a8\u30e9\u30fc: 90
91=LDAP \u30a8\u30e9\u30fc 91: LDAP \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f LDAP \u30b5\u30fc\u30d0\u30fc\u3078\u306e\u63a5\u7d9a\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
92=LDAP \u30a8\u30e9\u30fc 92: \u3053\u306e\u8981\u6c42\u306f\u3053\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e LDAP \u30d7\u30ed\u30c8\u30b3\u30eb\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
93=LDAP \u30a8\u30e9\u30fc 93: \u8981\u6c42\u3055\u308c\u305f\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 
94=LDAP \u30a8\u30e9\u30fc 94: \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u7d50\u679c\u304c\u8fd4\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
95=LDAP \u30a8\u30e9\u30fc 95: \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u3055\u3089\u306b\u7d50\u679c\u304c\u8fd4\u3055\u308c\u3066\u3044\u307e\u3059\u3002
96=LDAP \u30a8\u30e9\u30fc 96: LDAP \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u53c2\u7167\u3067\u30eb\u30fc\u30d7\u3092\u691c\u51fa\u3057\u307e\u3057\u305f\u3002
97=LDAP \u30a8\u30e9\u30fc 97: \u9023\u7d9a\u53c2\u7167\u306e\u6570 (\u305f\u3068\u3048\u3070\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f\u6700\u521d\u306b LDAP \u30b5\u30fc\u30d0\u30fc A \u304b\u3089 LDAP \u30b5\u30fc\u30d0\u30fc B \u3078\u53c2\u7167\u3055\u308c\u3001\u6b21\u306b LDAP \u30b5\u30fc\u30d0\u30fc B \u304b\u3089 LDAP \u30b5\u30fc\u30d0\u30fc C \u3068\u3044\u3046\u3088\u3046\u306b\u53c2\u7167\u3055\u308c\u308b\u5834\u5408\u304c\u3042\u308b) \u304c\u6700\u5927\u53c2\u7167\u6570\u3092\u8d85\u3048\u307e\u3057\u305f\u3002
