#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amPasswordResetModuleMsgs_de.properties,v 1.11 2009/12/26 03:54:18 cbasha Exp $
#
#

pwResetSuccess.title=Best\u00e4tigung der Passwortzur\u00fccksetzung
pwConsole.title=OpenAM (Zur\u00fccksetzen des Passworts)
userValidate.title=Benutervalidierung bei Passwortzur\u00fccksetzung
pwQuestion.title=Passwortfrage f\u00fcr {0}

#
# buttons
#
next.button=Weiter
previous.button=Vorherige
ok.button=OK

#
# message titles
#
error.title=Fehler
invalidURL.title=Ung\u00fcltiger URL
uncaughtException.title=Fehler

#
# message and error
#
userNotExists.message=Das Passwort kann f\u00fcr diesen Benutzer nicht zur\u00fcckgesetzt werden.
logUserNotExists.message=Es wurde versucht, das Passwort eines ung\u00fcltigen Benutzers, {0}, zur\u00fcckzusetzen.
multipleUsersExists.message=Mit dem angegebenen Wert stimmen mehrere Benutzer \u00fcberein. Geben Sie einen anderen Wert ein oder bitten Sie Ihren Administrator um Unterst\u00fctzung.
passResetError.message=Ihr Passwort kann nicht ge\u00e4ndert werden. Unterst\u00fctzung erhalten Sie von Ihrem Administrator.
emailNotify.message=An Ihr Konto mit Ihrem neuen Passwort wurde eine E-Mail-Nachricht gesendet.
wrongAnswer.message=Falsche Antwort eingegeben.
resetPassMail.message=Ihr OpenAM-Passwort wurde ge\u00e4ndert in: {0}
noQuestions.message=Es wurden keine Fragen f\u00fcr Sie konfiguriert.
noAnswers.message=Es gibt keine Antwort auf die geheimen Fragen.
attemptEmail.message=Es wurde versucht, Ihr Passwort zur\u00fcckzusetzen. Falls Sie dies nicht selbst getan haben, wenden Sie sich an Ihren Administrator.
resetSubject.message=Zur\u00fccksetzen des OpenAM-Passworts
attemptSubject.message=Zur\u00fccksetzen des OpenAM-Passworts
pwResetDisabled.message=Der Dienst f\u00fcr die Passwortzur\u00fccksetzung ist derzeit deaktiviert. Setzen Sie sich mit Ihrem Administrator in Verbindung.
missingUserAttr.message=Geben Sie einen Wert ein.
missingAnswer.message=Geben Sie Werte f\u00fcr alle Felder ein.
invalidURL.message=Sie haben einen ung\u00fcltigen URL eingegeben.
uncaughtException.message=Bei der Verarbeitung dieser Anforderung ist ein Fehler aufgetreten. Setzen Sie sich mit Ihrem Administrator in Verbindung.
noEmail.message=Das Passwort kann Ihnen nicht zugesendet werden. Setzen Sie sich mit Ihrem Administrator in Verbindung.
userNotActive.message=Dieser Benutzer ist nicht aktiv. Setzen Sie sich mit Ihrem Administrator in Verbindung.
userAccountExpired.message=Benutzerkonto ist abgelaufen. Setzen Sie sich mit Ihrem Administrator in Verbindung.
sendEmailFailed.message=Ihr Passwort wurde zur\u00fcckgesetzt, wir k\u00f6nnen es Ihnen jedoch nicht senden. Setzen Sie sich mit Ihrem Administrator in Verbindung.

#
# labels
#
fromAddress.label=<Password-Administrator>
sunLogo.label=Sun Microsystems-Logo
product.label=OpenAM
javaLogo.label=Sun Java System Software

#
# copyright text
#
copyright.text=Copyright \u00a9 2008 Sun Microsystems, Inc.  Alle Rechte vorbehalten.  Sun Microsystems, Inc. hat Rechte in Bezug auf geistiges Eigentum an der Technologie, die in dem in diesem Dokument beschriebenen Produkt enthalten ist. Im Besonderen und ohne Einschr\u00e4nkung umfassen diese Anspr\u00fcche in Bezug auf geistiges Eigentum eines oder mehrere der unter http://www.sun.com/patents aufgelisteten Patente und eines oder mehrere Patente oder Anwendungen mit laufendem Patent in den USA und in anderen L\u00e4ndern. Rechte der US-Regierung - Kommerzielle Software. Regierungsbenutzer unterliegen der standardm\u00e4\u00dfigen Lizenzvereinbarung von Sun Microsystems, Inc. sowie den anwendbaren Bestimmungen der FAR und ihrer Zus\u00e4tze.   Die Verwendung unterliegt Lizenzbestimmungen.  Diese Ausgabe kann von Drittanbietern entwickelte Bestandteile enthalten. Sun, Sun Microsystems und das Sun-Logo sind Warenzeichen oder eingetragene Warenzeichen von Sun Microsystems, Inc., in den USA und anderen L\u00e4ndern.&nbsp;   &nbsp; &nbsp; &nbsp;   &nbsp;    &nbsp;  &nbsp; &nbsp;

################################################################################
#
# logging messages
#
accountInactive.message=Konto ist f\u00fcr Benutzer {0} nicht aktiv.
accountExpired.message=Konto ist f\u00fcr Benutzer {0} abgelaufen.
accountLocked.message=Konto ist f\u00fcr Benutzer {0} gesperrt.
accountLockout.message=Die Passwortzur\u00fccksetzung f\u00fcr {0} wurde aufgrund aufeinander folgender Passwortzur\u00fccksetzungsfehler deaktiviert.
pwResetSuccess.message=Passwort wurde f\u00fcr Benutzer {0} ge\u00e4ndert.
pwResetFail.message=Versuch, das Passwort f\u00fcr Benutzer {0} zur\u00fcckzusetzen, ist fehlgeschlagen.

################################################################################
#
# Password Reset lockout messages
#
lockOutEmailFrom=<Password-Administrator>
lockOutEmailSub=WARNUNG: Passwortzur\u00fccksetzung-Sperrbenachrichtigung
lockoutMsg.message=Die Passwortzur\u00fccksetzung f\u00fcr diese Konto wurde aufgrund aufeinander folgender Passwortzur\u00fccksetzungsfehler deaktiviert.
lockOutEmailMsg=Die Passwortzur\u00fccksetzung f\u00fcr {0} wurde aufgrund aufeinander folgender Passwortzur\u00fccksetzungsfehler deaktiviert.
lockoutWarning.message=Falsche Antwort eingegeben. Die Abmeldung erfolgt nach dem/den n\u00e4chsten {0} Antwortfehler(n).
