#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amAuthJDBC_es.properties,v 1.11 2009/12/26 03:55:07 cbasha Exp $
#
#

onlinehelp.doc=jdbc.html
authentication=M\u00f3dulos de autenticaci\u00f3n
sunAMAuthJDBCServiceDescription=JDBC

a100=Tipo de conexi\u00f3n
a101=Nombre JNDI de la agrupaci\u00f3n de conexiones
a102=Controlador JDBC
a103=URL de JDBC
a104=Conectar este usuario a la base de datos
a105=Contrase\u00f1a para conectarse a la base de datos
a106=Cadena de la columna de contrase\u00f1a
a107=Declaraci\u00f3n preparada
a108=Clase para transformar la sintaxis de la contrase\u00f1a
a109=Nivel de autenticaci\u00f3n

noCONNECTIONTYPE=No se ha encontrado el tipo de conexi\u00f3n.
noJNDINAME=No se ha encontrado el nombre JNDI.
noDRIVER=No se ha especificado un controlador JDBC.
noURL=No se ha especificado una URL JDBC.
noDBUSER=No se ha especificado ning\u00fan usuario para la autenticaci\u00f3n en la base de datos.
noDBPASSWORD=No se ha especificado ninguna contrase\u00f1a para la autenticaci\u00f3n en la base de datos.
noPASSWORDCOLUMN=No se ha especificado un nombre de columna para la contrase\u00f1a.
noTRANSFORM=No se ha especificado ninguna clase de transformaci\u00f3n de sintaxis de la contrase\u00f1a.
noSTATEMENT=No se ha especificado ninguna declaraci\u00f3n preparada para la consulta SQL
noUserName=No se ha especificado el ID de usuario (Uid).
invalidState=No es un estado v\u00e1lido para el m\u00f3dulo JDBC.
loginFailed=Las credenciales del usuario no son v\u00e1lidas.
choiceJNDI=Se recupera la agrupaci\u00f3n de conexiones por medio de JDNI.
choiceURL=Conexi\u00f3n JDBC no persistente.
userNameTooLong=El nombre de usuario especificado supera la longitud m\u00e1xima.
nullResult=El resultado de la b\u00fasqueda para la declaraci\u00f3n preparada es nulo.
multiEntry=Se ha encontrado m\u00e1s de una entrada de usuario.
