#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amAuthUI_es.properties,v 1.12 2009/12/26 03:55:07 cbasha Exp $
#
#

authentication.failed=La autenticaci\u00f3n ha fallado. \n
authentication.successful=La autenticaci\u00f3n es satisfactoria. \n\n
authentication.already.login=Ya ha iniciado la sesi\u00f3n. \n\n
unknown.status=Estado desconocido: Vuelva a intentarlo.
Submit=Enviar
LogIn=Inicio de sesi\u00f3n
NewUser=Usuario nuevo
Reset=Restablecer formulario
Cancel=Cancelar
Agree=S\u00ed
Disagree=No
Yes=S\u00ed
No=No
Continue=Continuar
logout.successful=Ha cerrado la sesi\u00f3n.\n\n
logout.failure=Error de cierre de sesi\u00f3n.\n\n
uncaught_exception=Excepci\u00f3n de autenticaci\u00f3n debido a un controlador incorrecto.\n
redirect.error=No se puede redirigir a la p\u00e1gina predeterminada.
gotoLoginAfterFail=\u00bfVolver a la p\u00e1gina de inicio de sesi\u00f3n?
gotoLoginAfterLogout=\u00bfVolver a la p\u00e1gina de inicio de sesi\u00f3n?
#Do not translate the next entry (basic_realm) because it is a product name.
basic_realm=OpenAM
htmlTitle_Login=OpenAM (Inicio de sesi\u00f3n)
htmlTitle_Logout=OpenAM (Cierre de sesi\u00f3n)
htmlTitle_Message=OpenAM (Mensaje)
htmlTitle_Redirect=OpenAM (Redirigir)
htmlTitle_AccountExpired=OpenAM (Cuenta caducada)
htmlTitle_AuthError=OpenAM (Error de autenticaci\u00f3n)
htmlTitle_SelfRegError=OpenAM (Error de registro autom\u00e1tico)
htmlTitle_Disclaimer=OpenAM (Renuncia)
htmlTitle_InvalidPCookieUID=OpenAM (Id. de usuario de cookie persistente no v\u00e1lido)
htmlTitle_InvalidPassword=OpenAM (Contrase\u00f1a no v\u00e1lida)
htmlTitle_InvalidDomain=OpenAM (Dominio no v\u00e1lido)
htmlTitle_UserProfileNotFound=OpenAM (El usuario no tiene perfil en esta organizaci\u00f3n)
htmlTitle_AuthFailed=OpenAM (Error de autenticaci\u00f3n)
htmlTitle_Membership=OpenAM (Miembros)
htmlTitle_AuthModuleDenied=OpenAM (M\u00f3dulo de autenticaci\u00f3n denegado)
htmlTitle_NoConfigError=OpenAM (Sin error de configuraci\u00f3n)
htmlTitle_OrgInactive=OpenAM (Organizaci\u00f3n inactiva)
htmlTitle_SelfRegModule=OpenAM (M\u00f3dulo de registro autom\u00e1tico)
htmlTitle_SessionTimeOut=OpenAM (Superado el tiempo de espera de sesi\u00f3n)
htmlTitle_UserNotFound=OpenAM (No se ha encontrado el usuario)
htmlTitle_UserInactive=OpenAM (Usuario inactivo)
htmlTitle_AuthException=OpenAM (Excepci\u00f3n de autenticaci\u00f3n)
htmlTitle_NewOrg=OpenAM (Nueva organizaci\u00f3n)
htmlTitle_MaxSessions=OpenAM (N\u00famero m\u00e1ximo de sesiones)

#Copyright notice at the bottom of all JSP pages
copyright.notice=Copyright \u00a9 2008 Sun Microsystems, Inc., 4150 Network Circle, Santa Clara,California 95054, EE.UU. Todos los derechos reservados. Sun Microsystems, Inc. tiene derechos de propiedad intelectual relacionados con la tecnolog\u00eda del producto que se describe en este documento. Especialmente, aunque sin limitarse a ellos, estos derechos de propiedad intelectual pueden incluir una o varias de las patentes de EE.UU. que aparecen en http://www.sun.com/patents, as\u00ed como otras patentes adicionales o solicitudes de patentes en EE.UU. y otros pa\u00edses. Derechos del gobierno de EE.UU.: software comercial.  Derechos del gobierno de EE.UU: software comercial.  Los usuarios gubernamentales est\u00e1n sujetos al acuerdo de licencia est\u00e1ndar de Sun Microsystems, Inc. y a las disposiciones aplicables de la regulaci\u00f3n FAR y sus suplementos. El uso est\u00e1 sujeto a las condiciones de la licencia. La distribuci\u00f3n puede incluir materiales desarrollados por terceras partes.  Sun, Sun Microsystems, el logotipo de Sun, Java, Solaris y el logotipo de Solaris son marcas comerciales o marcas registradas de Sun Microsystems, Inc. en los EE.UU. y en otros pa\u00edses.  Todas las marcas comerciales de SPARC se usan bajo licencia y son marcas comerciales o marcas registradas de SPARC International, Inc. en EE.UU. y otros pa\u00edses.  Los productos con la marca comercial de SPARC se basan en una arquitectura desarrollada por Sun Microsystems, Inc. UNIX es una marca comercial registrada en los EE.UU. y en otros pa\u00edses, con licencia exclusiva a trav\u00e9s de X/Open Company, Ltd. Este producto est\u00e1 cubierto y controlado por las leyes de exportaci\u00f3n estadounidenses, y puede estar sujeto a las leyes de exportaci\u00f3n e importaci\u00f3n de otros pa\u00edses.  Queda terminantemente prohibido el uso final (directo o indirecto) de esta documentaci\u00f3n para el desarrollo de armas nucleares, qu\u00edmicas, biol\u00f3gicas, de uso mar\u00edtimo nuclear o misiles. Queda terminantemente prohibida la exportaci\u00f3n o reexportaci\u00f3n a pa\u00edses sujetos al embargo de los Estados Unidos o a entidades identificadas en las listas de exclusi\u00f3n de exportaci\u00f3n de los Estados Unidos, incluidas, aunque sin limitarse a ellas, las personas con acceso denegado y las listas de ciudadanos designados con car\u00e1cter especial.  &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <br />

invalid.password=La contrase\u00f1a introducida no es v\u00e1lida.
auth.failed=Fallo de autenticaci\u00f3n.
nouser.profile=No se ha encontrado ning\u00fan perfil de usuario que coincida con el nombre de usuario. Introduzca de nuevo la informaci\u00f3n de inicio de sesi\u00f3n. Si es la primera vez que entra en el sistema, seleccione <i>Usuario nuevo</i> en la pantalla de inicio de sesi\u00f3n.
notenough.characters=La contrase\u00f1a introducida no contiene suficientes caracteres.
disclaimer.notice=\u00c9sta es una ventana de descargo de responsabilidad de ejemplo. El cliente puede utilizar su propio descargo de responsabilidad, utilizar \u00e9ste o puede elegir no mostrarlo en absoluto. Para obtener informaci\u00f3n sobre c\u00f3mo personalizar o eliminar la p\u00e1gina de descargo de responsabilidad, consulte la documentaci\u00f3n de la autenticaci\u00f3n.
doyou.agree=\u00bfEst\u00e1 de acuerdo con este aviso?
newOrg.agree=Ya ha iniciado sesi\u00f3n. \u00bfDesea cerrar la sesi\u00f3n e iniciarla en una organizaci\u00f3n diferente?
useralready.exists=Ya existe un usuario con este nombre.
uidpasswd.same=Los campos "Nombre de usuario" y "Contrase\u00f1a" no pueden tener el mismo valor.
config.error=Error de configuraci\u00f3n, probablemente en el archivo JSP.
nouser.name=No se ha introducido ning\u00fan nombre de usuario.
no.password=No se ha introducido ninguna contrase\u00f1a.
missing.confirm.passwd=Falta el campo de confirmaci\u00f3n de contrase\u00f1a.
password.mismatch=La contrase\u00f1a y la contrase\u00f1a de confirmaci\u00f3n no coinciden.
profile.error=Se ha producido un error al almacenar el perfil del usuario.
orginactive=Esta organizaci\u00f3n no est\u00e1 activa.
internal.auth.error=Se ha producido un error interno de autenticaci\u00f3n.
contactadmin=P\u00f3ngase en contacto con el administrador del sistema.
#context of the following messages
#<p> moved to new location, click <a href=xxx> here </a></p>
#Align the translation according to what text comes instead of 'here'
movenew.location.1=Se ha movido a una nueva ubicaci\u00f3n, haga clic
movenew.location.2=aqu\u00ed.
account.expired=La cuenta de usuario ha caducado.
usernot.active=Este usuario no est\u00e1 activo.
user.not.inrole=El usuario no pertenece al rol.
session.timeout=Se ha agotado el tiempo de espera de la sesi\u00f3n.
authmodule.denied=Se ha denegado su m\u00f3dulo de autenticaci\u00f3n.
static.message=Aqu\u00ed va su mensaje est\u00e1tico...
noconfig.found=No se ha encontrado ninguna configuraci\u00f3n.
cookie.notpersistent=El nombre de usuario de cookie persistente no existe en el dominio de cookie persistente.
nosuch.domain=No se ha encontrado ninguna organizaci\u00f3n de ese tipo.
userhasnoprofile.org=El usuario no tiene perfil en esta organizaci\u00f3n.
reqfield.missing=No se ha cumplimentado uno de los campos necesarios. Debe cumplimentar todos los campos obligatorios.
session.max.limit=Se ha alcanzado el l\u00edmite m\u00e1ximo de sesiones o se ha agotado la cuota de sesi\u00f3n.
reqfield.desc=Indica un campo obligatorio
loginDisplay.get=Error al obtener LoginDisplay: {0}
loginDisplay.process=Error al procesar LoginDisplay: {0}
nocookiesupport=Este navegador no admite cookies. Habilite el uso de cookies y vuelva a iniciar sesi\u00f3n.
invalidauthlevel=Nivel de autenticaci\u00f3n no v\u00e1lido.
cannotInitAuth=No se puede inicializar la autenticaci\u00f3n
