#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amClientData_es.properties,v 1.11 2009/12/26 03:55:08 cbasha Exp $
#
#

Client=Configuraci\u00f3n de los datos del cliente
clientDataDescription=Datos del cliente

#
# Error messages
#
901=No se ha creado la instancia
902=No se pudo obtener el control para los datos del cliente
903=Falta la propiedad necesaria clientType
904=Ya existe el cliente: {0}
905=Error al a\u00f1adir el cliente: {0}
906=No se puede modificar la base de datos interna
907=Error al modificar el cliente: {0}
908=Error al suprimir el cliente: {0}

#
# Names for the classification
#
generalPropertyNames=General
hardwarePlatformNames=Plataforma de hardware
softwarePlatformNames=Plataforma de software
networkCharacteristicsNames=Caracter\u00edsticas de red
browserUANames=BrowserUA
wapCharacteristicsNames=WapCharacteristics
pushCharacteristicsNames=PushCharacteristicsNames
additionalPropertiesNames=Propiedades adicionales

#
# Required Properties
#
clientType=Nombre de tipo de cliente (debe ser exclusivo en todos los dispositivos)
contentType=Mime-type aceptado por este dispositivo
filePath=La ruta de archivo para seleccionar plantillas
parentId=El dispositivo inmediatamente superior a \u00e9ste
userAgent=La cadena agente-usuario HTTP

#
# Optional Properties
#
counterName=Countername que se debe usar para desactivar la cach\u00e9 (el valor predeterminado es: C)
encoderClassName=Nombre de clase Entity Escaping Encoder
genericHTML=\u00bfEs este cliente similar a genericHTML?
ignoreHostHeader=\u00bfDebe omitirse el host HTTP de encabezado? (v\u00e1lido s\u00f3lo con solicitudes HTTP/1.0)
lineLength=La longitud de l\u00ednea
cookieDetect=Detecci\u00f3n de cookies autom\u00e1tica
cookieSupport=Cookies admitidas
noCookieSupport=Cookies no admitidas

#
# Hardware Plaftorm
#
BluetoothProfile=Perfiles Bluetooth admitidos, seg\u00fan se establece en la especificaci\u00f3n Bluetooth.
BitsPerPixel=Informaci\u00f3n del n\u00famero de bits de color o de la escala de grises por p\u00edxel
ColorCapable=Indica si la pantalla del dispositivo admite color
CPU=Nombre y n\u00famero de modelo del dispositivo CPU
ImageCapable=Indica si el dispositivo admite la visualizaci\u00f3n de im\u00e1genes.
InputCharset=Lista de juegos de caracteres que admite el dispositivo para entradas de texto
Keyboard=Tipo de teclado que admite el dispositivo
Model=N\u00famero de modelo asignado al dispositivo terminal por parte del vendedor o fabricante
NumberOfSoftKeys=N\u00famero de teclas programables disponibles en el dispositivo
OutputCharset=Lista de juegos de caracteres que admite el dispositivo para salida
PixelAspectRatio=Relaci\u00f3n entre el alto y el ancho de los p\u00edxeles
PointingResolution=Tipo de resoluci\u00f3n del accesorio para se\u00f1alar que admite el dispositivo
ScreenSize=El tama\u00f1o de la pantalla del dispositivo en unidades de p\u00edxeles
ScreenSizeChar=El tama\u00f1o de la pantalla del dispositivo en unidades de caracteres
SoundOutputCapable=Indica si el dispositivo admite salida de sonido.
StandardFontProportional=Indica si la fuente est\u00e1ndar del dispositivo es proporcional.
TextInputCapable=Indica si el dispositivo admite entradas de texto alfanum\u00e9rico
Vendor=Nombre del fabricante del dispositivo terminal
VoiceInputCapable=Indica si el dispositivo admite alg\u00fan tipo de entrada de voz.

#
# Software Plaftorm
#
AcceptDownloadableSoftware=Indica la preferencia del usuario acerca de la descarga del software.
AudioInputEncoder=Lista de codificadores de entrada de audio que admite el dispositivo
CcppAccept=Lista de tipos de contenido que admite el dispositivo
CcppAccept-Charset=Lista de juegos de caracteres que admite el dispositivo
CcppAccept-Encoding=Lista de codificaciones de transferencia que admite el dispositivo
CcppAccept-Language=Lista de idiomas de documento preferidos
DownloadableSoftwareSupport=Lista de tipos de contenido ejecutable que admite el dispositivo
JavaEnabled=Indica si el dispositivo admite una m\u00e1quina virtual Java.
JavaPlatform=La lista de plataformas Java y de perfiles instalados en el dispositivo
JVMVersion=Lista de m\u00e1quinas virtuales Java instaladas en el dispositivo
MexeClassmarks=Lista de marcas de clase MExE que admite el dispositivo
MexeSecureDomains=Indica si el dispositivo admite dominios de seguridad MExE, seg\u00fan se establece en las especificaciones MExE
MexeSpec=Especializaci\u00f3n de marca de clase
OSName=Nombre del sistema operativo del dispositivo
OSVendor=Proveedor del sistema operativo del dispositivo
OSVersion=Versi\u00f3n del sistema operativo del dispositivo
RecipientAppAgent=Agente de usuario asociado a la solicitud actual
SoftwareNumber=Versi\u00f3n del software espec\u00edfico para el dispositivo (firmware)
VideoInputEncoder=Lista de codificadores de entrada de v\u00eddeo que admite el dispositivo

#
# Network Characteristics
#
CurrentBearerService=El portador en el que se abri\u00f3 la sesi\u00f3n actual
SecuritySupport=El tipo de mecanismo de seguridad o de cifrado admitido
SupportedBearers=Tipo de portadores que admite el dispositivo
SupportedBluetoothVersion=Versi\u00f3n de Bluetooth admitida

#
# BrowserUA
#
BrowserName=Nombre del agente de usuario del navegador asociado a la solicitud actual
BrowserVersion=Versi\u00f3n del navegador
DownloadableBrowserApps=Lista de tipos de contenido ejecutable que admite el navegador.
FramesCapable=Indica si el navegador puede mostrar marcos.
HtmlVersion=Versi\u00f3n de HTML admitida
JavaAppletEnabled=Indica si el navegador admite subprogramas (applets) de Java.
JavaScriptEnabled=Indica si el navegador admite JavaScript.
JavaScriptVersion=Versi\u00f3n del lenguaje JavaScript que admite el navegador
PreferenceForFrames=Indica la preferencia del usuario para recibir contenido que contenga marcos.
TablesCapable=Indica si el navegador puede mostrar tablas.
XhtmlModules=Lista de los m\u00f3dulos XHTML que admite el navegador
XhtmlVersion=Versi\u00f3n de XHTML que admite el navegador

#
# Wap Characteristics
#
SupportedPictogramSet=Clases de pictogramas que admite el dispositivo, seg\u00fan se establece en la especificaci\u00f3n del pictograma WAP.
WapDeviceClass=Clasificaci\u00f3n del dispositivo basada en las funciones, seg\u00fan se establece en las especificaciones WAP 1.1.
WapVersion=Versi\u00f3n de WAP admitida
WmlDeckSize=Tama\u00f1o m\u00e1ximo de la baraja (deck) WML que se puede descargar al dispositivo
WmlScriptLibraries=Lista de bibliotecas obligatorias y opcionales que admite el WMLScript VM del dispositivo
WmlScriptVersion=Tipo de versiones WMLScript que admite el dispositivo
WmlVersion=Tipo de versiones de lenguajes WML que admite el dispositivo
WtaiLibraries=Lista de bibliotecas comunes de red y espec\u00edficas de red WTAI que admite el dispositivo
WtaVersion=Versi\u00f3n del agente de usuario WTA

#
# Push characteristics
#
Push-Accept=Lista de tipos de contenido que admite el dispositivo para empujar
Push-Accept-Charset=Lista de juegos de caracteres que admite el dispositivo para empujar
Push-Accept-Encoding=Lista de codificaciones de transferencia que admite el dispositivo para empujar
Push-Accept-Language=Lista de idiomas de documento preferidos para empujar
Push-Accept-AppID=Lista de aplicaciones que admite el dispositivo para empujar
Push-MsgSize=Tama\u00f1o m\u00e1ximo en bytes de un mensaje de empuje que puede administrar el dispositivo
Push-MaxPushReq=N\u00famero m\u00e1ximo de solicitudes de empuje pendientes que puede administrar el dispositivo

#
# Additional Properties
#
additionalProperties=Propiedades adicionales
