#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amProfile_es.properties,v 1.12 2009/12/26 03:55:08 cbasha Exp $
#
#

0=LDAP Error: La operaci\u00f3n se ha realizado satisfactoriamente.
1=LDAP Error: Se ha producido un error interno en el servidor LDAP.
2=LDAP Error: Error de protocolo.
3=LDAP Error: No se ha podido realizar la operaci\u00f3n de b\u00fasqueda dentro del l\u00edmite de tiempo m\u00e1ximo. 
4=LDAP Error: La b\u00fasqueda ha encontrado un n\u00famero de resultados superior al n\u00famero m\u00e1ximo. 
5=LDAP Error: No se ha encontrado ning\u00fan valor coincidente.
6=LDAP Error: Se ha encontrado un valor coincidente.
7=LDAP Error: No se admite el m\u00e9todo de autenticaci\u00f3n especificado.
8=LDAP Error: Se necesita un m\u00e9todo de autenticaci\u00f3n m\u00e1s seguro (m\u00e1s que LDAP_AUTH_SIMPLE).
9=LDAP Error: El servidor LDAP est\u00e1 enviando al cliente a otro servidor LDAP. 
10=LDAP Error: El servidor no contiene la entrada solicitada. 
11=LDAP Error: Se ha excedido el l\u00edmite administrativo sobre el n\u00famero m\u00e1ximo de entradas que se deben devolver. 
12=LDAP Error: Control desconocido.
13=LDAP Error: Se requiere una conexi\u00f3n segura para esta operaci\u00f3n.
14=Error LDAP: Enlace SASL en progreso.
15=LDAP Error: 
16=LDAP Error: No se ha encontrado el atributo especificado.
17=LDAP Error: El atributo especificado no est\u00e1 definido.
18=LDAP Error: Se ha utilizado un tipo de comparaci\u00f3n inapropiado.
19=LDAP Error: Infracci\u00f3n de restricci\u00f3n
20=LDAP Error: El valor que est\u00e1 a\u00f1adiendo a un atributo ya existe en el atributo.
21=LDAP Error: La solicitud contiene una sintaxis no v\u00e1lida.
22=LDAP Error:
23=LDAP Error:
24=LDAP Error:
25=LDAP Error:
26=LDAP Error:
27=LDAP Error:
28=LDAP Error:
29=LDAP Error:
30=LDAP Error:
31=LDAP Error:
32=LDAP Error: La entrada especificada en la solicitud no existe.
33=LDAP Error: Se ha producido un problema con un alias.
34=LDAP Error: El nombre \u00fanico (DN) especificado utiliza una sintaxis no v\u00e1lida.
35=LDAP Error: La entrada especificada es una entrada "hoja".
36=LDAP Error: Se ha producido un error al eliminar la referencia de un alias.
37=LDAP Error:
38=LDAP Error:
39=LDAP Error:
40=LDAP Error:
41=LDAP Error:
42=LDAP Error:
43=LDAP Error:
44=LDAP Error:
45=LDAP Error:
46=LDAP Error:
47=LDAP Error:
48=LDAP Error: INAPPROPRIATE_AUTHENTICATION
49=LDAP Error:INVALID_CREDENTIALS
50=LDAP Error: INSUFFICIENT_ACCESS_RIGHTS
51=LDAP Error: El servidor LDAP est\u00e1 ocupado.
52=LDAP Error: El servidor LDAP no est\u00e1 disponible.
53=LDAP Error: El servidor LDAP no puede realizar la operaci\u00f3n especificada.
54=LDAP Error: Se ha detectado un bucle.
56=LDAP Error:
57=LDAP Error:
58=LDAP Error:
59=LDAP Error:
60=LDAP Error: SORT_CONTROL_MISSING
61=LDAP Error: Se ha producido un error relacionado con el intervalo de \u00edndice.
62=LDAP Error:
63=LDAP Error:
64=LDAP Error: Se ha producido una infracci\u00f3n de asignaci\u00f3n de nombre.
65=LDAP Error: OBJECT_CLASS_VIOLATION
66=LDAP Error: NOT_ALLOWED_ON_NONLEAF
67=LDAP Error: La operaci\u00f3n especificada no se puede realizar en un nombre \u00fanico relativo (RDN).
68=LDAP Error: ENTRY_ALREADY_EXISTS
69=LDAP Error: OBJECT_CLASS_MODS_PROHIBITED
70=LDAP Error:
71=LDAP Error: AFFECTS_MULTIPLE_DSAS
72=LDAP Error:
73=LDAP Error:
74=LDAP Error:
75=LDAP Error:
76=LDAP Error:
77=LDAP Error:
78=LDAP Error:
79=LDAP Error:
80=LDAP Error: OTHER
81=LDAP Error: SERVER_DOWN
82=LDAP Error:
83=LDAP Error:
84=LDAP Error:
85=LDAP Error: LDAP_TIMEOUT
86=LDAP Error:
87=LDAP Error:
88=LDAP Error:
89=LDAP Error: PARAM_ERROR
90=LDAP Error:
91=LDAP Error: CONNECT_ERROR
92=LDAP Error: Esta versi\u00f3n del protocolo LDAP no admite esta solicitud.
93=LDAP Error: No se encuentra el control solicitado. 
94=LDAP Error: El servidor no ha devuelto ning\u00fan resultado.
95=LDAP Error: El servidor est\u00e1 devolviendo m\u00e1s resultados.
96=LDAP Error: El cliente LDAP ha detectado un bucle en la referencia.
97=LDAP Error: REFERRAL_LIMIT_EXCEEDED
100=Atributo de varios valores.
101=No hay atributos en el perfil.
102=No se han definido los atributos de rol de usuario.
103=No es un privilegio de tipo booleano.
104=No es un privilegio de tipo de lista.
105=No es una coincidencia v\u00e1lida.
106=No hay privilegios en el perfil.
107=No se ha encontrado el privilegio.
108=No se ha encontrado el atributo.
109=Permiso no v\u00e1lido.
110=No hay Id. de cat\u00e1logo.
111=No hay descripci\u00f3n.
112=No hay tipo.
113=No hay elecciones.
114=Operaci\u00f3n no v\u00e1lida.
115=Tipo no v\u00e1lido.
116=Derechos de acceso no v\u00e1lidos.
117=Tipo de perfil no v\u00e1lido.
118=La sesi\u00f3n no es v\u00e1lida.
119=No se encuentra.
120=Se ha recibido un n\u00famero de respuestas inesperado.
121=Cualificador no v\u00e1lido.
122=Car\u00e1cter comod\u00edn no v\u00e1lido.
123=Nivel no v\u00e1lido.
124=Imposible encontrar la organizaci\u00f3n principal.
125=Servicio ya asignado.
126=Servicio no asignado.
127=No se pudo obtener el esquema de objeto de clase.
150=No es un atributo de cadena.
151=Imposible obtener "objectClass" de atributo.
152=No es un atributo entero.
153=Imposible obtener valor para el atributo entero.
154=No es un atributo booleano.
155=Imposible obtener valor para el atributo booleano.
156=Tipo de objeto desconocido.
157=Cadena de DN no v\u00e1lida o nombre no v\u00e1lido.
158=Imposible obtener ACI predeterminado para rol de administrador.
159=ACI predeterminado no v\u00e1lido para funci\u00f3n de administrador.
160=No se puede suprimir la organizaci\u00f3n predeterminada.
161=Imposible obtener las clases de objeto del servicio.
162=Se ha infringido la unicidad del atributo.
163=Imposible localizar la clase {0}.
164=Imposible crear la instancia de la clase {0}.
300=Excepci\u00f3n grave al inicializar el almac\u00e9n de datos.
301=No est\u00e1n presentes los par\u00e1metros de inicializaci\u00f3n del almac\u00e9n de datos necesario.
310=Valor de atributo no v\u00e1lido.
311=Valor de privilegio no v\u00e1lido.
312=Valor de elecci\u00f3n no v\u00e1lido.
320=Nombre de perfil no v\u00e1lido.
321=Nombre de atributo o privilegio no v\u00e1lido.
322=Nombre de perfil principal no v\u00e1lido.
323=Nombre de perfil en uso.
324=Imposible crear la entrada.
325=Imposible eliminar la entrada.
326=Tipo de perfil no v\u00e1lido.
327=El usuario ya no existe.
328=Ya existe el usuario.
329=Conflictos con usuario suprimido.
330=Imposible obtener atributos del almac\u00e9n de datos.
331=No se ha inicializado el perfil.
332=Imposible eliminar el atributo del almac\u00e9n de datos.
333=Operaci\u00f3n de modificaci\u00f3n del valor de atributo no v\u00e1lida.
334=Imposible modificar el valor de atributo en el almac\u00e9n de datos.
340=Filtro de b\u00fasqueda no v\u00e1lido.
341=Ha fallado la b\u00fasqueda.
342=El atributo del nombre de dominio no debe ser nulo.
343=Se ha especificado una ra\u00edz de \u00e1rbol DC no v\u00e1lida.
344=Imposible crear \u00e1rbol DC.
345=Imposible buscar plantillas de directiva.
346=Imposible suprimir plantillas de directiva.
347=Imposible actualizar plantillas de directiva.
348=Imposible recuperar atributos de plantilla.
349=Imposible obtener DN de plantilla.
350=Imposible modificar condici\u00f3n de miembro.
351=Imposible actualizar el atributo de usuario.
352=Imposible definir filtro de b\u00fasqueda.
353=Imposible obtener filtro de b\u00fasqueda.
354=Imposible averiguar si el \u00e1rbol DC est\u00e1 activado.
355=No se ha especificado la ra\u00edz de \u00e1rbol DC.
356=No se puede actualizar el estado del componente de dominio.
357=Imposible averiguar si Admin Groups est\u00e1 activado.
358=No se puede crear Admin Groups.
359=Imposible averiguar si Eliminaci\u00f3n de usuario de compatibilidad est\u00e1 activada.
360=Imposible cambiar el nombre de la entrada.
361=Conflictos con organizaci\u00f3n suprimida.
362=No se puede cambiar la contrase\u00f1a de usuario.
445=No se puede cancelar el registro del servicio {0}. El servicio tambi\u00e9n est\u00e1 registrado para suborganizaciones.
446=No se encuentran las directivas designadas.
447=No se encuentra el Administrador de directivas.
448=No se puede cancelar el registro del servicio. Las directivas designadas ya existen.
449=Imposible obtener el esquema de acci\u00f3n.
450=La plantilla no existe.
451=Imposible crear la plantilla.
452=Imposible definir atributo(s).
453=Imposible a\u00f1adir miembro.
454=Imposible obtener miembros.
455=Imposible obtener servicios registrados.
456=Imposible recuperar la plantilla.
457=Imposible crear la plantilla.
458=No existe ninguna organizaci\u00f3n principal.
459=Servicio {0} no registrado.
460=El usuario no tiene acceso suficiente.
461=No se encuentra la entrada: {0}.
462=Ya existe la entrada.
463=El servicio {0} no est\u00e1 registrado.
464=Servicio {0} ya registrado.
465=No se encuentra el rol: {0}
466=No se encuentra el grupo: {0}
467=No se encuentra la organizaci\u00f3n: {0}
468=No se encuentra el usuario: {0}
469=No se encuentra el contenedor: {0}
470=No se encuentra el contenedor de personas: {0}
471=No se encuentra el contenedor de grupos: {0}
472=Ya existe el rol.
473=Ya existe el grupo.
474=Ya existe la organizaci\u00f3n.
475=Ya existe el usuario.
476=Ya existe el contenedor.
477=Ya existe el contenedor de personas.
478=El servicio {0} no est\u00e1 activado.
479=Ya existe la configuraci\u00f3n de servicio.
480=No se encuentra la configuraci\u00f3n del servicio: {0}
481=No se encuentra el servicio: {0}
482=Imposible crear configuraci\u00f3n de servicio para el servicio: {0}
483=Ya existe el contenedor de grupos.
484=Imposible obtener esquema de servicio.
485=Config. de servicio no v\u00e1lida.
486=Imposible definir atributo de configuraci\u00f3n de servicio para: {0}
487=Imposible obtener atributo de config. de servicio.
488=La directiva ya est\u00e1 asignada.
489=La directiva no est\u00e1 asignada.
490=AVISO: aviso de creaci\u00f3n de usuario
491=AVISO: aviso de supresi\u00f3n de usuario
492=AVISO: aviso de modificaci\u00f3n de usuario
493=Se ha creado el usuario:
494=Se ha suprimido el usuario:
495=Se ha modificado el usuario:
496=Se ha modificado el atributo:
497=<OpenAM>
498=Imposible obtener directiva.
499=Imposible obtener configuraci\u00f3n de servicio para: {0}
500=No se ha definido la ruta de acceso de configuraci\u00f3n para el administrador de eventos.
501=Imposible iniciar el administrador de eventos.
502=valor anterior:
503=valor nuevo:
505=Imposible obtener miembros: Se ha excedido el l\u00edmite de tama\u00f1o de b\u00fasqueda.

# Do not localize this property. This is a keyword to send email to user itself
504=self

510=Imposible a\u00f1adir un SSOTokenListener nuevo.
700=No se ha definido ning\u00fan perfil principal.
701=No se ha definido ning\u00fan rol del usuario.
702=El perfil no existe.
703=Atributo o privilegio no definido.
705=Datos no v\u00e1lidos.
710=No se pueden asignar varios valores a un atributo de valor \u00fanico.
711=El atributo no se puede configurar.
720=Permiso de obtenci\u00f3n de atributos o privilegios denegado.
721=Permiso de definici\u00f3n de atributos o privilegios denegado.
722=Permiso de creaci\u00f3n de perfil denegado.
723=Permiso de eliminaci\u00f3n de perfil denegado.
724=Se ha denegado la autorizaci\u00f3n.
725=Fallo de definici\u00f3n de perfil al sobrescribir los atributos personalizados en los subperfiles.
726=Permiso de perfil de b\u00fasqueda denegado.
730=No se puede eliminar una funci\u00f3n que contiene usuarios.
740=Nombre o valor de atributo proporcionado en el perfil de b\u00fasqueda no v\u00e1lido.
741=Tipo de perfil proporcionado en el perfil de b\u00fasqueda no v\u00e1lido.
742=Se ha proporcionado una plantilla DN no v\u00e1lida.
743=Valor no v\u00e1lido para policyDN.
760=Asignaci\u00f3n de atributos externos no v\u00e1lida.
761=Imposible obtener los atributos de configuraci\u00f3n de LDAP externa.
762=\u00c1mbito de b\u00fasqueda no v\u00e1lido.
763=Imposible leer del almac\u00e9n de datos externo.
764=Imposible escribir en el almac\u00e9n de datos externo.
765=Imposible conectar con el almac\u00e9n de datos externo.
766=Imposible cerrar la conexi\u00f3n del almac\u00e9n de datos externo.
767=Duplicar las coincidencias del almac\u00e9n de datos externo.
770=Propiedades de conexi\u00f3n de LDAP externa no v\u00e1lidas.
771=Imposible a\u00f1adir miembros al grupo.
772=Imposible eliminar miembros de los grupos.
773=Imposible suprimir la entrada.
800=Excepci\u00f3n de sesi\u00f3n no v\u00e1lida.
850=URL de notificaci\u00f3n no v\u00e1lida.
851=Imposible eliminar el proceso de escucha del servicio de perfil.
852=No se puede eliminar el registro del servicio. Existen directivas.
853=Ya existe directiva para {0}
854=Ya existe plantilla para {0}
855=No se puede cancelar el registro del servicio.
900=No se pueden definir los valores predeterminados de atributo del esquema del servicio.
901=No se puede obtener el subesquema del servicio.
902=La sesi\u00f3n no es v\u00e1lida.
903=Imposible a\u00f1adir proceso de escucha de servicio.
904=Imposible obtener las clases de objeto del servicio.
905=Imposible obtener jerarqu\u00eda de servicio.
906=Imposible obtener nombres de servicio.
907=Imposible obtener tipos de esquema de servicio.
908=Imposible obtener esquema de servicio.
909=Imposible obtener nombre de archivo del servicio i18n.
910=Imposible obtener URL de Bean de la vista de servicio.
911=Imposible obtener nombres de atributos de servicio.
912=Imposible eliminar valores predeterminados del atributo de esquema de servicio.
913=Imposible cancelar el registro del servicio: {0}
914=Imposible registrar el servicio.
915=Imposible obtener atributos de servicio.
916=No se puede definir clave i18n de esquema de atributos.
917=No existe el servicio.
919=Contrase\u00f1a del historial: C\u00e1mbiela por una contrase\u00f1a nueva.
967=No se permite cambiar el atributo de nombre.
968=El n\u00famero de entradas encontradas excede el l\u00edmite administrativo con respecto al n\u00famero m\u00e1ximo de entradas que se deben devolver.
969=Infracci\u00f3n en la restricci\u00f3n de Namespace: se han encontrado varios usuarios con uid {0}.
970=No se ha proporcionado un nombre de dominio.
971= No se han encontrado entradas coincidentes o hay demasiadas entradas coincidentes para el Id.: {0}
972= Imposible a\u00f1adir miembros al rol de administrador: {0}
973= Imposible eliminar miembros del rol de administrador: {0}
974=El periodo de gracia no ha caducado. No se purgar\u00e1 el objeto.
975=Fallo en la validaci\u00f3n de datos para el atributo: {0}
976=Fallo en el servicio de validaci\u00f3n de datos {0}
977=No se puede eliminar el contenedor. Se han hallado entradas. Elim\u00ednelas manualmente e int\u00e9ntelo de nuevo.
978=El servicio no est\u00e1 definido para objetos administrados: {0}
1000=Nueva excepci\u00f3n gen\u00e9rica
1001=No se ha especificado un tipo de esquema para este servicio {0}
1002={0}- contiene caracteres no v\u00e1lidos: {1}
