#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2009 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: CoreToken_es.properties,v 1.1 2009/12/26 03:55:07 cbasha Exp $
#
#

onlinehelp.doc=coretoken.html
sunCoreTokenConfigServiceDescription=Servicio de token de n\u00facleo
a101=Lista de atributos de b\u00fasqueda
a101.help=Define una lista de nombres de atributo que se utilizan en la operaci\u00f3n de b\u00fasqueda de token. Los atributos se indexar\u00e1n para optimizar la b\u00fasqueda. La operaci\u00f3n de b\u00fasqueda de token se denegar\u00e1 si faltan atributos de b\u00fasqueda en la lista. 
a102=Intervalo de limpieza de token para que caduque el token (en segundos).
a102.help=El valor 0 significa que no es necesario limpiar para que caduque el token.
a103=Tipos de token si imposici\u00f3n de ETag

# Exception error code
10=Formato de fecha no v\u00e1lido {0}.
11=El token ya caduc\u00f3 el {0}.
20=Tipo de token no v\u00e1lido {0}.
#30=Invalid JSON encode attribute values.

201=La entidad conten\u00eda un atributo token.id, que no debe incluirse en una solicitud POST para crear un token.
202=No se puede crear el token en el almac\u00e9n de tokens.
203=No se puede encontrar el token con el token.id especificado.
204=No se puede leer el token.
205=No se puede eliminar el token.
206=No se puede actualizar el token.
#207=Unable to parse JSON encoded attribute value from token {0}.
208=La etiqueta de entidad {0} no coincide con la del token.
209=No se puede leer el token porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
210=No se puede actualizar el token porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
211=No se puede eliminar el token porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
212=No se puede crear el token porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
215=No se pueden buscar tokens.
216=No se puede buscar el token porque falta el token de inicio de sesi\u00f3n \u00fanico de administrador.
217=La solicitud no conten\u00eda un atributo {0}, que es necesario para la operaci\u00f3n.
218=No hay ning\u00fan par\u00e1metro de consulta especificado en la solicitud de b\u00fasqueda.
219=Par\u00e1metro de consulta {0} no v\u00e1lido especificado en la solicitud de b\u00fasqueda.

220=La solicitud HTTP no conten\u00eda un encabezado If-Match, que es necesario para la operaci\u00f3n.
221=No se puede modificar el atributo token.id.
222=La solicitud no conten\u00eda un atributo {0}, que es necesario para la operaci\u00f3n.
223=El atributo {0} especificado en la solicitud no es de b\u00fasqueda.
224=No se puede modificar el atributo token.type.
225=Nombre de atributo de token {0} no v\u00e1lido, nombre de atributo con prefijo "token". est\u00e1 reservado en exclusiva al servicio de token.
226=El atributo {0} incluido en la solicitud debe tener un valor \u00fanico.
227=Nombre de atributo de token {0} no v\u00e1lido, el nombre de atributo debe llevar el prefijo de tipo de token.

301=La sesi\u00f3n no es v\u00e1lida o ha caducado. Esto suele ocurrir cuando otra parte invalida la sesi\u00f3n o si se agota su tiempo de espera de inactividad.
302=No se pudo instanciar el almac\u00e9n de tokens de n\u00facleo.
