/**
 * NO MODIFICAR O ELIMINAR LAS NOTAS DE COPYRIGHT NI ESTE ENCABEZADO.
 *
 * Copyright (c) 2008 Sun Microsystems, Inc. Todos los derechos reservados
 *
 * Los contenidos de este archivo est\u00e1n sujetos a los t\u00e9rminos estipulados
 * en la Licencia de desarrollo com\u00fan y distribuci\u00f3n 
 * (la Licencia). Este archivo s\u00f3lo puede utilizarse 
 * de conformidad con la Licencia.
 *
 * Puede obtener una copia de la Licencia en
 * https://opensso.dev.java.net/public/CDDLv1.0.html o en
 * opensso/legal/CDDLv1.0.txt.
 * Consulte la Licencia para conocer los permisos espec\u00edficos que rigen cada idioma y 
 * las limitaciones estipuladas en ella.
 *
 * Cuando se distribuya c\u00f3digo cubierto, es necesario incluir este 
 * encabezado de aviso de Licencia e incluir el archivo de la Licencia disponible en 
 * opensso/legal/CDDLv1.0.txt.
 * Si fuera necesario, a\u00f1ada lo siguiente bajo el encabezado, 
 * sustituyendo los campos entre corchetes [] 
 * por su informaci\u00f3n personal:
 * "Porciones protegidas por Copyright [a\u00f1o] [nombre del propietario del Copyright]"
 *
 * $Id: ServerConfigReport_es.properties,v 1.3 2009/12/26 03:55:07 cbasha Exp $
 *
 */

#General
service-start-msg=Servicio de informes iniciado...
service-done-msg=Servicio de informes finalizado...
msg-fail=Fallido
msg-pass=Transmitido
msg-ok=Correcto

#Server report
invalid-bootstrap-location= Localizaci\u00f3n de c\u00f3digo de inicio no v\u00e1lida:
cannot-bootstrap-system=No se puede ejecutar el c\u00f3digo de inicio del sistema.
cannot-load-properties=No se pueden cargar las propiedades del directorio: {0}
rpt-svr-print-prop={0}={1}
rpt-svr-gen=Creando informe del servidor 
rpt-auth-msg=Fallo de autenticaci\u00f3n 

#KeyStore report
rpt-cert-gen=Creando informe del almac\u00e9n de claves 
rpt-storepwd-file-not-exist=No existe archivo de contrase\u00f1a de almac\u00e9n: {0}
rpt-invalid-storepassd=Contrase\u00f1a de almac\u00e9n no v\u00e1lida
rpt-invalid-storepass-file=Nombre/ruta de archivo storepass no v\u00e1lido: {0}
rpt-invalid-storepwd-prop=La propiedad de la contrase\u00f1a de almac\u00e9n no es correcta.
rpt-keystore-file-not-exist=El archivo del almac\u00e9n de claves no existe: {0}
rpt-invalid-keystore-file=Nombre/ruta de archivo de almac\u00e9n de claves no v\u00e1lido: {0}
rpt-loading-keystore=Cargando almac\u00e9n de claves
rpt-loading-failed=No se pudo cargar el almac\u00e9n de claves con la contrase\u00f1a introducida.

#Agent report
rpt-agt-gen=Creando informe de agente 
rpt-agt-auth-to-svr-fail=Fallo de autenticaci\u00f3n en el servidor con las credenciales de usuario para: {0}
rpt-agt-auth-to-svr=Autenticando en el servidor con las credenciales de inicio
rpt-agt-fatal-connect-err=\u00a1\u00a1\u00a1Error grave!!! No se puede establecer contacto con el servicio de asignaci\u00f3n de nombres: {0}
rpt-agt-invalid-naming-url=URL de asignaci\u00f3n de nombres no v\u00e1lida en las propiedades de c\u00f3digo de inicio: {0}
rpt-agt-naming-url-validation=Validando la URL de asignaci\u00f3n de nombres en las propiedades de c\u00f3digo de inicio
rpt-agt-naming-url-connect=Conectando mediante la URL de asignaci\u00f3n de nombres: {0}
rpt-agt-svr-connect-status=Comprobando la conexi\u00f3n con el servidor: {0}
rpt-agt-loading-cfg-prop=Cargando las propiedades del agente desde el servidor.
rpt-agt-cfg-type=Tipo: {0}
rpt-agt-name=Propiedades para: {0}

