/**
 * NO MODIFICAR O ELIMINAR LAS NOTAS DE COPYRIGHT NI ESTE ENCABEZADO.
 *
 * Copyright (c) 2008 Sun Microsystems, Inc. Todos los derechos reservados
 *
 * Los contenidos de este archivo est\u00e1n sujetos a los t\u00e9rminos estipulados
 * en la Licencia de desarrollo com\u00fan y distribuci\u00f3n 
 * (la Licencia). Este archivo s\u00f3lo puede utilizarse 
 * de conformidad con la Licencia.
 *
 * Puede obtener una copia de la Licencia en
 * https://opensso.dev.java.net/public/CDDLv1.0.html o en
 * opensso/legal/CDDLv1.0.txt.
 * Consulte la Licencia para conocer los permisos espec\u00edficos que rigen cada idioma y 
 * las limitaciones estipuladas en ella.
 *
 * Cuando se distribuya c\u00f3digo cubierto, es necesario incluir este 
 * encabezado de aviso de Licencia e incluir el archivo de la Licencia disponible en 
 * opensso/legal/CDDLv1.0.txt.
 * Si fuera necesario, a\u00f1ada lo siguiente bajo el encabezado, 
 * sustituyendo los campos entre corchetes [] 
 * por su informaci\u00f3n personal:
 * "Porciones protegidas por Copyright [a\u00f1o] [nombre del propietario del Copyright]"
 *
 * $Id: ServerConfigService_es.properties,v 1.3 2009/12/26 03:55:07 cbasha Exp $
 *
 */

#General
service-start-msg=Servicio de configuraci\u00f3n del servidor iniciado...
service-done-msg=Servicio de configuraci\u00f3n del servidor finalizado...
invalid-bootstrap-location= Localizaci\u00f3n de c\u00f3digo de inicio no v\u00e1lida:
cannot-bootstrap-system=No se puede ejecutar el c\u00f3digo de inicio del sistema.
cannot-load-properties=No se pueden cargar las propiedades del directorio: {0}
msg-fail=Fallido
msg-pass=Correcto
msg-ok=Correcto

svr-auth-msg=Fallo de autenticaci\u00f3n
#
#SAML general message
#
saml-validate-cfg=Validando configuraci\u00f3n SAML
saml-validate-cfg-prop=Validando propiedades SAML.
saml-file-loc=Archivo: {0}

#store password related 
saml-validate-storepwd-prop=Validando la propiedad de contrase\u00f1a del almac\u00e9n
saml-invalid-storepwd-prop=La propiedad de la contrase\u00f1a de almac\u00e9n no es correcta.
saml-storepwd-file-not-exist=No existe archivo de contrase\u00f1a de almac\u00e9n: {0}
saml-invalid-storepass-file=Nombre/ruta de archivo storepass no v\u00e1lido: {0}
saml-invalid-storepassd=Contrase\u00f1a de almac\u00e9n no v\u00e1lida
saml-storepass-empty=No se puede leer la contrase\u00f1a del almac\u00e9n. Compruebe si el archivo est\u00e1 vac\u00edo.

#key password related 
saml-keypwd-file-not-exist=El archivo de contrase\u00f1a de clave no existe: {0}
saml-invalid-keypass-file=Nombre/ruta de archivo keypass no v\u00e1lido: {0}
saml-validate-keypwd-prop=Validando la propiedad de contrase\u00f1a de clave
saml-invalid-keypwd-prop=La propiedad de la contrase\u00f1a de clave no es correcta.
saml-keypass-empty=No se puede leer la contrase\u00f1a de clave. Compruebe si el archivo est\u00e1 vac\u00edo.
saml-invalid-keypassd=Contrase\u00f1a de clave no v\u00e1lida

#key store related 
saml-validate-keystore-prop=Validando la propiedad almac\u00e9n de claves
saml-invalid-keystore-prop=La propiedad almac\u00e9n de claves no es correcta.
saml-validate-keystore-pwd=Validando la contrase\u00f1a del almac\u00e9n de claves
saml-invalid-keystore-file=Nombre/ruta de archivo de almac\u00e9n de claves no v\u00e1lido: {0}
saml-keystore-file-not-exist=El archivo del almac\u00e9n de claves no existe: {0}
saml-loading-keystore=Cargando almac\u00e9n de claves
saml-open-ks-failed=No se pudo abrir el almac\u00e9n de claves con la contrase\u00f1a introducida.
saml-loading-failed=No se pudo cargar el almac\u00e9n de claves con la contrase\u00f1a introducida.

#cert alias
saml-cannot-validate-ks-pwd=No se puede validar la contrase\u00f1a de claves. Alias de certificado no v\u00e1lido: {0}
saml-cert-alias-mismatch=No hay certificado para el alias especificado: {0}
saml-validate-cert-alias=Validando alias de cert. SAML.

#xml signature
saml-validate-xml-sig=Validando algoritmo de firma XML.
saml-missing-prop=Falta la propiedad necesaria: {0}
saml-empty-prop-val=El valor de la propiedad est\u00e1 vac\u00edo para: {0}
saml-inv-xml-alg-val=Valor no v\u00e1lido para el algoritmo de firma XML: {0}
saml-xml-alg-mismatch=El algoritmo especificado {0} no coincide con el certificado: {1}
saml-cannot-validate-sig=No se puede validar la firma. Alias de certificado no v\u00e1lido.

saml-invalid-cfg-prop=Las propiedades asociadas al SAML contienen valores no v\u00e1lidos.
saml-prop-not-cfgd=Las propiedades SAML no est\u00e1n configuradas.
saml-exp-cfg-info-validation=Excepci\u00f3n durante la validaci\u00f3n de la informaci\u00f3n de configuraci\u00f3n SAML: {0}
saml-detect-prop=Detectando propiedades asociadas al SAML.

#
# Server configuration 
#
#Server
svr-get-boot-corrupt=Leyendo archivo de c\u00f3digo de inicio
svr-get-boot-info=Leyendo archivo de c\u00f3digo de inicio para los servidores de inicio.
svr-boot-parse-err=No se puede analizar el archivo de c\u00f3digo de inicio en: {0} 
svr-boot-not-found=No se puede encontrar el archivo de c\u00f3digo de inicio en: {0}
svr-boot-read-err=Error de lectura del archivo de c\u00f3digo de inicio en: {0}
svr-all-boot-svr-dwn=Todos los servidores de inicio fallan en la ubicaci\u00f3n: {0}
svr-ins-prop-load-fail=No se pueden cargar las propiedades para la instancia: {0}
svr-prop-load-fail=Error grave. No se han podido cargar las propiedades. Consulte el archivo de depuraci\u00f3n.
svr-ins-running=Validando si hay alguna instancia del servidor en ejecuci\u00f3n.
svr-ins-not-running=No hay instancias de servidor ejecut\u00e1ndose en: {0}
svr-validate-ins-prop=Validando las propiedades de: {0}
svr-no-svr-entry=No se ha encontrado ninguna entrada de servidor para la instancia del servidor: {0}
svr-glog-prop-chg=Detectando propiedades modificadas globalmente.
svr-ins-prop-chg=Detectando propiedades modificadas por instancias.
svr-process-svr-ins=Procesando instancia del servidor: {0} 
svr-prop-not-in-valid-list=La propiedad no est\u00e1 en una lista v\u00e1lida: {0} 
svr-invalid-prop=Propiedad no v\u00e1lida: {0}
svr-ins-prop-unswapped=Las propiedades de la instancia no est\u00e1n intercambiadas para la instancia: {0}
svr-notify-url-validation=Validando URL de notificaci\u00f3n
svr-invalid-value=Valor no v\u00e1lido - propiedad: {0} valor: {1}  
svr-no-site-cfg=La instancia del servidor {0} no pertenece a ning\u00fan sitio.
svr-validate-site-cfg=Validando la configuraci\u00f3n del sitio del servidor
svr-belongs-to-invalid-site=La instancia del servidor pertenece a un sitio que no existe: {0}
svr-url-prop-mismatch=La entrada del servidor no se corresponde con una URL creada a partir de las propiedades: {0}
svr-org-alias-entry=Entrada de servidor en Alias de organizaci\u00f3n
svr-entry-not-in-org-alias=La instancia del servidor no tiene entrada en el Alias de organizaci\u00f3n: {0}
svr-validating-php-uri=Validando entrada del servidor con propiedades de protocolo://host:puerto/uri 
svr-process-enc-key=Comprobando todas las claves de cifrado.
svr-validating-enc-key=Validando clave de cifrado.
svr-entries-with-multiple-enc-key=Las entradas del servidor tienen claves contradictorias.
svr-enc-key-list=Clave: "{0}": utilizada por "{1}" 
svr-print-prop={0}={1}
svr-persist-prop=Validando la propiedad de b\u00fasqueda persistente
svr-persist-prop-err=
#Site
site-validate-cfg-prop=Validando la configuraci\u00f3n del sitio
site-org-alias-check=Validando la entrada del sitio compar\u00e1ndola con el Alias de organizaci\u00f3n 
site-org-alias-fail=No existe ninguna entrada en Alias de organizaci\u00f3n para el sitio: {0}
site-invalid-url=URL de sitio no v\u00e1lida: {0}
site-url-syntax=Validando la sintaxis de la entrada URL del sitio
site-host-validate=Validando el nombre de host del sitio  
site-url-process-entry=Procesando entrada del sitio: {0}
site-url-validate=Validando el formato del nombre de la URL del sitio 
site-invalid-site-host=Nombre de host del sitio no v\u00e1lido: {0}
site-uri-misplace=URI de instalaci\u00f3n extraviado en URL del sitio: {0}
site-url-syntax-err=Sintaxis de la URL del sitio no v\u00e1lida. Falta el URI de instalaci\u00f3n o no es v\u00e1lido: {0}
site-missing-svr-uri=Falta el valor URI de instalaci\u00f3n del servidor: {0}
site-svr-url-in-site=La URL del servidor no se puede utilizar como entrada de sitio: {0}
site-in-svr-list=Validando entradas de sitio compar\u00e1ndolas con las entradas del servidor.
site-not-configured=No hay ning\u00fan sitio configurado.

#
#Session Failover 
#
sfo-validate-cfg-prop=Validando configuraci\u00f3n de conmutaci\u00f3n por error de sesi\u00f3n
sfo-validate-jdbc-url=Validando URL de la base de datos 
sfo-jdbc-url-empty=La URL de la base de datos est\u00e1 vac\u00eda.
sfo-jdbc-url=URL: {0}
sfo-jdbc-url-invalid=URL no v\u00e1lida: {0}
sfo-jdbc-url-single=La URL de la base de datos contiene un \u00fanico servidor de cola de mensajes.
sfo-jdbc-url-no-port=Sintaxis del nombre de host no v\u00e1lida. Falta un puerto: {0}
sfo-jdbc-url-invalid-host=Nombre de host no v\u00e1lido: {0}
sfo-jdbc-url-invalid-port=Puerto no v\u00e1lido: {0}
sfo-cfg-enabled=Se ha activado la conmutaci\u00f3n por error de sesi\u00f3n para la instancia: {0}
sfo-cfg-not-enabled=La conmutaci\u00f3n por error de sesi\u00f3n no est\u00e1 habilitada para la instancia: {0}
sfo-cfg-prop-details=Detalles de la configuraci\u00f3n de conmutaci\u00f3n por error de sesi\u00f3n: 
sfo-cfg-prop-notfound=No se ha podido obtener la configuraci\u00f3n de conmutaci\u00f3n por error de sesi\u00f3n.
sfo-cfg-params=UserName = {0} \n clusterServerList = {1} \n connectionMaxWaitTime = {2} \n minPoolSize = {3} \n maxPoolSize = {4}

#
#Directory Server
#
ds-ins-validation=Validando mediante instancia del servidor de directorios: {0} 
ds-ins-connect=Estableciendo conexi\u00f3n con el servidor de directorios.
ds-connect-at-suffix=Conectando con el servidor de directorios con el sufijo: {0}
ds-failed-connect-at-suffix=No se ha podido conectar con el servidor de directorios en el sufijo: {0}
ds-sfx-connect=Con\u00e9ctese con un sufijo configurado.
ds-not-running=El servidor de directorios no se ejecuta a las: {0}:{1}
ds-no-ins-to-connect=No hay ning\u00fan servidor de directorio de configuraci\u00f3n disponible al que conectarse.
