#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2012 Open Source Solution Technology Corporation. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# http://forgerock.org/license/CDDLv1.0.html
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at http://forgerock.org/license/CDDLv1.0.html
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Portions Copyrighted 2015 ForgeRock AS.
#

authentication=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb
iPlanetAMAuthAuthenticatorOATHServiceDescription=ForgeRock Authenticator (OATH)
a500 = \u8a8d\u8a3c\u30ec\u30d9\u30eb
a500.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a500.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0\uff08\u30c7\u30d5\u30a9\u30eb\u30c8\uff09\u304c\u6700\u4f4e\u3067\u3059\u3002
a501=\u30ef\u30f3\u30bf\u30a4\u30e0\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u9577\u3055
a501.help=\u751f\u6210\u3059\u308b OTP \u306e\u6841\u6570\u30026\u6841\u4ee5\u4e0a\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
a502=\u79d8\u5bc6\u9375\u306e\u6700\u5c0f\u6841\u6570
a502.help=\u79d8\u5bc6\u9375\u3068\u3057\u3066\u8a31\u5bb9\u3055\u308c\u308b16\u9032\u6570\u6587\u5b57\u306e\u6841\u6570\u3002
a503=\u79d8\u5bc6\u9375\u306e\u5c5e\u6027\u540d
a503.help=\u30e6\u30fc\u30b6\u30fc\u306e\u79d8\u5bc6\u9375\u3092\u683c\u7d0d\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5c5e\u6027\u306e\u540d\u524d\u3002
a504=\u4f7f\u7528\u3059\u308b OATH \u30a2\u30eb\u30b4\u30ea\u30ba\u30e0
a504.help=\u4f7f\u7528\u3057\u3066\u3044\u308b\u30c7\u30d0\u30a4\u30b9\u304c OTP \u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u9078\u629e\u3057\u307e\u3059\u3002
a504.help.txt=HOTP \u306f\u3001\u65b0\u3057\u3044 OTP \u304c\u751f\u6210\u3055\u308c\u308b\u305f\u3073\u306b\u52a0\u7b97\u3055\u308c\u308b\u30ab\u30a6\u30f3\u30bf\u5024\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002TOTP \u306f\u3001\u65b0\u3057\u3044 OTP \u3092\u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u671f\u9593\u306b\u3088\u308a\u6307\u5b9a\u3055\u308c\u305f\u79d2\u3054\u3068\u306b\u751f\u6210\u3057\u307e\u3059\u3002
a505=HOTP \u30a6\u30a4\u30f3\u30c9\u30a6\u30b5\u30a4\u30ba
a505.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3068\u518d\u540c\u671f\u3059\u308b\u305f\u3081\u306e\u30a6\u30a3\u30f3\u30c9\u30a6\u30b5\u30a4\u30ba\u3002
a505.help.txt=OTP \u30c7\u30d0\u30a4\u30b9\u3068\u30b5\u30fc\u30d0\u30fc\u30ab\u30a6\u30f3\u30bf\u304c\u540c\u671f\u3057\u306a\u304f\u3066\u3082\u3044\u3044\u3088\u3046\u306b\u3067\u304d\u308b\u30a6\u30a3\u30f3\u30c9\u30a6\u30b5\u30a4\u30ba\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002\u305f\u3068\u3048\u3070\u3001\u30a6\u30a3\u30f3\u30c9\u30a6\u30b5\u30a4\u30ba\u304c100\u3067\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u6700\u7d42\u6210\u529f\u30ed\u30b0\u30a4\u30f3\u304c\u30ab\u30a6\u30f3\u30bf\u5024\u30672\u3067\u3042\u3063\u305f\u5834\u5408\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u30c7\u30d0\u30a4\u30b9\u30ab\u30a6\u30f3\u30bf3\u304b\u3089102\u3067\u3042\u308b OTP \u30c7\u30d0\u30a4\u30b9\u304b\u3089\u306e OTP \u3092\u53d7\u3051\u5165\u308c\u307e\u3059\u3002
a506=\u30ab\u30a6\u30f3\u30bf\u5c5e\u6027\u540d
a506.help=\u30e6\u30fc\u30b6\u30fc\u306e\u30ab\u30a6\u30f3\u30bf\u3092\u683c\u7d0d\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5185\u306e\u5c5e\u6027\u306e\u540d\u524d\u3002HOTP \u304c OATH \u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3068\u3057\u3066\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u308c\u304c\u5fc5\u9808\u306b\u306a\u308a\u307e\u3059\u3002
a507=\u30c1\u30a7\u30c3\u30af\u30b5\u30e0\u6570\u5b57\u306e\u8ffd\u52a0
a507.help=OTP \u306b\u30c1\u30a7\u30c3\u30af\u30b5\u30e0\u6570\u5b57\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
a507.help.txt=OTP \u304c\u6b63\u3057\u304f\u751f\u6210\u3055\u308c\u305f\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u30c1\u30a7\u30c3\u30af\u30b5\u30e0\u3068\u3057\u3066\u751f\u6210\u3055\u308c\u305f\u6570\u5b57\u3092\u3001 OTP \u306e\u672b\u5c3e\u306b\u8ffd\u52a0\u3057\u307e\u3059\u3002\u5b9f\u969b\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u9577\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002\u30c7\u30d0\u30a4\u30b9\u304c\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u308b\u5834\u5408\u306b\u306e\u307f\u3001\u3053\u306e\u8a2d\u5b9a\u3092\u884c\u3044\u307e\u3059\u3002
a508=\u30c8\u30e9\u30f3\u30b1\u30fc\u30b7\u30e7\u30f3\u30aa\u30d5\u30bb\u30c3\u30c8
a508.help=OTP \u306e\u751f\u6210\u306b\u30aa\u30d5\u30bb\u30c3\u30c8\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
a508.help.txt=\u4e00\u90e8\u306e\u30c7\u30d0\u30a4\u30b9\u304c\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u308b HOTP \u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u3059\u3002\u30c7\u30d0\u30a4\u30b9\u304c\u30aa\u30d5\u30bb\u30c3\u30c8\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u7406\u89e3\u3057\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u307e\u307e\u306b\u3057\u3066\u304a\u304f\u3079\u304d\u3067\u3059\u3002
a509=TOTP \u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u671f\u9593
a509.help=OTP \u30c7\u30d0\u30a4\u30b9\u304c OTP \u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u79d2\u5358\u4f4d\u306e TOTP \u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u3002
a509.help.txt=1\u3064\u306e OTP \u304c\u6709\u52b9\u3067\u3042\u308b\u6642\u9593\u306e\u9593\u9694\u3067\u3059\u3002\u305f\u3068\u3048\u3070\u3001\u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u304c30\u79d2\u306e\u5834\u5408\u3001\u65b0\u3057\u3044 OTP \u306f30\u79d2\u3054\u3068\u306b\u751f\u6210\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u4e00\u3064\u306e OTP \u306f30\u79d2\u9593\u3060\u3051\u6709\u52b9\u306b\u306a\u308a\u307e\u3059\u3002
a510=TOTP \u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u6570
a510.help=OTP \u3092\u53d7\u3051\u53d6\u3063\u305f\u524d\u5f8c\u306e\u30c1\u30a7\u30c3\u30af\u306e\u305f\u3081\u306e\u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u306e\u6570\u3002
a510.help.txt=OTP \u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u305f\u3081\u306e\u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u671f\u9593\u306e\u6570\u3067\u3059\u3002\u53d7\u4fe1\u6642\u9593\u306e\u524d\u5f8c\u306b\u9069\u7528\u3055\u308c\u307e\u3059\u3002\u305f\u3068\u3048\u3070\u3001\u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u6570\u304c2\u3067\u30bf\u30a4\u30e0\u30b9\u30c6\u30c3\u30d7\u671f\u9593\u304c30\u79d2\u306e\u5834\u5408\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b5\u30fc\u30d0\u30fc\u9593\u306789\u79d2\u306e\u30af\u30ed\u30c3\u30af\u30c9\u30ea\u30d5\u30c8\u304c\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002( OTP \u304c\u5230\u7740\u3057\u305f\u9593\u9694\u306e\u305f\u3081\u30012\u00d730\u79d2\uff0b29\u79d2\uff1d89\u79d2) 
a511=\u6700\u7d42\u30ed\u30b0\u30a4\u30f3\u6642\u9593\u5c5e\u6027
a511.help=\u30e6\u30fc\u30b6\u30fc\u306e\u6700\u7d42\u30ed\u30b0\u30a4\u30f3\u6642\u9593\u3092\u683c\u7d0d\u3059\u308b\u5c5e\u6027\u3002 TOTP \u304c OATH \u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3068\u3057\u3066\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u308c\u306f\u5fc5\u9808\u3067\u3059\u3002
a511.help.txt=\u3053\u306e\u5c5e\u6027\u306f\u3001\u6642\u9593\u30d9\u30fc\u30b9\u306e\u653b\u6483\u3092\u9632\u3050\u305f\u3081\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u304c\u6700\u5f8c\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u305f\u6642\u523b\u3092\u683c\u7d0d\u3057\u307e\u3059\u3002\u5024\u306f\u6570\u5024( UNIX \u6642\u523b)\u3068\u3057\u3066\u683c\u7d0d\u3055\u308c\u307e\u3059\u3002
HOTP=HOTP
TOTP=TOTP
authFailed=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002