#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amAuth_ja.properties,v 1.12 2009/12/26 03:51:44 cbasha Exp $
#

# Portions Copyrighted 2011-2013 ForgeRock Inc
# Portions Copyrighted 2012 Open Source Solution Technology Corporation

onlinehelp.doc=coreauth.html
authentication=\u8a8d\u8a3c

sessNotActive=\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u3042\u308a\u307e\u305b\u3093
requestReceived=**** Authd \u8981\u6c42\u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f ***
Authentication=\u8a8d\u8a3c
Cert=\u8a3c\u660e\u66f8
Radius=RADIUS
RADIUS=RADIUS
LDAP=LDAP
Membership=\u30e1\u30f3\u30d0\u30fc\u30b7\u30c3\u30d7
NT=NT
SecurID=SecurID
Anonymous=\u533f\u540d
HTTPBasic=HTTP \u57fa\u672c
WindowsDesktopSSO=Windows \u30c7\u30b9\u30af\u30c8\u30c3\u30d7 SSO
JDBC=JDBC
AD=Active Directory
MSISDN=MSISDN
DataStore=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2
UserId=\u30e6\u30fc\u30b6\u30fc ID
UserDomain=\u30e6\u30fc\u30b6\u30fc\u30c9\u30e1\u30a4\u30f3
loginSuccess=\u30ed\u30b0\u30a4\u30f3\u306b\u6210\u529f\u3057\u307e\u3057\u305f
loginFailed=\u30ed\u30b0\u30a4\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f
invalidPasswd=\u7121\u52b9\u306a\u30d1\u30b9\u30ef\u30fc\u30c9
noSuchAlgorithm=\u305d\u306e\u3088\u3046\u306a\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u306f\u3042\u308a\u307e\u305b\u3093
noUserName=\u30e6\u30fc\u30b6\u30fc\u540d\u304c\u3042\u308a\u307e\u305b\u3093
invalidKey=\u7121\u52b9\u306a\u30ad\u30fc
restricted=\u5236\u9650\u4ed8\u304d userid \u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7d42\u4e86\u3057\u307e\u3057\u305f
noMatchDomainURL=\u30c9\u30e1\u30a4\u30f3 URL \u306b\u4e00\u81f4\u3059\u308b\u9805\u76ee\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
userLoginDisabled=\u30e6\u30fc\u30b6\u30fc\u30ed\u30b0\u30a4\u30f3\u304c\u7121\u52b9\u3067\u3059
adminAuthFailedUid=\u7ba1\u7406\u8005\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u305f\u30e6\u30fc\u30b6\u30fc ID:
adminSessLogoutUid=\u7ba1\u7406\u8005\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u305f\u30e6\u30fc\u30b6\u30fc ID:
sessLogoutUid=\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u305f\u30e6\u30fc\u30b6\u30fc ID:
submit=\u9001\u4fe1
modprop=\u8a8d\u8a3c\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c null \u3067\u3059\u3002
NoUser=\u30e6\u30fc\u30b6\u30fc ID \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
InvalidUP=\u30e6\u30fc\u30b6\u30fc ID \u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u7121\u52b9\u3067\u3059\u3002\u3082\u3046\u4e00\u5ea6\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
FAuth=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
InappAuth=\u8a8d\u8a3c\u304c\u4e0d\u9069\u5f53\u3067\u3059\u3002
LDAPex=\u4e0d\u660e\u306a LDAP \u4f8b\u5916\u3002
iplanet-am-auth-service-description=\u30b3\u30a2
Create=\u52d5\u7684
CreateWithAlias=\u30e6\u30fc\u30b6\u30fc\u30a8\u30a4\u30ea\u30a2\u30b9\u3092\u4f7f\u7528\u3057\u3066\u52d5\u7684\u306b
Required=\u5fc5\u9808
Ignore=\u7121\u8996
ServiceDoesNotExist=\u30b5\u30fc\u30d3\u30b9\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
gettingSessionFailed=AuthD \u304c\u8a8d\u8a3c\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f
invalidSessionID=\u30bb\u30c3\u30b7\u30e7\u30f3 ID \u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
a101=\u7d44\u7e54\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb
a101.help=\u3053\u306e\u7d44\u7e54\u3067\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3002
a102=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb
a102.help=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u8a8d\u8a3c\u6210\u529f\u306e\u7d50\u679c\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a102.help.txt=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304c\u8a8d\u8a3c\u6210\u529f\u306b\u5fc5\u8981\u3067\u3042\u308b\u304b\u3001\
\u307e\u305f\u306f\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u306b\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u52d5\u7684\u306b\u4f5c\u6210\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a104=\u7ba1\u7406\u8005\u8a8d\u8a3c\u8a2d\u5b9a
a104.help=\u7ba1\u7406\u8005\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u8a8d\u8a3c\u9023\u9396\u3002
a104.help.txt=\u3053\u306e\u30ec\u30eb\u30e0\u306b\u304a\u3044\u3066\u3001\u7ba1\u7406\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u306b\u4f7f\u7528\u3055\u308c\u308b\u8a8d\u8a3c\u9023\u9396\u3067\u3059\u3002
a105=\u52d5\u7684\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u4f5c\u6210\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30ed\u30fc\u30eb
a105.help=\u65b0\u898f\u30e6\u30fc\u30b6\u30fc\u306b\u5272\u308a\u5f53\u3066\u308b\u30ed\u30fc\u30eb\u306e DN \u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
a105.help.txt=OpenAM \u306b\u3088\u3063\u3066\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304c\u52d5\u7684\u306b\u4f5c\u6210\u3055\u308c\u305f\u969b\u306b\u3001\
\u65b0\u3057\u3044\u30e6\u30fc\u30b6\u30fc\u306b\u5272\u308a\u5f53\u3066\u3089\u308c\u308b\u5404\u30ed\u30fc\u30eb\u306e DN \u3092\u5165\u529b\u3057\u307e\u3059\u3002<br/><br/><i>\u6ce8\u610f </i> OpenAM \u975e\u63a8\u5968\u6a5f\u80fd\u3002
a106=\u8a8d\u8a3c\u9023\u9396\u30e2\u30b8\u30e5\u30fc\u30eb
a107=\u8a8d\u8a3c\u9023\u9396\u3092\u6709\u52b9
a108=\u6301\u7d9a Cookie \u30e2\u30fc\u30c9
a108.help=OpenAM \u8a8d\u8a3c\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3078\u306e\u6301\u7d9a Cookie \u30e2\u30fc\u30c9\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a108.help.txt=\u6301\u7d9a Cookie \u30e2\u30fc\u30c9\u3092\u6709\u52b9\u306b\u3059\u308b\u3068\u3001\u8a8d\u8a3c\u6e08\u307f OpenAM \u30e6\u30fc\u30b6\u30fc\u304c\u30d6\u30e9\u30a6\u30b6\u3092\u9589\u3058\u3066\u304b\u3089 OpenAM \u306b\u623b\u3063\u305f\u5f8c\u3067\u3001 \
OpenAM \u306b\u518d\u8a8d\u8a3c\u3059\u308b\u5fc5\u8981\u304c\u306a\u304f\u306a\u308a\u307e\u3059\u3002
a109=Cookie \u306e\u6700\u5927\u6301\u7d9a\u6642\u9593
a109.help=\u6301\u7d9a Cookie\u306e\u6709\u52b9\u671f\u9650(\u79d2)\u3002
a109.help.txt=\u6301\u7d9a Cookie \u304c\u30e6\u30fc\u30b6\u30fc\u306e\u305f\u3081\u306b\u3069\u306e\u7a0b\u5ea6\u306e\u6642\u9593\u5b58\u5728\u3059\u3079\u304d\u304b\u3092\u5236\u5fa1\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u8a2d\u5b9a\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002<br><ul><li>3600 \u79d2: \
1 \u6642\u9593<li>86400 \u79d2: 1 \u65e5<li>2592000 \u79d2: 30 \u65e5</ul><br/><i>\u6ce8\u610f </i> \u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u3046\u305f\u3081\u306b\u306f\u3001\
\u6301\u7d9a Cookie \u30e2\u30fc\u30c9\u3092\u6709\u52b9\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a110=\u975e\u5bfe\u8a71\u578b\u30e2\u30b8\u30e5\u30fc\u30eb
a111=\u30e6\u30fc\u30b6\u30fc\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30ea\u30c0\u30a4\u30ec\u30af\u30c8 URL
a112=\u30e6\u30fc\u30b6\u30fc\u30d9\u30fc\u30b9\u306e\u8a8d\u8a3c
a113=\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u30d4\u30fc\u30d7\u30eb\u30b3\u30f3\u30c6\u30ca
a114=\u30a8\u30a4\u30ea\u30a2\u30b9\u691c\u7d22\u5c5e\u6027\u540d
a114.help=\u300c\u30e6\u30fc\u30b6\u30fc\u30cd\u30fc\u30df\u30f3\u30b0\u5c5e\u6027\u300d\u3067\u6307\u5b9a\u3055\u308c\u305f\u30d7\u30e9\u30a4\u30de\u30ea LDAP \u5c5e\u6027\u3067\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30bb\u30ab\u30f3\u30c0\u30ea LDAP \u5c5e\u6027\u3067\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u53d6\u5f97\u3057\u307e\u3059\u3002
a114.help.txt=\u3053\u306e LDAP \u5c5e\u6027\u306e\u30ea\u30b9\u30c8\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u898b\u3064\u3051\u308b\u305f\u3081\u306b OpenAM \u306b\u3088\u3063\u3066\u691c\u7d22\u3055\u308c\u305f\u5c5e\u6027\u306e\u30bb\u30c3\u30c8\u3092\u62e1\u5f35\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002<br>\
\u4f8b: <ul><li>cn</li><li>mail</li><li>givenname</li></ul><br/>\u3042\u308b\u30e6\u30fc\u30b6\u30fc\u304c\u3001 steve \u3068\u3044\u3046 ID \u3067 OpenAM \u306b\u8a8d\u8a3c\u3057\u307e\u3059\u3002 \
OpenAM \u306f\u3001\u6700\u521d\u306b\u30cd\u30fc\u30df\u30f3\u30b0\u5c5e\u6027(\u30c7\u30d5\u30a9\u30eb\u30c8\u306f uid )\u3092\u4f7f\u7528\u3057\u3066 uid=steve \u306e\u3088\u3046\u306b\u691c\u7d22\u3057\u307e\u3059\u3002\
\u4e00\u81f4\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u304c\u898b\u3064\u304b\u306a\u3044\u5834\u5408\u306f\u3001\u4e00\u81f4\u304c\u691c\u51fa\u3055\u308c\u308b\u304b\u30ea\u30b9\u30c8\u304c\u4f7f\u3044\u679c\u305f\u3055\u308c\u308b\u307e\u3067\u3001 cn=steve \u3067\u691c\u7d22\u3055\u308c\u307e\u3059\u3002<br>\
<br/><br/><i>\u6ce8\u610f </i> \u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u691c\u7d22\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a115=\u30e6\u30fc\u30b6\u30fc\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb
a117=\u30d7\u30e9\u30b0\u30a4\u30f3\u53ef\u80fd\u306a\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u30af\u30e9\u30b9
a117.help=\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30ea\u30b9\u30c8\u3002
a117.help.txt=OpenAM \u3067\u5229\u7528\u53ef\u80fd\u306a\u8a2d\u5b9a\u6e08\u307f\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30ea\u30b9\u30c8\u3002\u3059\u3079\u3066\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001 \
<code>com.sun.identity.authentication.spi.AMLoginModule</code> \u30af\u30e9\u30b9\u3092\u7d99\u627f\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a117.help.uri=#tbd
a118=\u30e6\u30fc\u30b6\u30fc\u30cd\u30fc\u30df\u30f3\u30b0\u5c5e\u6027
a118.help=\u8a8d\u8a3c\u306e\u6210\u529f\u5f8c\u3001\u30d7\u30e9\u30a4\u30de\u30ea LDAP \u5c5e\u6027\u306b\u3088\u308a\u30e6\u30fc\u30b6\u30fc\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304c\u53d6\u5f97\u3055\u308c\u307e\u3059\u3002
a119=\u30d7\u30e9\u30b0\u30a4\u30f3\u53ef\u80fd\u306a\u8a8d\u8a3c\u30da\u30fc\u30b8\u30b8\u30a7\u30cd\u30ec\u30fc\u30bf\u30af\u30e9\u30b9
a120=\u30c7\u30d5\u30a9\u30eb\u30c8\u8a8d\u8a3c\u30ed\u30b1\u30fc\u30eb
a121=\u7d44\u7e54\u8a8d\u8a3c\u8a2d\u5b9a
a121.help=\u30e6\u30fc\u30b6\u30fc\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u8a8d\u8a3c\u9023\u9396\u3002
a121.help.txt=\u3053\u306e\u30ec\u30eb\u30e0\u306b\u304a\u3044\u3066\u3001\u30e6\u30fc\u30b6\u30fc\u3092\u8a8d\u8a3c\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u8a8d\u8a3c\u9023\u9396\u3067\u3059\u3002
a125=\u30ed\u30b0\u30a4\u30f3\u5931\u6557\u6642\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u30e2\u30fc\u30c9
a125.help=\u3053\u306e\u30ec\u30eb\u30e0\u3067\u8a8d\u8a3c\u3057\u3066\u3044\u308b\u30e6\u30fc\u30b6\u30fc\u306b\u5bfe\u3059\u308b\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6a5f\u80fd\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a125.help.txt=OpenAM \u306f\u3001\u4e00\u5b9a\u6642\u9593\u5185\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u3092\u8ffd\u8de1\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
\u307e\u305f\u4e8b\u524d\u5b9a\u7fa9\u3057\u305f\u5236\u9650\u3092\u8d85\u3048\u305f\u5834\u5408\u3001\u306f\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3057\u3001\u8ffd\u52a0\u3057\u305f\u6a5f\u80fd\u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u3053\u306e\u6a5f\u80fd\u306f\u3001 LDAP Directory Server \u306b\u3088\u3063\u3066\u5b9f\u88c5\u3055\u308c\u3066\u3044\u308b\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6a5f\u80fd\u3068\u306f\u5225\u3067\u5b9f\u884c\u3055\u308c\u307e\u3059\u3002
a126=\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u3055\u308c\u308b\u8a8d\u8a3c\u5931\u6557\u56de\u6570
a126.help=\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u304c\u3053\u306e\u5024\u306b\u9054\u3059\u308b\u3068\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3055\u308c\u307e\u3059\u3002
a126.help.txt=\u3053\u306e\u8a2d\u5b9a\u306f\u3001\u300c\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u304c\u52a0\u7b97\u3055\u308c\u308b\u671f\u9593\u300d\u5185\u306b\u304a\u3051\u308b\u3001\
\u30e6\u30fc\u30b6\u30fc\u306e\u6700\u5927\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a127=\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u304c\u52a0\u7b97\u3055\u308c\u308b\u671f\u9593
a127.help=\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u304c\u52a0\u7b97\u3055\u308c\u308b\u671f\u9593\u306f\u5206\u5358\u4f4d\u3067\u3059\u3002
a127.help.txt=OpenAM \u306f\u3001\u3053\u306e\u671f\u9593\u5185\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u3092\u8ffd\u8de1\u3057\u307e\u3059\u3002<br/><br/>\u4f8b: \
\u300c\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u304c\u52a0\u7b97\u3055\u308c\u308b\u671f\u9593\u300d\u304c5\u5206\u3067\u3001\u300c\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u3055\u308c\u308b\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u300d\u304c5\u3067\u3042\u308b\u5834\u5408; \
\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u3055\u308c\u308b\u305f\u3081\u306b\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u304c5\u5206\u9593\u306b\u308f\u305f\u3063\u30665\u56de\u306e\u8a8d\u8a3c\u5931\u6557\u3092\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\
5\u5206\u3092\u8d85\u3048\u3066\u8a8d\u8a3c\u5931\u6557\u304c\u767a\u751f\u3057\u305f\u5834\u5408\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
a128=\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u901a\u77e5\u306e\u9001\u4fe1\u5148\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9
a128.help=\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u30a4\u30d9\u30f3\u30c8\u306b\u95a2\u3059\u308b\u901a\u77e5\u3092\u53d7\u3051\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u3001\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u307e\u305f\u306f\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306e\u30bb\u30c3\u30c8\u3002
a128.help.txt=OpenAM \u306f\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u30a4\u30d9\u30f3\u30c8\u304c\u767a\u751f\u3057\u305f\u3068\u304d\u306b\u3001\
\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306e\u30bb\u30c3\u30c8\u306b\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u53ef\u80fd\u306a\u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u3088\u3046\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002\
\u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5185\u5bb9\u306f\u3001 <code>amAuth.properties</code> \u30d5\u30a1\u30a4\u30eb\u5185\u306e\u6b21\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u7528\u3057\u3066\u8a2d\u5b9a\u3057\u307e\u3059\u3002\
<br/><ul><li><code>lockOutEmailFrom</code> : \u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e "From" \u30a2\u30c9\u30ec\u30b9</li>\
<li><code>lockOutEmailSub</code> : \u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u4ef6\u540d</li>\
<li><code>lockOutEmailMsg</code> : \u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u5185\u5bb9</li></ul><br/>\
\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u30e6\u30fc\u30b6\u30fc\u306eID\u306f\u3001\u96fb\u5b50\u30e1\u30fc\u30eb\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002<br/><br/>\
\u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u5f62\u5f0f\u306f:<br/>\
<code>emailaddress|locale|charset</code> \u3002\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u304c\u8907\u6570\u306e\u5834\u5408\u3001\u30b9\u30da\u30fc\u30b9\u3067\u533a\u5207\u308a\u307e\u3059\u3002<br/>\
\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306f\u3001 <code>admin@example.com</code> \u306a\u3069\u306e\u30c9\u30e1\u30a4\u30f3\u540d\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a129=\u30e6\u30fc\u30b6\u30fc\u306b\u8b66\u544a\u3092\u51fa\u3059\u307e\u3067\u306e\u5931\u6557\u56de\u6570
a129.help=\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u5931\u6557\u304c\u3053\u306e\u30ec\u30d9\u30eb\u306b\u5230\u9054\u3057\u305f\u3068\u304d\u30e6\u30fc\u30b6\u30fc\u306b\u8b66\u544a\u3057\u307e\u3059\u3002
a129.help.txt=\u300c\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u304c\u52a0\u7b97\u3055\u308c\u308b\u671f\u9593\u300d\u4e2d\u306b\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u5931\u6557\u56de\u6570\u304c\u3053\u306e\u5024\u306b\u5230\u9054\u3057\u305f\u3068\u304d\u306b\u3001\u8b66\u544a\u304c\u4e0e\u3048\u3089\u308c\u307e\u3059\u3002<br/>\
\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u8b66\u544a\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306f <code>amAuth.properties</code> \u30d5\u30a1\u30a4\u30eb\u306e <code>lockOutWarning</code> \u30d7\u30ed\u30d1\u30c6\u30a3\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
a130=\u30ed\u30b0\u30a4\u30f3\u5931\u6557\u6642\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6301\u7d9a\u6642\u9593
a130.help=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u306e\u6301\u7d9a\u6642\u9593\u3001\u5206\u5358\u4f4d\u3002
a130.help.txt=OpenAM \u306f\u3001\u4e00\u5b9a\u306e\u6642\u9593\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
\u3053\u306e\u6642\u9593\u30920\u306b\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u306b\u3088\u308a\u3001(\u7ba1\u7406\u8005\u306b\u3088\u308b\u64cd\u4f5c\u304c\u3042\u308b\u307e\u3067)\u7121\u5236\u9650\u306b\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059(\u30c7\u30d5\u30a9\u30eb\u30c8)\u3002\
\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6301\u7d9a\u6642\u9593\u306e\u5f8c\u3001\u30e6\u30fc\u30b6\u30fc\u306f\u6b63\u5e38\u306b OpenAM \u306b\u8a8d\u8a3c\u3067\u304d\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
a1301= \u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6301\u7d9a\u6642\u9593\u306e\u4e57\u6570\u5024
a1301.help=\u9023\u7d9a\u3057\u305f\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u306e\u305f\u3073\u306b\u30ed\u30b0\u30a4\u30f3\u5931\u6557\u6642\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6301\u7d9a\u6642\u9593\u306b\u4e57\u7b97\u3055\u308c\u308b\u5024\u3002
a1301.help.txt=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u306e\u305f\u3073\u306b\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6301\u7d9a\u6642\u9593\u3092\u5897\u52a0\u3055\u305b\u308b\u305f\u3081\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002\
\u4f8b\uff1a\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u6301\u7d9a\u6642\u9593\u304c10\u306b\u3001\u6642\u9593\u306e\u4e57\u6570\u304c2\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u30011\u56de\u76ee\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u306e\u6301\u7d9a\u6642\u9593\u306f10\u5206\u3068\u306a\u308a\u3001\
2\u56de\u76ee\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u306e\u6301\u7d9a\u6642\u9593\u306f20\u5206\u3068\u306a\u308a\u307e\u3059\u3002<br/><br/>\
\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306e1\u306f\u3053\u306e\u6a5f\u80fd\u3092\u7121\u52b9\u306b\u3057\u307e\u3059\u3002
a131=\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u5c5e\u6027\u540d
a131.help=\u30ab\u30b9\u30bf\u30e0\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u5c5e\u6027\u306e\u540d\u524d\u3002
a131.help.txt=OpenAM \u306f\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ed\u30c3\u30af\u3059\u308b\u3068\u3001\u30ed\u30c3\u30af\u3055\u308c\u305f\u30a2\u30ab\u30a6\u30f3\u30c8\u306e <code>inetuserstatus</code> \u306e\u5c5e\u6027\u3092 Inactive \u306b\u8a2d\u5b9a\u3057\u307e\u3059\u3002\
\u3055\u3089\u306b\u3001 OpenAM \u306f\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5185\u306e\u5225\u306e\u5c5e\u6027\u306b\u5024\u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
a132=\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u5c5e\u6027\u5024
a132.help=\u30ab\u30b9\u30bf\u30e0\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u5c5e\u6027\u306b\u8a2d\u5b9a\u3059\u308b\u5024\u3002
a132.help.txt=\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u30e6\u30fc\u30b6\u30fc\u306e\u3001\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u30ab\u30b9\u30bf\u30e0\u5c5e\u6027\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u5024\u3067\u3059\u3002
a1321=\u7121\u52b9\u306a\u8a66\u884c\u30c7\u30fc\u30bf\u5c5e\u6027\u540d
a1321.help=\u8a8d\u8a3c\u5931\u6557\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u5c5e\u6027\u306e\u540d\u524d\u3002
a1321.help.txt=OpenAM \u306f\u30e6\u30fc\u30b6\u30fc\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u7121\u52b9\u306a\u8a8d\u8a3c\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306e\u8a2d\u5b9a\u304c\u3067\u304d\u307e\u3059\u3002\
\u540c\u3058\u30b5\u30a4\u30c8\u5185\u306e\u8907\u6570\u306e OpenAM \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u9593\u3067\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u7121\u52b9\u306a\u8a8d\u8a3c\u306e\u8a66\u884c\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u5171\u6709\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u30ab\u30b9\u30bf\u30e0\u5c5e\u6027\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30af\u30e9\u30b9 <code>sunAMAuthAccountLockout</code> \u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b <code>sunAMAuthInvalidAttemptsData</code> \u304c\u3053\u306e\u30c7\u30fc\u30bf\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \
\u3053\u306e\u60c5\u5831\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b OpenAM \u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u3092\u5909\u66f4\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u6307\u5b9a\u3055\u308c\u305f\u3059\u3079\u3066\u306e\u5c5e\u6027\u306f\u3001\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u5185\u3067\u6709\u52b9\u306a\u5c5e\u6027\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a133=\u30ed\u30b0\u30a4\u30f3\u6210\u529f\u6642\u306b\u8fd4\u3059\u30c7\u30d5\u30a9\u30eb\u30c8\u306e URL
a133.help=\u30ed\u30b0\u30a4\u30f3\u6210\u529f\u5f8c\u306b\u3053\u306e URL \u3078\u8ee2\u9001\u3057\u307e\u3059\u3002
a133.help.txt=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u8a8d\u8a3c\u306b\u6210\u529f\u3057\u305f\u5f8c\u306e\u8ee2\u9001\u5148\u3068\u306a\u308b URL \u3067\u3059\u3002\u30ed\u30fc\u30ab\u30eb OpenAM \u3078\u306e \u76f8\u5bfe URL \u307e\u305f\u306f URI \u3092\u5165\u529b\u3057\u307e\u3059\u3002\
URL \u3001\u307e\u305f\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u56fa\u6709\u306e\u5834\u5408\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30bf\u30a4\u30d7|URL \u3092\u4ed8\u3051\u305f URI \u3002 http(s) \u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u3064\u304b\u306a\u3044 URL \u306e\u5834\u5408\u306f\u3001\
\u73fe\u5728\u306e OpenAM \u306e URI \u306b\u305d\u308c\u3092\u4ed8\u52a0\u3057\u307e\u3059\u3002
a134=\u30ed\u30b0\u30a4\u30f3\u5931\u6557\u6642\u306b\u8fd4\u3059\u30c7\u30d5\u30a9\u30eb\u30c8\u306e URL
a134.help=\u30ed\u30b0\u30a4\u30f3\u306b\u5931\u6557\u3057\u305f\u5834\u5408\u306f\u3001\u6b21\u306e URL \u306b\u8ee2\u9001\u3055\u308c\u307e\u3059\u3002
a134.help.txt=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u8a8d\u8a3c\u306e\u5931\u6557\u3057\u305f\u969b\u306b\u8ee2\u9001\u3055\u308c\u308b URL \u3067\u3059\u3002\u30ed\u30fc\u30ab\u30eb\u306e OpenAM \u3078\u306e\u76f8\u5bfe URL \u307e\u305f\u306f URI \u3092\u5165\u529b\u3057\u307e\u3059\u3002\
URL \u3001\u307e\u305f\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u56fa\u6709\u306e\u5834\u5408\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30bf\u30a4\u30d7|URL \u3092\u4ed8\u3051\u305f URI \u3002 http(s) \u30d7\u30ed\u30c8\u30b3\u30eb\u306e\u3064\u304b\u306a\u3044 URL \u306e\u5834\u5408\u3001\
\u73fe\u5728\u306e OpenAM \u306e URI \u306b\u305d\u308c\u3092\u4ed8\u52a0\u3057\u307e\u3059\u3002
a135=\u8a8d\u8a3c\u30dd\u30b9\u30c8\u30d7\u30ed\u30bb\u30b9\u30af\u30e9\u30b9
a135.help=\u3053\u306e\u30ec\u30eb\u30e0\u5185\u306e\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u5bfe\u3059\u308b\u30dd\u30b9\u30c8\u8a8d\u8a3c\u30d7\u30ed\u30bb\u30b9\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002
a135.help.txt=\u3053\u306e\u30ec\u30eb\u30e0\u3067\u8a8d\u8a3c\u3055\u308c\u305f\u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u5bfe\u3057\u3066\u3001 OpenAM \u304c\u547c\u3073\u51fa\u3059\u30dd\u30b9\u30c8\u30d7\u30ed\u30bb\u30b9\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u3067\u3059\u3002\
\u30dd\u30b9\u30c8\u8a8d\u8a3c\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u5834\u6240\u3068\u305d\u306e\u512a\u5148\u5ea6\u306b\u3064\u3044\u3066\u306f\u3001\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\
<br/><br/>\u4f8b: org.forgerock.auth.PostProcessClass<br/>\
<i>\u6ce8\u610f </i>OpenAM \u306f\u3001 <code>CLASSPATH</code> \u306b\u3053\u308c\u3089\u306e\u30af\u30e9\u30b9\u3092\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u3001\
\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9 <code>com.sun.identity.authentication.spi.AMPostAuthProcessInterface</code> \u3092\u5b9f\u88c5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a135.help.uri=#tbd
a138=\u30e6\u30fc\u30b6\u30fc ID \u751f\u6210\u30e2\u30fc\u30c9
a138.help=\u30e1\u30f3\u30d0\u30fc\u30b7\u30c3\u30d7\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u306f\u3001\u3053\u306e\u30e2\u30fc\u30c9\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a138.help.txt=\u3053\u306e\u30e2\u30fc\u30c9\u304c\u6709\u52b9\u306a\u3068\u304d\u3001\u30e1\u30f3\u30d0\u30fc\u30b7\u30c3\u30d7\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u63d0\u4f9b\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u540d\u3092\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u3067\u691c\u51fa\u3057\u305f\u5834\u5408\u3001\
\u305d\u306e\u30e6\u30fc\u30b6\u30fc\u304b\u3089\u306e\u8981\u6c42\u306b\u5bfe\u3057\u3066\u6709\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u540d\u306e\u30ea\u30b9\u30c8\u3092\u8868\u793a\u3057\u307e\u3059\u3002
a139=\u30d7\u30e9\u30b0\u30a4\u30f3\u53ef\u80fd\u306a\u30e6\u30fc\u30b6\u30fc\u540d\u30b8\u30a7\u30cd\u30ec\u30fc\u30bf\u30af\u30e9\u30b9
a139.help=\u30e6\u30fc\u30b6\u30fc\u540d\u30b8\u30a7\u30cd\u30ec\u30fc\u30bf\u30af\u30e9\u30b9\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5b9f\u88c5\u306e\u540d\u524d\u3002
a139.help.txt=\u30e1\u30f3\u30d0\u30fc\u30b7\u30c3\u30d7\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u306e\u30ea\u30b9\u30c8\u3092\u8fd4\u3059\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30af\u30e9\u30b9\u306e\u540d\u524d\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u3053\u306e\u30af\u30e9\u30b9\u306f\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30a4\u30b9 <code>com.sun.identity.authentication.spi.UserIDGenerator</code> \u3092\u5b9f\u88c5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a140=LDAP \u63a5\u7d9a\u30d7\u30fc\u30eb\u306e\u30b5\u30a4\u30ba
a140.help=\u8a8d\u8a3c\u306b\u4f7f\u7528\u3055\u308c\u308b LDAP \u63a5\u7d9a\u30d7\u30fc\u30eb\u306e\u30b5\u30a4\u30ba\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a140.help.txt=LDAP \u3084 Active Directory \u306a\u3069\u306e\u76f4\u63a5 LDAP \u3092\u4f7f\u7528\u3059\u308b\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u3044\u305a\u308c\u304b\u3067\u4f7f\u7528\u3055\u308c\u308b\u3001 \
LDAP \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u63a5\u7d9a\u30d7\u30fc\u30eb\u306e\u30b5\u30a4\u30ba\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002\u7570\u306a\u308b OpenAM \u30b5\u30fc\u30d0\u30fc\u9593\u3067\u7570\u306a\u308b\u63a5\u7d9a\u30d7\u30fc\u30eb\u8a2d\u5b9a\u304c\u3067\u304d\u307e\u3059\u3002\
<br/><br/>\u5f62\u5f0f: \u30db\u30b9\u30c8:\u30dd\u30fc\u30c8:\u6700\u5c0f\u5024:\u6700\u5927\u5024
a141=LDAP \u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u63a5\u7d9a\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba
a141.help=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u63a5\u7d9a\u30d7\u30fc\u30eb\u30b5\u30a4\u30ba; \u5f62\u5f0f: \u6700\u5c0f\u5024:\u6700\u5927\u5024
a142=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30bf\u30a4\u30d7
a143=\u30d7\u30e9\u30b0\u30a4\u30f3\u53ef\u80fd\u306a\u30e6\u30fc\u30b6\u30fc\u30b9\u30c6\u30fc\u30bf\u30b9\u30a4\u30d9\u30f3\u30c8\u30af\u30e9\u30b9
a143.help=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u304c\u5909\u5316\u3057\u305f\u3068\u304d\u306b\u547c\u3073\u51fa\u3055\u308c\u308b\u30af\u30e9\u30b9\u306e\u30ea\u30b9\u30c8\u3002
a143.help.txt=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u304c\u5909\u5316\u3057\u305f\u969b\u306b\u3001 OpenAM \u306f\u30ab\u30b9\u30bf\u30e0\u30af\u30e9\u30b9\u3092\u547c\u3073\u51fa\u3059\u3088\u3046\u306b\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 \
\u30ab\u30b9\u30bf\u30e0\u30af\u30e9\u30b9\u306f\u3001\u3044\u304f\u3064\u304b\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306b\u5fdc\u3058\u3066\u4f7f\u7528\u3057\u307e\u3059\u3002\u7d44\u307f\u8fbc\u307f\u306e\u30b9\u30c6\u30fc\u30bf\u30b9\u5909\u66f4\u30a4\u30d9\u30f3\u30c8\u306f\u4ee5\u4e0b\u3067\u3059\u3002:<br/><br/>\
<ul><li>\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ed\u30c3\u30af</li><li>\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u66f4\u65b0</li></ul><br/>\u30ab\u30b9\u30bf\u30e0\u30b3\u30fc\u30c9\u306f\u3001\u3053\u306e\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u62e1\u5f35\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
a143.help.uri=#tbd
a144=\u7121\u52b9\u306a\u8a66\u884c\u3092\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u683c\u7d0d\u3059\u308b
a144.help=\u30ed\u30b0\u30a4\u30f3\u5931\u6557\u306e\u8a66\u884c\u3092 OpenAM \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5168\u4f53\u3067\u5171\u6709\u3059\u308b\u3002
a144.help.txt=\u3053\u306e\u8a2d\u5b9a\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001 OpenAM \u306f\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u5185\u306e<i>\u7121\u52b9\u306a\u8a66\u884c\u30c7\u30fc\u30bf\u5c5e\u6027\u540d</i>\u30d7\u30ed\u30d1\u30c6\u30a3\u3067\u8a2d\u5b9a\u3057\u305f\u5c5e\u6027\u306b\u3001\
\u30e6\u30fc\u30b6\u30fc\u306e\u7121\u52b9\u306a\u8a8d\u8a3c\u60c5\u5831\u3092\u683c\u7d0d\u3057\u307e\u3059\u3002
a145=\u30e2\u30b8\u30e5\u30fc\u30eb\u30d9\u30fc\u30b9\u306e\u8a8d\u8a3c
a145.help=\u30e2\u30b8\u30e5\u30fc\u30eb\u30d9\u30fc\u30b9\u306e\u8a8d\u8a3c\u3092\u30e6\u30fc\u30b6\u30fc\u306b\u8a31\u53ef\u3057\u307e\u3059\u3002
a145.help.txt=\u3053\u306e\u6a5f\u80fd\u306b\u3088\u308a\u3001\u30e6\u30fc\u30b6\u30fc\u306f\u30ec\u30eb\u30e0\u306e\u8a2d\u5b9a\u3092\u4e0a\u66f8\u304d\u3057\u3066\u3001\u6307\u5b9a\u3055\u308c\u305f\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002\
<br/><br/><i>\u6ce8\u610f </i>\u672c\u756a\u74b0\u5883\u3067\u306f\u3053\u306e\u6a5f\u80fd\u3092\u30aa\u30d5\u306b\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
a146=\u30ea\u30e2\u30fc\u30c8\u8a8d\u8a3c\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc
a146.help=\u5404\u8981\u6c42\u3068\u3068\u3082\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 SSO \u30c8\u30fc\u30af\u30f3\u3092\u9001\u4fe1\u3059\u308b\u306b\u306f\u30ea\u30e2\u30fc\u30c8\u8a8d\u8a3c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c\u5fc5\u8981\u3067\u3059\u3002
a146.help.txt=\u3053\u306e\u8a2d\u5b9a\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001\u8a8d\u8a3c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8(\u30dd\u30ea\u30b7\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306e\u3088\u3046\u306a)\u306f\u3001\
\u30e6\u30fc\u30b6\u30fc\u3092\u8a8d\u8a3c\u3059\u308b\u305f\u3081\u306e\u30ea\u30e2\u30fc\u30c8\u8a8d\u8a3c API \u3092\u4f7f\u7528\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u4ee5\u524d\u306b\u3001 OpenAM \u3078\u306e\u8a8d\u8a3c\u81ea\u4f53\u3092\u884c\u3046\u5fc5\u8981\u304c\u3042\u307e\u3059\u3002
a147=\u30bb\u30c3\u30b7\u30e7\u30f3\u5c5e\u6027\u3078\u306e\u30e6\u30fc\u30b6\u30fc\u5c5e\u6027\u306e\u30de\u30c3\u30d4\u30f3\u30b0
a147.help=\u5f62\u5f0f: \u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5c5e\u6027|\u30bb\u30c3\u30b7\u30e7\u30f3\u5c5e\u6027\u540d\u3002\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u8a2d\u5b9a\u3055\u308c\u308b\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5c5e\u6027\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
a147.help.txt=\u3053\u306e\u8a2d\u5b9a\u306b\u3088\u308a\u3001 OpenAM \u306f\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u5185\u306e\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u5c5e\u6027\u3092\u8aad\u307f\u53d6\u308a\u3001\
\u30e6\u30fc\u30b6\u30fc\u30bb\u30c3\u30b7\u30e7\u30f3\u5185\u306b\u305d\u306e\u5024\u3092\u683c\u7d0d\u3057\u307e\u3059\u3002<br/></br>\u5f62\u5f0f: \u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5c5e\u6027|\u30bb\u30c3\u30b7\u30e7\u30f3\u5c5e\u6027\u540d
a148=\u30ed\u30b0\u30a2\u30a6\u30c8\u51e6\u7406\u306e\u30dd\u30b9\u30c8\u30d7\u30ed\u30bb\u30b9\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4fdd\u6301
a148.help=\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u6301\u7d9a\u306e\u305f\u3081\u30dd\u30b9\u30c8\u30d7\u30ed\u30bb\u30b9\u30af\u30e9\u30b9\u3092\u683c\u7d0d\u3057\u307e\u3059\u3002
a148.help.txt=\u3053\u308c\u306b\u3088\u308a\u3001\u30e6\u30fc\u30b6\u30fc\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u8a8d\u8a3c\u306e\u5b8c\u4e86\u5f8c\u306b\u30dd\u30b9\u30c8\u30d7\u30ed\u30bb\u30b9\u30af\u30e9\u30b9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4fdd\u6301\u3059\u308b\u304b\u3069\u3046\u304b\u304c\u5224\u5b9a\u3055\u308c\u307e\u3059\u3002\
\u30e6\u30fc\u30b6\u30fc\u304c\u30ed\u30b0\u30a2\u30a6\u30c8\u3059\u308b\u969b\u306b\u3001\u65b0\u3057\u3044\u30dd\u30b9\u30c8\u30d7\u30ed\u30bb\u30b9\u30af\u30e9\u30b9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u4ee3\u308f\u308a\u306b\u3001\u5143\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3059\u3002\
\u3053\u308c\u306f\u3001\u7279\u5225\u306a\u30ed\u30b0\u30a2\u30a6\u30c8\u51e6\u7406\u306b\u5fc5\u8981\u306b\u306a\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u3053\u306e\u8a2d\u5b9a\u3092\u6709\u52b9\u306b\u3059\u308b\u3068 OpenAM \u306e\u30e1\u30e2\u30ea\u4f7f\u7528\u91cf\u304c\u5897\u52a0\u3057\u307e\u3059\u3002
a149=\u30ed\u30b0\u30a2\u30a6\u30c8\u51e6\u7406\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4fdd\u6301
a149.help=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u306b\u683c\u7d0d\u3055\u308c\u307e\u3059\u3002
a149.help.txt=\u3053\u308c\u306b\u3088\u308a\u3001\u30e6\u30fc\u30b6\u30fc\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u8a8d\u8a3c\u306e\u5b8c\u4e86\u5f8c\u306b\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4fdd\u6301\u3059\u308b\u304b\u3069\u3046\u304b\u304c\u5224\u5b9a\u3055\u308c\u307e\u3059\u3002\
\u901a\u5e38\u3001\u8a8d\u8a3c\u5f8c\u306b\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u30af\u30ea\u30a2\u3055\u308c\u307e\u3059\u3002\
\u3053\u308c\u306f\u3001\u7279\u5225\u306a\u30ed\u30b0\u30a2\u30a6\u30c8\u51e6\u7406\u306b\u5fc5\u8981\u306b\u306a\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u3053\u306e\u8a2d\u5b9a\u3092\u6709\u52b9\u306b\u3059\u308b\u3068 OpenAM \u306e\u30e1\u30e2\u30ea\u4f7f\u7528\u91cf\u304c\u5897\u52a0\u3057\u307e\u3059\u3002
a150=\u6709\u52b9\u306a\u8ee2\u9001 URL \u30c9\u30e1\u30a4\u30f3
a150.help=\u6709\u52b9\u306a\u8ee2\u9001 URL \u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3002
a150.help.txt=OpenAM \u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u3001\u8a8d\u8a3c\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306b\u4e0e\u3048\u3089\u308c\u305f goto \u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u6307\u5b9a\u3059\u308b URL \u3078\u30e6\u30fc\u30b6\u30fc\u3092\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3057\u307e\u3059\u3002\
\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3092\u5f37\u5316\u3059\u308b\u305f\u3081\u306b\u3001\u6709\u52b9\u306a DNS \u30c9\u30e1\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 \
goto \u6587\u306e URL \u306e\u30c9\u30e1\u30a4\u30f3\u304c\u3053\u306e\u30ea\u30b9\u30c8\u5185\u306b\u5b58\u5728\u3059\u308b\u5834\u5408\u3001 OpenAM \u306f\u30e6\u30fc\u30b6\u30fc\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3060\u3051\u3092\u3057\u307e\u3059\u3002

#Always the Authentication Level attribute should be the last item in the
#display section of the profile page. Make sure the key is always a large
#number. Now it is a500. This is to avoid reshuffling the keys if new
#attributes are added.

a500=\u30c7\u30d5\u30a9\u30eb\u30c8\u8a8d\u8a3c\u30ec\u30d9\u30eb
a500.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a500.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u304c\u6700\u4f4e\u3067\u3059\u3002

a104.link=\u7de8\u96c6
a121.link=\u7de8\u96c6

changePasswdSucceeded=\u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u5909\u66f4\u304c\u6210\u529f\u3057\u307e\u3057\u305f
amAuth-debug.on=\u30aa\u30f3
amAuth-debug.off=\u30aa\u30d5
amAuth-debug.log=\u30ed\u30b0\u30e1\u30c3\u30bb\u30fc\u30b8
initWorkerFailed=login worker \u30af\u30e9\u30b9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u306b\u5931\u6557\u3057\u307e\u3057\u305f
getOrgFailed=\u7d44\u7e54\u5c5e\u6027\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f
getUserFailed=\u30e6\u30fc\u30b6\u30fc\u5c5e\u6027\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f:
wrongCall=\u30e1\u30bd\u30c3\u30c9\u306f process() \u5185\u3067\u547c\u3073\u51fa\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059: {0}
invalidDN=\u7121\u52b9\u306a DN \u6587\u5b57\u5217: {0}
nullLoginState=\u53d6\u5f97\u3055\u308c\u305f Null LoginState
nullSess=\u8a8d\u8a3c SSO \u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u53d6\u5f97\u306b\u5931\u6557\u3057\u307e\u3057\u305f
noAuthenticator=\u8a8d\u8a3c\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093
multipleUserMatchFound=\u30e6\u30fc\u30b6\u30fc\u306e\u691c\u7d22\u3067\u4e00\u81f4\u3059\u308b\u9805\u76ee\u304c\u8907\u6570\u3042\u308a\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u554f\u984c\u3092\u89e3\u6c7a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
loginContextCreateFailed=LoginContext \u4f5c\u6210\u6642\u306e\u30a8\u30e9\u30fc:
failedLogout=\u30ed\u30b0\u30a2\u30a6\u30c8\u6642\u306e\u30a8\u30e9\u30fc:
authContextCreateFailed=AuthContext \u4f5c\u6210\u6642\u306e\u30a8\u30e9\u30fc:
authContextRetrieveFailed=AuthContext \u53d6\u5f97\u6642\u306e\u30a8\u30e9\u30fc:
userTokenNull=\u30c8\u30fc\u30af\u30f3\u304c null \u3067\u3059
nullLoginParams=\u30ed\u30b0\u30a4\u30f3\u30d1\u30e9\u30e1\u30fc\u30bf\u304c null \u3067\u3059
noRedirectTemplate=\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u30a8\u30e9\u30fc
errorConstructingURL=URL \u69cb\u7bc9\u6642\u306e\u30a8\u30e9\u30fc
redirectError=URL \u3078\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u6642\u306e\u30a8\u30e9\u30fc
nullHandler=null \u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30cf\u30f3\u30c9\u30e9
invalidState=\u7121\u52b9\u306a\u30e2\u30b8\u30e5\u30fc\u30eb\u72b6\u614b: {0}
noCallbackState=\u30e2\u30b8\u30e5\u30fc\u30eb\u72b6\u614b\u306e\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093: {0}
invalidCode=\u7121\u52b9\u306a\u30ea\u30bf\u30fc\u30f3\u30b3\u30fc\u30c9: {0}
getModulePropertiesError=\u30e2\u30b8\u30e5\u30fc\u30eb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
invalidCallbackIndex=\u7121\u52b9\u306a\u7f6e\u63db\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30a4\u30f3\u30c7\u30c3\u30af\u30b9: {0}
nullCallback=null \u7f6e\u63db\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9
noConfig=\u8a2d\u5b9a\u306e\u53d6\u5f97\u6642\u306e\u30a8\u30e9\u30fc
noUserProfile=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
userInactive=\u30e6\u30fc\u30b6\u30fc\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u3042\u308a\u307e\u305b\u3093
userNotFoundInAlias=\u30e6\u30fc\u30b6\u30fc\u304c\u5b58\u5728\u3057\u307e\u305b\u3093
noUserTokens=\u30e6\u30fc\u30b6\u30fc\u30c8\u30fc\u30af\u30f3\u304c\u3042\u308a\u307e\u305b\u3093
userRoleNotFound=\u30e6\u30fc\u30b6\u30fc\u306f\u3053\u306e\u30ed\u30fc\u30eb\u306b\u5c5e\u3057\u3066\u3044\u307e\u305b\u3093\u3002
noModulesConfigured=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
loginDenied=\u30e6\u30fc\u30b6\u30fc\u304c\u30ed\u30b0\u30a4\u30f3\u3092\u62d2\u5426\u3057\u307e\u3057\u305f
authServiceError=\u8a8d\u8a3c\u30b5\u30fc\u30d3\u30b9\u306e\u30a8\u30e9\u30fc
callbackError=\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u4f5c\u6210\u6642\u306e\u30a8\u30e9\u30fc
pCookieError=\u6301\u7d9a Cookie \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
abortFailed=\u30ed\u30b0\u30a4\u30f3\u51e6\u7406\u306e\u4e2d\u65ad\u6642\u306e\u30a8\u30e9\u30fc
modulePrompt=\u8a8d\u8a3c\u30e1\u30cb\u30e5\u30fc
noSid=\u30bb\u30c3\u30b7\u30e7\u30f3 ID \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093 {0}
unknownCallback=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9
errorState=\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30a8\u30e9\u30fc\u72b6\u614b\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044: 
loginReset=AMLoginContext:exceuteLogin() \u304b\u3089\u30ea\u30bb\u30c3\u30c8\u3057\u3066\u3044\u307e\u3059:
sessionActivationFailed=\u30bb\u30c3\u30b7\u30e7\u30f3\u8d77\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f
orgNotMatching=\u7d44\u7e54\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093
lockOutEmailSub=\u8b66\u544a: \u30e6\u30fc\u30b6\u30fc\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u901a\u77e5
lockOutEmailMsg=\u9023\u7d9a\u3057\u3066\u30ed\u30b0\u30a4\u30f3\u306b\u5931\u6557\u3057\u305f\u305f\u3081\u3001{0} \u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u975e\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u306a\u308a\u307e\u3057\u305f
invalidtoken=SSOToken \u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
invalidcontext=AuthContext \u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
# This is used to form the "From" part of the e-mail that is sent out during the
# lockout. The '-' is intentional as without it the InternetAddress class throws
# an exception
lockOutEmailFrom=OpenAM
lockOutWarning=\u8b66\u544a: \u3042\u3068 {0} \u56de\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u9593\u9055\u3048\u308b\u3068\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3055\u308c\u307e\u3059\u3002
logout=\u30ed\u30b0\u30a2\u30a6\u30c8
lockOut=\u30e6\u30fc\u30b6\u30fc\u304c\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
accountExpired=\u30e6\u30fc\u30b6\u30fc\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u671f\u9650\u304c\u5207\u308c\u3066\u3044\u307e\u3059\u3002
loginTimeout=\u30ed\u30b0\u30a4\u30f3\u304c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
moduleDenied=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
invalidDomain=\u7121\u52b9\u306a\u30c9\u30e1\u30a4\u30f3
accountLockedOut=\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
lockoutMessage=\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u96fb\u5b50\u30e1\u30fc\u30eb\u9001\u4fe1\u5148: 
incorrectAuthLevel=\u7121\u52b9\u306a\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3002
invalidChars=UserName \u306b\u7121\u52b9\u306a\u6587\u5b57\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f
noInternalSession=\u30bb\u30c3\u30b7\u30e7\u30f3\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u306e\u4e00\u90e8\u3068\u3057\u3066\u53e4\u3044\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
### Error codes
### format errorCode=errorMessage | errorTemplate
### seperator "|" to differentiate between errorMessage and errorTemplate
### errorMessage = is the error message describing the error
### errroTemplate = is the jsp/html page to be rendered

100=\u30e6\u30fc\u30b6\u30fc\u304c\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u306b\u306f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304c\u5fc5\u8981\u3067\u3059|login_denied.jsp
101=\u30e6\u30fc\u30b6\u30fc\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u671f\u9650\u304c\u5207\u308c\u3066\u3044\u307e\u3059\u3002|account_expired.jsp
102=\u8a8d\u8a3c\u30a8\u30e9\u30fc\u3002|auth_error_template.jsp
103=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u7121\u52b9\u3067\u3059\u3002|login_failed_template.jsp
104=\u30e6\u30fc\u30b6\u30fc\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u3042\u308a\u307e\u305b\u3093|user_inactive.jsp
105=\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f|noConfig.jsp
106=\u7121\u52b9\u306a\u7d99\u7d9a Cookie|invalidPCookieUserid.jsp
107=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002|login_failed_template.jsp
108=\u7121\u52b9\u306a\u30c9\u30e1\u30a4\u30f3|invalid_domain.jsp
109=\u7d44\u7e54\u304c\u975e\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u3059|org_inactive.jsp
110=\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u307e\u3057\u305f|session_timeout.jsp
111=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f|module_denied.jsp
112=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059|user_inactive.jsp
113=\u30e6\u30fc\u30b6\u30fc\u306f\u30ed\u30fc\u30eb\u306b\u5c5e\u3057\u3066\u3044\u307e\u305b\u3093|userDenied.jsp
114=\u8a8d\u8a3c\u306e\u7a2e\u985e\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f
115=\u6700\u5927\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u306e\u9650\u5ea6\u306b\u5230\u9054\u3057\u307e\u3057\u305f\u3002|maxSessions.jsp
116=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
117=\u30d6\u30e9\u30a6\u30b6\u304c HTTP \u8a8d\u8a3c\u30cf\u30f3\u30c9\u30b7\u30a7\u30fc\u30af\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u304b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093|login_failed_template.jsp
118=\u65b0\u3057\u3044\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
119=\u7121\u52b9\u306a\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3002|invalidAuthlevel.jsp
120=\u30e2\u30b8\u30e5\u30fc\u30eb\u30d9\u30fc\u30b9\u306e\u8a8d\u8a3c\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
121=\u8a8d\u8a3c\u306e\u8a66\u884c\u304c\u591a\u3059\u304e\u307e\u3059\u3002
122=\u30ea\u30e2\u30fc\u30c8\u8a8d\u8a3c\u3067\u7121\u52b9\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 SSO \u30c8\u30fc\u30af\u30f3\u3067\u3059
123=DS \u3067\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u518d\u8a66\u884c\u5236\u9650\u3092\u8d8a\u3048\u3066\u3044\u307e\u3059 - \u5236\u7d04\u9055\u53cd | user_inactive.jsp
124=\u30e6\u30fc\u30b6\u30fc\u304c\u8a8d\u8a3c\u3055\u308c\u3066\u3044\u308b\u5143\u306e\u30e6\u30fc\u30b6\u30fc\u3068\u7570\u306a\u308b\u305f\u3081\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u66f4\u65b0\u306b\u5931\u6557\u3057\u307e\u3057\u305f

################################################################################
#
# Console View Properties
#
################################################################################
authentication.show.advanced.attributes=\u3059\u3079\u3066\u306e\u30b3\u30a2\u8a2d\u5b9a...
authentication.core.properties=\u30b3\u30a2
authentication.module.instances=\u30e2\u30b8\u30e5\u30fc\u30eb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9
authentication.module.instances.help=\u3053\u306e\u30ec\u30eb\u30e0\u306b\u4f7f\u7528\u53ef\u80fd\u306a\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30ea\u30b9\u30c8
authentication.module.instances.help.txt=OpenAM \u306f\u3001\u30e6\u30fc\u30b6\u30fc\u3092\u8b58\u5225\u3059\u308b\u305f\u3081\u306b\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\
\u901a\u5e38\u3001\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u8a8d\u8a3c\u9023\u9396\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u3059\u3002\u5404\u30ec\u30eb\u30e0\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u3092\u8a8d\u8a3c\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u8a8d\u8a3c\u9023\u9396\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
\u3053\u306e\u30bb\u30af\u30b7\u30e7\u30f3\u306f\u3001\u8a8d\u8a3c\u306e\u305f\u3081\u306b\u5229\u7528\u53ef\u80fd\u306a\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u30ec\u30eb\u30e0\u306b\u8ffd\u52a0\u3001\u8a2d\u5b9a\u3001\u307e\u305f\u306f\u524a\u9664\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002
authentication.module.instances.help.uri=#tbd
authentication.module.configurations=\u8a8d\u8a3c\u9023\u9396
authentication.module.configurations.help=\u3053\u306e\u30ec\u30eb\u30e0\u306b\u4f7f\u7528\u53ef\u80fd\u306a\u8a8d\u8a3c\u9023\u9396\u306e\u30ea\u30b9\u30c8
authentication.module.configurations.help.txt=OpenAM \u306f\u3001\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u30d5\u30ed\u30fc\u3092\u5236\u5fa1\u3059\u308b\u305f\u3081\u306b\u8a8d\u8a3c\u9023\u9396\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002\
\u3053\u306e\u30ec\u30eb\u30e0\u306b\u8a8d\u8a3c\u9023\u9396\u306e\u8a2d\u5b9a\u3092\u8ffd\u52a0\u3001\u69cb\u6210\u3001\u307e\u305f\u306f\u524a\u9664\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30bb\u30af\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
authentication.module.configurations.help.uri=#tbd
authentication.module.instances.action.label=\u7de8\u96c6
authentication.module.configurations.action.label=\u7de8\u96c6
label.items=\u9805\u76ee

authentication.instance.table.name.column=\u540d\u524d
authentication.instance.table.type.column=\u30bf\u30a4\u30d7
authentication.instance.table.action.column=\u30a2\u30af\u30b7\u30e7\u30f3
authentication.instance.table.create.button=\u65b0\u898f
authentication.instance.table.delete.button=\u524a\u9664
authentication.module.instance.table.noentries=\u5229\u7528\u53ef\u80fd\u306a\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u300c\u65b0\u898f\u300d\u30dc\u30bf\u30f3\u3092\u62bc\u3057\u3066\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002

authentication.configuration.table.name.column=\u540d\u524d
authentication.configuration.table.type.column=\u30bf\u30a4\u30d7
authentication.configuration.table.action.column=\u30a2\u30af\u30b7\u30e7\u30f3
authentication.configuration.table.create.button=\u65b0\u898f
authentication.configuration.table.delete.button=\u524a\u9664
authentication.configuration.table.noentries=\u8a8d\u8a3c\u9023\u9396\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u300c\u65b0\u898f\u300d\u30dc\u30bf\u30f3\u3092\u62bc\u3057\u3066\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
[Empty]=[ \u7a7a ]
i18nTrue=\u6709\u52b9
i18nFalse=\u7121\u52b9
label.current.value=\u73fe\u5728\u306e\u5024
label.new.value=\u65b0\u3057\u3044\u5024

org-chain-list.help=\u3053\u306e\u8868\u306f\u3001\u8a8d\u8a3c\u9023\u9396\u3092\u69cb\u6210\u3059\u308b\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u4e00\u89a7\u8868\u793a\u3057\u307e\u3059\u3002
org-chain-list.help.txt=\u8a8d\u8a3c\u306e\u969b\u306b\u30e6\u30fc\u30b6\u30fc\u306b\u63d0\u793a\u3055\u308c\u308b\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u30ea\u30b9\u30c8\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002\
\u5224\u5b9a\u57fa\u6e96\u306f\u3001\u8a8d\u8a3c\u9023\u9396\u306e\u51e6\u7406\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002\u5404\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u3069\u306e\u3088\u3046\u306b\u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u52d5\u4f5c\u3092\u5236\u5fa1\u3059\u308b\u304b\u3092\u8a2d\u5b9a\u3059\u308b\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u30bb\u30c3\u30c8\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002
org-chain-list.help.uri=#tbd

