#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: libSAML2Meta_es.properties,v 1.11 2009/12/26 03:41:55 cbasha Exp $
#



usage=\nSINTAXIS:\n        saml2meta import -u <dn de usuario> [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  [-r <dominio>] [-m <nombre del archivo xml>] [-x <nombre del archivo xml>]\n                  [-t <nombre del c\u00edrculo de confianza>]\n        saml2meta export -u <dn de usuario> [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  [-r <dominio>] -e <Id. de entidad> [-n] [-m <nombre del archivo xml>]\n                  [-x <nombre del archivo xml>]\n        saml2meta template -u <dn de usuario> [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  [-s <metaalias> [-a <alias del cert.>] [-f <alias del cert.>]]\n                  [-d <metaalias> [-b <alias del cert.>] [-g <alias del cert.>]]\n                  [-e <Id. de entidad>] -m <nombre del archivo xml> -x <nombre del archivo xml>\n        saml2meta delete -u <dn de usuario> [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  [-r <dominio>] -e <Id. de entidad> [-c]\n        saml2meta list -u <dn de usuario>\n                  [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n        saml2meta cotcreate -u <dn de usuario>\n                  [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  -t <nombre del c\u00edrculo de confianza> [-p <url de prefijo>]\n                  [-l <Id. de entidad, Id. de entidad,...>]\n        saml2meta cotdelete -u <dn de usuario>\n                  [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  -t <nombre del c\u00edrculo de confianza>\n        saml2meta cotadd -u <dn de usuario>\n                  [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  -t <nombre del c\u00edrculo de confianza> -e <Id. de entidad>\n        saml2meta cotremove -u <dn de usuario>\n                  [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  -t <nombre del c\u00edrculo de confianza> -e <Id. de entidad>\n        saml2meta cotmember -u <dn de usuario>\n                  [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n                  -t <nombre del c\u00edrculo de confianza>\n        saml2meta cotlist -u <dn de usuario>\n                  [-w <contrase\u00f1a>|-j <archivo de contrase\u00f1a>]\n        saml2meta -V\n        saml2meta -?\n\nDESCRIPCI\u00d3N:\n        Administra los metadatos y la configuraci\u00f3n ampliada de SAML 2.0.\n\n        El subcomando "import" se utiliza para cargar los metadatos est\u00e1ndar o la configuraci\u00f3n\nampliada.\n        El subcomando "export" se utiliza para exportar los metadatos o la configuraci\u00f3n\n        ampliada con el formato XML. Se debe especificar, al menos, una de las opciones "-m" o "-x'"\n       .\n        La plantilla se utiliza para generar los metadatos est\u00e1ndar para una entidad alojada.\n        La opci\u00f3n de eliminaci\u00f3n se utiliza para suprimir los metadatos est\u00e1ndar o la configuraci\u00f3n de\n        la entidad ampliada.\n        El comando "list" se utiliza para enumerar todos los Id. de entidad del sistema.\n        El comando "cotcreate" se utiliza para crear el c\u00edrculo de confianza.\n        El comando "cotdelete" se utiliza para eliminar el c\u00edrculo de confianza.\n        El comando "cotadd" se utiliza para agregar un proveedor de confianza al c\u00edrculo de\n        confianza.\n        El comando "cotremove" se utiliza para suprimir un proveedor de confianza del\n        c\u00edrculo de confianza.\n                El comando "cotmember" se utiliza para enumerar los proveedores de confianza del\n        c\u00edrculo de confianza.\n        El comando "cotlist" se utiliza para enumerar todos los nombres de c\u00edrculos de\n        confianza del sistema.\n\nOPCIONES:\n        Se admiten las siguientes opciones:\n        -u <userdn>, --runasdn <userdn>\n          DN completo del usuario que ejecuta el comando.\n\n        -w <contrase\u00f1a>, --password <contrase\u00f1a>\n          Especifique la contrase\u00f1a del usuario que ejecuta el comando.\n\n        -j <archivo de contrase\u00f1a>, --passwordfile <archivo de contrase\u00f1a>\n          Especifique el nombre del archivo que contiene la contrase\u00f1a del usuario que ejecuta el comando.\n\n        -r <dominio>, --realm <dominio>\n          Especifique el dominio de los configuraci\u00f3n de la entidad o los metadatos. El valor predeterminado\n          es el dominio ra\u00edz.\n\n        -m <nombre del archivo xml>, --archivo de metadatos <nombre del archivo xml>\n          Especifique el nombre del archivo de los metadatos est\u00e1ndar.\n\n        -x <nombre del archivo xml>, --archivo de datos ampliados<nombre del archivo xml>\n          Especifique el nombre del archivo para la configuraci\u00f3n de la entidad ampliada.\n\n        -e <Id. de entidad>, --entityid <Id. de entidad>\n          Especifique el Id. de entidad.\n\n        -s <metaalias>, --serviceprovider <metaalias>\n          Especifique el metaalias del proveedor de servicios alojado que se va a crear.\n          El formato debe ser <dominio>/<texto sin "/"> para el dominio que no sea\n          ra\u00edz o /<texto sin "/"> para el dominio ra\u00edz.\n\n        -a <certAlias>, --spscertalias <certAlias>\n          Especifique el alias del certificado firmado para el proveedor de servicios alojado que se va a crear.\n\n        -f <certAlias>, --specertalias <certAlias>\n          Especifique el alias del certificado de cifrado para el proveedor de servicios alojado que se va a crear.\n\n        -d <metaalias>, --identityprovider <metaalias>\n          Especifique el metaalias del proveedor de identidad alojado que se va a crear.\n          El formato debe ser <dominio>/<texto sin "/"> para el dominio que no sea\n          ra\u00edz o /<texto sin "/"> para el dominio ra\u00edz.\n\n        -b <certAlias>, --idpscertalias<certAlias>\n          Especifique el alias del certificado firmado para el proveedor de identidad alojado que se va a crear.\n\n        -g <certAlias>, --idpecertalias <certAlias>\n          Especifique el alias del certificado de cifrado para el proveedor de identidad alojado que se va a crear.\n\n        -n, --sign\n          Permite firmar los archivos xml exportados.\n\n        -c, --extendedonly\n          Permite eliminar s\u00f3lo la configuraci\u00f3n de la entidad ampliada.\n\n        -t, --cot\n          Nombre del c\u00edrculo de confianza\n\n        -p, --prefix\n          URL de prefijo para la URL del escritor y lector del servicio de detecci\u00f3n de IDP.\n\n        -l, --trustedproviders\n          Lista de los proveedores de confianza del c\u00edrculo de confianza.\n\n        -V, --version\n
          Print Informaci\u00f3n sobre la versi\u00f3n.\n\n        -?, --help\n          Imprime la informaci\u00f3n de ayuda (este mensaje).


entity_descriptor_exists=El descriptor de la entidad "{0}" ya existe en el dominio "{1}".
entity_config_exists=La configuraci\u00f3n de la entidad "{0}" ya existe en el dominio "{1}".
invalid_descriptor=El descriptor de la entidad {0} ubicado en el dominio {1} presenta una sintaxis no v\u00e1lida.
empty_entityid=No se ha establecido el Id. de entidad.
role_already_exists=Ya existe una entidad {0}.  Vaya a la ficha Federaci\u00f3n y elimine la entidad {0} existente.  A continuaci\u00f3n, puede volver a reconfigurarla.
entity_descriptor_not_exist=El descriptor de la entidad {0} no existe en el dominio {1}.
invalid_config=La configuraci\u00f3n de la entidad {0} ubicada en el dominio {1} presenta una sintaxis no v\u00e1lida.
entity_config_not_exist=La configuraci\u00f3n de la entidad {0} no existe en el dominio {1}.
read_password_prompt=Contrase\u00f1a de {0}:
login_fail=Error de inicio de sesi\u00f3n.
file_not_found=No se ha encontrado el archivo {0}
invalid_descriptor_file=El descriptor de la entidad del archivo {0} presenta una sintaxis no v\u00e1lida.
file_import_ok=El archivo "{0}" se ha importado satisfactoriamente.
invalid_config_file=La configuraci\u00f3n de la entidad del archivo {0} presenta una sintaxis no v\u00e1lida.
file_export_descriptor_ok=El descriptor de la entidad se ha exportado satisfactoriamente al archivo {0}.
file_export_config_ok=La configuraci\u00f3n de la entidad se ha exportado satisfactoriamente al archivo {0}.
export_missing_m_x=Se debe especificar, al menos, una de las opciones "-m" o "-x" para el comando "export".
missing_protocol=No se puede encontrar el protocolo del servidor en el archivo de configuraci\u00f3n.
missing_host=No se puede encontrar el nombre de host del servidor en el archivo de configuraci\u00f3n.
missing_port=No se puede encontrar el puerto del servidor en el archivo de configuraci\u00f3n.
missing_deploy_uri=No se puede encontrar el URI de implementaci\u00f3n del servidor en el archivo de configuraci\u00f3n.
error_write_to_file=No se puede escribir en el archivo {0}
descriptor_template_ok=El descriptor de la entidad alojada del dominio {1} se ha escrito en el archivo {0}.
config_template_ok=La configuraci\u00f3n de la entidad alojada del dominio {1} se ha escrito en el archivo {0}.
descriptor_delete_ok=El descriptor y la configuraci\u00f3n de la entidad "{0}" se han eliminado satisfactoriamente.
config_delete_ok=La configuraci\u00f3n de la entidad "{0}" se ha eliminado satisfactoriamente.
invalid_realm=No se puede leer la configuraci\u00f3n del servicio para el dominio "{0}".
invalid_cert_alias=No se puede encontrar el certificado mediante el alias de certificados  "{0}".
verify_no_cert=No se puede encontrar el certificado para verificar la firma en el elemento "{0}".
untrusted_cert=El certificado encontrado en la firma o el descriptor de clave -KeyDescriptor- con el elemento "{0}" no es de confianza.
verify_fail=No se puede verificar la firma en el elemento "{0}".
cotcreate_ok=El c\u00edrculo de confianza {0} se ha creado satisfactoriamente.
cotdelete_ok=El c\u00edrculo de confianza {0} se ha eliminado satisfactoriamente.
cotremove_ok=El Id. de entidad "{1}" se ha eliminado satisfactoriamente del c\u00edrculo de confianza "{0}".
cotadd_ok=El Id. de entidad "{1}" se ha agregado satisfactoriamente al c\u00edrculo de confianza "{0}".
cotmember_ok=El c\u00edrculo de confianza "{0}" se ha enumerado satisfactoriamente.
invalid_reader_url=La URL del lector de entrada no tiene formato de URL.
invalid_writer_url=La URL del escritor de entrada no tiene formato de URL. 
invalid_cot_status=El estado del c\u00edrculo de confianza no es v\u00e1lido.
null_config=No se puede obtener la instancia de configuraci\u00f3n para SAML2COT.
null_cot=El descriptor del c\u00edrculo de confianza de SAML2 de entrada es nulo.
cot_name_invalid=El nombre del descriptor del c\u00edrculo de confianza de SAML2 no es v\u00e1lido.
cot_existed=El descriptor del c\u00edrculo de confianza de SAML2 existe.
entityid_invalid=El Id. de entidad de entrada no es v\u00e1lido.
no_cot=No se ha encontrado el c\u00edrculo de confianza de SAML2.
fail_remove_cot=No se ha podido eliminar la entidad del c\u00edrculo de confianza. 
fail_add_cot=No se ha podido agregar la entidad al c\u00edrculo de confianza. 
entity_in_cot=La entidad ya existe en el c\u00edrculo de confianza.
unknownError=Error desconocido.
cotlist_ok=Operaci\u00f3n: la lista de COT se ha ejecutado satisfactoriamente.
cotmember_no_entity=No hay ninguna entidad de confianza en el c\u00edrculo de confianza: {0}. 
cotmember_entity=Enumerando las entidades de confianza del c\u00edrculo de confianza: "{0}".
entity_id=Id. de entidad:
none_cot=No hay ning\u00fan c\u00edrculo de confianza en el sistema.
cotlist_list=Enumerando todos los nombres de c\u00edrculos de confianza del sistema:
cot_name=Nombre del c\u00edrculo de confianza:
cot_delete_prohibit=No se permite la eliminaci\u00f3n del c\u00edrculo de confianza.
none_entity=No hay ninguna entidad en el sistema.
list_entity=Enumerando todos los Id. de entidad del sistema:
list_ok=Operaci\u00f3n: la lista se ha ejecutado satisfactoriamente.
