#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: agentService_ko.properties,v 1.15 2009/07/16 04:19:38 cbasha Exp $
#
# Portions Copyrighted 2015 ForgeRock AS.
# Portions Copyrighted 2015 Nomura Research Institute, Ltd.

label.Empty=---\ube44\uc5b4 \uc788\uc74c----
a10=USER_ID
a11=PROFILE_ATTRIBUTE
a12=HTTP_HEADER
a13=SESSION_PROPERTY
a14=LOG_NONE
a15=LOG_ALLOW
a16=LOG_DENY
a17=LOG_BOTH
a18=\uc6d0\uaca9
a19=\ubaa8\ub450
a20=\uc5c6\uc74c
a21=HTTP_HEADER
a22=REQUEST_ATTRIBUTE
a23=HTTP_COOKIE
a24=\ub85c\uceec
a25=3DES
a26=AES
a27=\ud558\uc704 \ud2b8\ub9ac
a28=self
a29=1.3
a30=1.0
a100=\ube44\ubc00\ubc88\ud638
a100.confirm=\ube44\ubc00\ubc88\ud638(\ud655\uc778)
a101=\uc0c1\ud0dc
a101.help=\uc5d0\uc774\uc804\ud2b8 \uad6c\uc131 \uc0c1\ud0dc\uc785\ub2c8\ub2e4.
a102=\ud65c\uc131
a103=\ube44\ud65c\uc131
a105=true  
a106=false
a109=\uc5d0\uc774\uc804\ud2b8 \uc54c\ub9bc URL
a109.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc54c\ub9bc Listener\ub97c \ub4f1\ub85d\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 URL\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.client.notification.url) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a110=\uc5d0\uc774\uc804\ud2b8 \uad6c\uc131 \uc800\uc7a5\uc18c \uc704\uce58
a110.help=\uc5d0\uc774\uc804\ud2b8\uc758 \ud638\uc2a4\ud2b8 \ub610\ub294 OpenAM \uc11c\ubc84 \uc911\uc559\uc5d0 \uc788\ub294 \uc5d0\uc774\uc804\ud2b8\uc758 \uad6c\uc131\uc744 \ub098\ud0c0\ub0c5\ub2c8\ub2e4.
a111=\uc911\uc559 \uc9d1\uc911\ud654\ub428
a112=\ub85c\uceec

# J2EE Agent properties
a113=\uc5d0\uc774\uc804\ud2b8 \ud544\ud130 \ubaa8\ub4dc
a113.help=\ud544\ud130\uc758 \uc791\uc5c5 \ubaa8\ub4dc\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.filter.mode) <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc62c\ubc14\ub978 \uac12: ALL, J2EE_POLICY, URL_POLICY, SSO_ONLY, NONE <br>\uc774 \ub4f1\ub85d \uc815\ubcf4\uc758 \uacbd\uc6b0 \ud2b9\uc815 \ud544\ud130 \ubaa8\ub4dc\uac00 \uc5c6\ub294 \ubaa8\ub4e0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \uc801\uc6a9\ub418\ub3c4\ub85d \uc804\uc5ed \uac12\uc744 \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694 <br>\uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>\uc804\uc5ed \ud544\ud130 \ubaa8\ub4dc\ub85c ALL\uc744 \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\ub97c \ube44\uc6cc \ub450\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 ALL\uc744 \uc785\ub825\ud569\ub2c8\ub2e4. <br>\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \ud544\ud130 \ubaa8\ub4dc\ub85c URL_POLICY\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 URL_POLICY\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a114=\uc0ac\uc6a9\uc790 \ub9e4\ud551 \ubaa8\ub4dc
a114.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc0ac\uc6a9\uc790 \uc544\uc774\ub514\ub97c \uacb0\uc815\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \uba54\ucee4\ub2c8\uc998\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.user.mapping.mode) <br>\ud56b\uc2a4\uc651: \uc608
a115=\uc0ac\uc6a9\uc790 \uc18d\uc131 \uc774\ub984
a115.help=\uc0ac\uc6a9\uc790 \uc544\uc774\ub514\uac00 \ud3ec\ud568\ub41c \uc18d\uc131\uc758 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.user.attribute.name) <br>\ud56b\uc2a4\uc651: \uc608
a116=\uc0ac\uc6a9\uc790 \uae30\ubcf8 \ud50c\ub798\uadf8
a116.help=\ud574\ub2f9 \uc0ac\uc6a9\uc790 \uc544\uc774\ub514 \ub300\uc2e0 \uae30\ubcf8\uc744 \uc0ac\uc6a9\ud558\uc5ec \uc0ac\uc6a9\uc790\ub97c \uc778\uc99d\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.user.principal) <br>\ud56b\uc2a4\uc651: \uc608
a117=\uc0ac\uc6a9\uc790 \ud1a0\ud070 \uc774\ub984
a117.help=\uc138\uc158\uc5d0\uc11c \uc778\uc99d\ub41c \uc0ac\uc6a9\uc790\uc758 \uc0ac\uc6a9\uc790 \uc544\uc774\ub514\uc5d0 \ub300\ud55c \uc138\uc158 \ub4f1\ub85d \uc815\ubcf4 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.user.token) <br>\ud56b\uc2a4\uc651: \uc608
a118=\ud074\ub77c\uc774\uc5b8\ud2b8 IP \uc8fc\uc18c \ud5e4\ub354
a118.help=\ud074\ub77c\uc774\uc5b8\ud2b8\uc758 IP \uc8fc\uc18c\uac00 \ud3ec\ud568\ub41c HTTP \ud5e4\ub354 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.client.ip.header) <br>\ud56b\uc2a4\uc651: \uc608
a119=\ud074\ub77c\uc774\uc5b8\ud2b8 \ud638\uc2a4\ud2b8 \uc774\ub984 \ud5e4\ub354
a119.help=\ud074\ub77c\uc774\uc5b8\ud2b8\uc758 \ud638\uc2a4\ud2b8 \uc774\ub984\uc774 \ud3ec\ud568\ub41c HTTP \ud5e4\ub354 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.client.hostname.header) <br>\ud56b\uc2a4\uc651: \uc608
a121=\uad6c\uc131 \uc7ac\ub85c\ub4dc \uac04\uaca9
a121.help=\uad6c\uc131 \uc7ac\ub85c\ub4dc \uac04\uc758 \uac04\uaca9(\ucd08 \ub2e8\uc704)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.load.interval) <br>\ud56b\uc2a4\uc651: \uc608
a122=\ub85c\ucf08 \uc5b8\uc5b4 
a122.help=(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.locale.language) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a123=\ub85c\ucf08 \uad6d\uac00
a123.help=(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.locale.country) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a124=\uac10\uc0ac \uc561\uc138\uc2a4 \uc720\ud615
a124.help=\uc0ac\uc6a9\uc790 URL \uc561\uc138\uc2a4 \uc2dc\ub3c4\ub97c \ubc14\ud0d5\uc73c\ub85c \uae30\ub85d\ud560 \uba54\uc2dc\uc9c0 \uc720\ud615\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.audit.accesstype) <br>\ud56b\uc2a4\uc651: \uc608
a125=\uac10\uc0ac \ub85c\uadf8 \uc704\uce58
a125.help=\uac10\uc0ac \uba54\uc2dc\uc9c0\ub97c \uae30\ub85d\ud560 \uc704\uce58\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.log.disposition) <br>\ud56b\uc2a4\uc651: \uc608
a126=\uc6d0\uaca9 \ub85c\uadf8 \ud30c\uc77c \uc774\ub984
a126.help=OpenAM \uc11c\ubc84\uc5d0 \uc800\uc7a5\ub418\uba70 \uc5d0\uc774\uc804\ud2b8 \uac10\uc0ac \uba54\uc2dc\uc9c0\uac00 \ub4e4\uc5b4 \uc788\ub294 \ud30c\uc77c \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.remote.logfile) <br>\ud56b\uc2a4\uc651: \uc608
a128=\ub85c\uceec \uac10\uc0ac \ub85c\uadf8 \ud68c\uc804
a128.help=\ud2b9\uc815 \ud06c\uae30\uc5d0 \ub3c4\ub2ec\ud55c \uac10\uc0ac \ub85c\uadf8 \ud30c\uc77c\uc744 \ud68c\uc804\ud558\ub3c4\ub85d \ud45c\uc2dc\ud558\ub294 \ud50c\ub798\uadf8\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.local.log.rotate) <br>\ud56b\uc2a4\uc651: \uc608
a129=\ub85c\uceec \uac10\uc0ac \ub85c\uadf8 \ud68c\uc804 \ud06c\uae30
a129.help=\ub85c\uceec \uac10\uc0ac \ub85c\uadf8 \ud30c\uc77c\uc744 \uc0c8 \ud30c\uc77c\ub85c \ud68c\uc804\ud558\ub294 \uacbd\uc6b0 \ud06c\uae30 \uc81c\ud55c\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.local.log.size) <br>\ud56b\uc2a4\uc651: \uc608
a131=\uc6f9 \uc11c\ube44\uc2a4 \uc0ac\uc6a9 \uac00\ub2a5
a131.help=\uc6f9 \uc11c\ube44\uc2a4 \ucc98\ub9ac\ub97c \uc0ac\uc6a9\ud560\uc9c0 \uc5ec\ubd80\ub97c \uc9c0\uc815\ud558\ub294 \ud50c\ub798\uadf8\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.webservice.enable)<br>\ud56b\uc2a4\uc651: \uc608
a132=\uc6f9 \uc11c\ube44\uc2a4 \uc5d4\ub4dc \ud3ec\uc778\ud2b8
a132.help=\uc6f9 \uc11c\ube44\uc2a4\ub97c \ub098\ud0c0\ub0b4\ub294 \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc5d4\ub4dc \ud3ec\uc778\ud2b8 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.webservice.endpoint) <br>\ud56b\uc2a4\uc651: \uc608
a133=\uc6f9 \uc11c\ube44\uc2a4 \ud504\ub85c\uc138\uc2a4 GET \uc0ac\uc6a9
a133.help=\uc6f9 \uc11c\ube44\uc2a4 \uc5d4\ub4dc \ud3ec\uc778\ud2b8\uc758 HTTP GET \uc694\uccad\uc744 \ucc98\ub9ac\ud560\uc9c0 \uc5ec\ubd80\ub97c \ub098\ud0c0\ub0b4\ub294 \ud50c\ub798\uadf8\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.webservice.process.get.enable) <br>\ud56b\uc2a4\uc651: \uc608
a134=\uc6f9 \uc11c\ube44\uc2a4 \uc778\uc99d\uc790
a134.help=\uc6f9 \uc11c\ube44\uc2a4 \uc694\uccad\uc744 \uc778\uc99d\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218 \uc788\ub294 com.sun.identity.agents.filter.IWebServiceAuthenticator \uc778\ud130\ud398\uc774\uc2a4\uc758 \uad6c\ud604 \ud074\ub798\uc2a4\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.webservice.authenticator) <br>\ud56b\uc2a4\uc651: \uc608
a134a=\uc6f9 \uc11c\ube44\uc2a4 \uc751\ub2f5 \ud504\ub85c\uc138\uc11c
a134a.help=\uc6f9 \uc11c\ube44\uc2a4 \uc751\ub2f5\uc744 \ucc98\ub9ac\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218 \uc788\ub294 com.sun.identity.agents.filter.IWebServiceResponseProcessor \uc778\ud130\ud398\uc774\uc2a4\uc758 \uad6c\ud604 \ud074\ub798\uc2a4\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.webservice.responseprocessor) <br>\ud56b\uc2a4\uc651: \uc608
a135=\uc6f9 \uc11c\ube44\uc2a4 \ub0b4\ubd80 \uc624\ub958 \ucee8\ud150\ud2b8 \ud30c\uc77c
a135.help= \uc5d0\uc774\uc804\ud2b8\uac00 \ud074\ub77c\uc774\uc5b8\ud2b8\uc5d0 \ub300\ud55c \ub0b4\ubd80 \uc624\ub958\ub97c \uc0dd\uc131\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \ucee8\ud150\ud2b8\uac00 \ud3ec\ud568\ub41c \ud30c\uc77c\uc758 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.webservice.internalerror.content) <br>\ud56b\uc2a4\uc651: \uc608
a136=\uc6f9 \uc11c\ube44\uc2a4 \uc778\uc99d \uc624\ub958 \ucee8\ud150\ud2b8 \ud30c\uc77c
a136.help=\uc5d0\uc774\uc804\ud2b8\uac00 \ud074\ub77c\uc774\uc5b8\ud2b8\uc5d0 \ub300\ud55c \uc778\uc99d \uc624\ub958\ub97c \uc0dd\uc131\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \ucee8\ud150\ud2b8\uac00 \ud3ec\ud568\ub41c \ud30c\uc77c\uc758 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.webservice.autherror.content) <br>\ud56b\uc2a4\uc651: \uc608
a137=\uc790\uc6d0 \uc561\uc138\uc2a4 \uac70\ubd80 URI
a137.help=\uc0ac\uc6a9\uc790 \uc815\uc758 \uc561\uc138\uc2a4 \uac70\ubd80 \ud398\uc774\uc9c0\uc758 URI\ub97c \uc2dd\ubcc4\ud558\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc804\uc6a9 \ub9f5\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.access.denied.uri) <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc720\ud6a8\ud55c \uac12: \uc0ac\uc6a9\uc790 \uc815\uc758 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc561\uc138\uc2a4 \uac70\ubd80 \ud398\uc774\uc9c0 URI <br>\uc774 \ub4f1\ub85d \uc815\ubcf4\uc758 \uacbd\uc6b0 \ud2b9\uc815 \uc561\uc138\uc2a4 \uac70\ubd80 \ud398\uc774\uc9c0\uac00 \uc5c6\ub294 \ubaa8\ub4e0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \uc801\uc6a9\ub418\ub3c4\ub85d \uc804\uc5ed \uac12\uc744 \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>\uc804\uc5ed \uc561\uc138\uc2a4 \uac70\ubd80 \ud398\uc774\uc9c0\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\ub97c \ube44\uc6cc \ub450\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc804\uc5ed \uc561\uc138\uc2a4 \uac70\ubd80 \ud398\uc774\uc9c0 URI\uc778 /sample/accessdenied.html\uc744 \uc785\ub825\ud569\ub2c8\ub2e4. <br>\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \uc561\uc138\uc2a4 \uac70\ubd80 \ud398\uc774\uc9c0 URI\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc561\uc138\uc2a4 \uac70\ubd80 \ud398\uc774\uc9c0 URI\uc778 /BankApp/accessdenied.html\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a138=\ub85c\uadf8\uc778 \uc591\uc2dd URI
a138.help=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc758 web.xml form-login-page \uc694\uc18c\uc5d0 \ud574\ub2f9\ud558\ub294 \uc808\ub300 URI \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.form) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> /BankApp/jsp/login.jsp
a139=\ub85c\uadf8\uc778 \uc624\ub958 URI
a139.help=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc758 web.xml form-error-page \uc694\uc18c\uc5d0 \ud574\ub2f9\ud558\ub294 \uc808\ub300 URI \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.error.uri) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> /BankApp/jsp/error.jsp
a141=\ub0b4\ubd80 \ub85c\uadf8\uc778 \uc0ac\uc6a9 
a141.help=\uc81c\uacf5\ub41c \uae30\ubcf8 \ub0b4\ubd80 \ucee8\ud150\ud2b8 \ub300\uc2e0 \ub85c\uadf8\uc778 \ucee8\ud150\ud2b8 \ud30c\uc77c\uc744 \uc0ac\uc6a9\uc790 \uc815\uc758\ud558\ub824\uba74 false\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.use.internal) <br>\ud56b\uc2a4\uc651: \uc608
a142=\ub85c\uadf8\uc778 \ucee8\ud150\ud2b8 \ud30c\uc77c \uc774\ub984
a142.help=\uc0ac\uc6a9\uc790 \uc815\uc758 \ub85c\uadf8\uc778 \ucee8\ud150\ud2b8 \ud30c\uc77c\uc758 \uc804\uccb4 \uacbd\ub85c\uc640 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.content.file) <br>\ud56b\uc2a4\uc651: \uc608
a143=\uc0ac\uc6a9\uc790 \uc815\uc758 \uc778\uc99d \ucc98\ub9ac\uae30
a143.help=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc11c\ubc84\uc5d0 \ub85c\uadf8\uc628\ud55c \uc0ac\uc6a9\uc790\ub97c \uc778\uc99d\ud558\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc804\uc6a9 \uc778\uc99d \ucc98\ub9ac\uae30\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.auth.handler)  <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc62c\ubc14\ub978 \uac12: \uc778\uc99d \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984 <br>\ud56b\uc2a4\uc651: \uc608  <br>\uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \uc778\uc99d \ucc98\ub9ac\uae30\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc778\uc99d \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984\uc778 BankAuthHandler\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a144=\uc0ac\uc6a9\uc790 \uc815\uc758 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30
a144.help=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc11c\ubc84\uc5d0\uc11c \uc0ac\uc6a9\uc790\ub97c \ub85c\uadf8\uc544\uc6c3\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc804\uc6a9 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.handler)  <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc62c\ubc14\ub978 \uac12: \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984 <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984\uc778 BankLogoutHandler\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a145=\uc0ac\uc6a9\uc790 \uc815\uc758 \uac80\uc99d \ucc98\ub9ac\uae30
a145.help=\ub85c\uceec \uc800\uc7a5\uc18c\ub97c \uc0ac\uc6a9\ud558\uc5ec \uc0ac\uc6a9\uc790 \uc790\uaca9 \uc99d\uba85\uc758 \uc720\ud6a8\uc131\uc744 \uac80\uc0ac\ud558\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc804\uc6a9 \uac80\uc99d \ucc98\ub9ac\uae30\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.verification.handler) <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc62c\ubc14\ub978 \uac12: \uac80\uc99d \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984 <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \uac80\uc99d \ucc98\ub9ac\uae30\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uac80\uc99d \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984\uc778 BankVerificationHandler\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a146=HTTP \uc138\uc158 \ubc14\uc778\ub529
a146.help=true\uc778 \uacbd\uc6b0 \ub85c\uadf8\uc778\uc5d0 \uc2e4\ud328\ud558\uac70\ub098 \uc0ac\uc6a9\uc790\uc5d0\uac8c SSO \uc138\uc158\uc774 \uc5c6\uac70\ub098 \uae30\ubcf8 \uc0ac\uc6a9\uc790 \uc774\ub984\uc774 SSO \uc0ac\uc6a9\uc790 \uc774\ub984\uacfc \uc77c\uce58\ud558\uc9c0 \uc54a\uc73c\uba74 http \uc138\uc158\uc744 \ubb34\ud6a8\ud654\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.httpsession.binding) <br>\ud56b\uc2a4\uc651: \uc608
a147=Goto \ub9e4\uac1c \ubcc0\uc218 \uc774\ub984
a147.help=CDSSO\ub97c \uc0ac\uc6a9\ud558\ub294 \uacbd\uc6b0\uc5d0\ub9cc \uc0ac\uc6a9\ub418\ub294 \ub4f1\ub85d \uc815\ubcf4\uc785\ub2c8\ub2e4. \uae30\ubcf8\uac12\uc740 \ub85c\uadf8\uc778 URL\uc5d0 \uc2dc\uc791 \ud398\uc774\uc9c0\uac00 \uc9c0\uc815\ub41c \uacbd\uc6b0\uc5d0\ub9cc \ubcc0\uacbd\ud574\uc57c \ud569\ub2c8\ub2e4. <br> \uc608: com.sun.identity.agents.config.cdsso.cdcservlet.url = http://host:port/opensso/cdcservlet?goto=http://agent:port/landing.jsp <br> \ub9e4\uac1c \ubcc0\uc218\ub294 \uc5d0\uc774\uc804\ud2b8\uc5d0\uc11c \uc6d0\ub798 \uc694\uccad URL\uc744 \uc774 cdcserlet URL\uc5d0 \ucd94\uac00\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \uc774 \ub9e4\uac1c \ubcc0\uc218\ub294 \uc2dc\uc791 \ud398\uc774\uc9c0\uc5d0\uc11c \uc6d0\ub798 URL\ub85c \ub9ac\ub514\ub809\uc158\ud558\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.redirect.param) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 com.sun.identity.agents.config.redirect.param = goto2\uc640 \uac19\uc2b5\ub2c8\ub2e4.<br> \uc778\uc99d\uc744 \uc704\ud574 \ubcf4\ub0b8 \uc804\uccb4 URL\uc740 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://host:port/opensso/cdcservlet?goto=http://agent:port/landing.jsp?goto2=http://agent.port/original.jsp
a148=OpenAM \ub85c\uadf8\uc778 URL
a148.help=OpenAM \ub85c\uadf8\uc778 \ud398\uc774\uc9c0 URL\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.url) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://host:port/opensso/UI/Login
a149=\ub85c\uadf8\uc778 URL \uc21c\uc11c \uc9c0\uc815
a149.help=\ub85c\uadf8\uc778 URL \ub610\ub294 CDSSO URL\uc758 \ud398\uc77c\uc624\ubc84 \uc6b0\uc120 \uc21c\uc11c\ub97c OpenAM \ub85c\uadf8\uc778 URL \ubaa9\ub85d\uc5d0 \uc815\uc758\ub41c \ub300\ub85c \uc9c0\uc815\ud560\uc9c0 \uc5ec\ubd80\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.url.prioritized) <br>\ud56b\uc2a4\uc651: \uc608
a151=\ub85c\uadf8\uc778 URL \uac80\uc99d
a151.help=URL\ub85c \ub9ac\ub514\ub809\uc158\ud558\uae30 \uc804\uc5d0 \uc5d0\uc774\uc804\ud2b8\uac00 \ud574\ub2f9 URL\uc758 \uac00\uc6a9\uc131\uc744 \ud655\uc778\ud560\uc9c0 \uc5ec\ubd80\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.url.probe.enabled) <br>\ud56b\uc2a4\uc651: \uc608
a152=\ub85c\uadf8\uc778 URL \uac80\uc99d \uc2dc\uac04 \ucd08\uacfc
a152.help=\ub85c\uadf8\uc778 URL \uac80\uc99d\uc774 true\ub85c \uc124\uc815\ub41c \uacbd\uc6b0 \uc5f0\uacb0 \uc2dc\uac04 \ucd08\uacfc(\ubc00\ub9ac\ucd08) \uac12\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.url.probe.timeout) <br>\ud56b\uc2a4\uc651: \uc608
a153=\ub300\uccb4 \uc5d0\uc774\uc804\ud2b8 \ud638\uc2a4\ud2b8 \uc774\ub984
a153.help=\uc2e4\uc81c \ud638\uc2a4\ud2b8 \uc774\ub984\uacfc \ub2e4\ub978 \uacbd\uc6b0 \ud074\ub77c\uc774\uc5b8\ud2b8 \ube0c\ub77c\uc6b0\uc800\uac00 \uc5d0\uc774\uc804\ud2b8 \ubcf4\ud638 \uc11c\ubc84\ub97c \uc2dd\ubcc4\ud558\ub294 \ud638\uc2a4\ud2b8 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.agent.host) <br>\ud56b\uc2a4\uc651: \uc608
a154=\ub300\uccb4 \uc5d0\uc774\uc804\ud2b8 \ud3ec\ud2b8 \uc774\ub984
a154.help=\uc2e4\uc81c \uc751\ub2f5 \ud3ec\ud2b8\uc640 \ub2e4\ub978 \uacbd\uc6b0 \ud074\ub77c\uc774\uc5b8\ud2b8 \ube0c\ub77c\uc6b0\uc800\uac00 \uc5d0\uc774\uc804\ud2b8 \ubcf4\ud638 \uc11c\ubc84 \uc218\uc2e0 \ud3ec\ud2b8\ub97c \uc2dd\ubcc4\ud558\ub294 \ud3ec\ud2b8 \ubc88\ud638\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.agent.port) <br>\ud56b\uc2a4\uc651: \uc608
a155=\ub300\uccb4 \uc5d0\uc774\uc804\ud2b8 \ud504\ub85c\ud1a0\ucf5c
a155.help=\uc11c\ubc84\uc5d0\uc11c \uc0ac\uc6a9\ud558\ub294 \uc2e4\uc81c \ud504\ub85c\ud1a0\ucf5c\uacfc \ub2e4\ub978 \uacbd\uc6b0 \ud074\ub77c\uc774\uc5b8\ud2b8 \ube0c\ub77c\uc6b0\uc800\uac00 \uc5d0\uc774\uc804\ud2b8 \ubcf4\ud638 \uc11c\ubc84\uc640 \ud1b5\uc2e0\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \ud504\ub85c\ud1a0\ucf5c(http/https)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.agent.protocol) <br>\ud56b\uc2a4\uc651: \uc608
a156=\ub85c\uadf8\uc778 \uc2dc\ub3c4 \uc81c\ud55c
a156.help=\uc0ac\uc6a9\uc790 \uc694\uccad\uc744 \ucc28\ub2e8\ud558\uae30 \uc804\uae4c\uc9c0 \uc0ac\uc6a9\uc790\uc758 \ub2e8\uc77c \ube0c\ub77c\uc6b0\uc800 \uc138\uc158\uc5d0\uc11c \uc2e4\ud328\uac00 \ud5c8\uc6a9\ub418\ub294 \ub85c\uadf8\uc778 \uc2dc\ub3c4 \ud69f\uc218 \uc81c\ud55c\uc785\ub2c8\ub2e4. 0 \uac12\uc744 \uc124\uc815\ud558\uba74 \uc774 \uae30\ub2a5\uc774 \ube44\ud65c\uc131\ud654\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.attempt.limit) <br>\ud56b\uc2a4\uc651: \uc608
a158=SSO \uce90\uc2dc \ud65c\uc131\ud654
a158.help=\uc5d0\uc774\uc804\ud2b8\uc5d0 \ub300\ud55c SSO \uce90\uc2dc \ud65c\uc131\ud654 \uc5ec\ubd80\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. \uce90\uc2dc\ub294 \uc5d0\uc774\uc804\ud2b8 SDK\uc5d0\uc11c \ud45c\uc2dc\ud558\ub294 \uacf5\uac1c API\ub97c \ud1b5\ud574 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.amsso.cache.enable) <br>\ud56b\uc2a4\uc651: \uc608
a159=\ucfe0\ud0a4 \uc7ac\uc124\uc815
a159.help=\uc778\uc99d\uc73c\ub85c \ub9ac\ub514\ub809\uc158\ud558\uae30 \uc804\uc5d0 \uc5d0\uc774\uc804\ud2b8\uac00 \uc751\ub2f5\uc5d0\uc11c \ucfe0\ud0a4\ub97c \uc7ac\uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cookie.reset.enable) <br>\ud56b\uc2a4\uc651: \uc608
a161=\ucfe0\ud0a4 \uc7ac\uc124\uc815 \uc774\ub984 \ubaa9\ub85d
a161.help=\ucfe0\ud0a4 \uc7ac\uc124\uc815\uc774 \ud65c\uc131\ud654\ub41c \uacbd\uc6b0 \uc5d0\uc774\uc804\ud2b8\uc5d0\uc11c \uc7ac\uc124\uc815\ud560 \ucfe0\ud0a4 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cookie.reset.name) <br>\ud56b\uc2a4\uc651: \uc608
a162=\ucfe0\ud0a4 \uc7ac\uc124\uc815 \ub3c4\uba54\uc778 \ub9f5
a162.help=\ucfe0\ud0a4 \uc7ac\uc124\uc815 \uc774\ub984 \ubaa9\ub85d\uc5d0\uc11c \uc9c0\uc815\ud55c \ucfe0\ud0a4 \uc774\ub984\uc744 \uc7ac\uc124\uc815 \uc774\ubca4\ud2b8 \ubc1c\uc0dd \uc2dc \uc0ac\uc6a9\ud560 \uc774 \ucfe0\ud0a4\uc758 \ub3c4\uba54\uc778\uc774 \ub420 \uac12\uacfc \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cookie.reset.domain) <br>\ud56b\uc2a4\uc651: \uc608
a163=\ucfe0\ud0a4 \uc7ac\uc124\uc815 \uacbd\ub85c \ub9f5
a163.help=\ucfe0\ud0a4 \uc7ac\uc124\uc815 \uc774\ub984 \ubaa9\ub85d\uc5d0\uc11c \uc9c0\uc815\ud55c \ucfe0\ud0a4 \uc774\ub984\uc744 \uc7ac\uc124\uc815 \uc774\ubca4\ud2b8 \ubc1c\uc0dd \uc2dc \uc0ac\uc6a9\ud560 \uc774 \ucfe0\ud0a4\uc758 \uacbd\ub85c\uac00 \ub420 \uac12\uacfc \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cookie.reset.path) <br>\ud56b\uc2a4\uc651: \uc608
a164=\ub3c4\uba54\uc778 \uac04 SSO
a164.help=\ub3c4\uba54\uc778 \uac04 \ub2e8\uc77c \uc0ac\uc778\uc628(SSO)\uc744 \ud65c\uc131\ud654\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.enable) <br>\ud56b\uc2a4\uc651: \uc608
a165=CDSSO \ub9ac\ub514\ub809\uc158 URI
a165.help= \uc5d0\uc774\uc804\ud2b8\uac00 CDSSO \uc694\uccad\uc744 \ucc98\ub9ac\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \uc911\uac04 URI\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.redirect.uri) <br>\ud56b\uc2a4\uc651: \uc608
a166=CDSSO \uc11c\ube14\ub9bf URL
a166.help=\uc5d0\uc774\uc804\ud2b8\uac00 CDSSO \ucc98\ub9ac\uc5d0 \uc0ac\uc6a9\ud560 \uc218 \uc788\ub294 CDSSO \ucee8\ud2b8\ub864\ub7ec\uc758 URL \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.cdcservlet.url) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://host:port/opensso/cdcservlet
a167=CDSSO \ud074\ub7ed \uc624\ucc28
a167.help=\uc5d0\uc774\uc804\ud2b8\uac00 CDSSO AuthnResponse \uba85\uc81c\uc758 \uc720\ud6a8\uc131\uc744 \uacb0\uc815\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \uc2dc\uac04(\ucd08)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.clock.skew) <br>\ud56b\uc2a4\uc651: \uc608
a168=CDSSO \uc2e0\ub8b0\ud560 \uc218 \uc788\ub294 \uc544\uc774\ub514 \uacf5\uae09\uc790
a168.help=CDC \ub9ac\ubc84\ud2f0 \uc751\ub2f5\uc744 \ud3c9\uac00\ud560 \ub54c \uc5d0\uc774\uc804\ud2b8\uc5d0\uc11c \uc2e0\ub8b0\ud560 \uc218 \uc788\uc5b4\uc57c \ud558\ub294 OpenAM \uc11c\ubc84/\uc544\uc774\ub514 \uacf5\uae09\uc790 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.trusted.id.provider) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://host:port/opensso/cdcservlet
a169=CDSSO \ubcf4\uc548 \ud65c\uc131\ud654
a169.help=CDSSO \ubaa8\ub4dc\uc5d0\uc11c \ub2e4\ub978 \ub3c4\uba54\uc778\uc758 \uc5d0\uc774\uc804\ud2b8\uac00 \uc124\uc815\ud55c SSO \ud1a0\ud070 \ucfe0\ud0a4\uac00 \uc548\uc804\ud55c \uac83\uc73c\ub85c \ud45c\uc2dc\ub429\ub2c8\ub2e4. \ud638\uc2a4\ud2b8\uac00 \uc788\ub294 \ud1b5\uc2e0 \ucc44\ub110\uc774 \uc548\uc804\ud55c \uacbd\uc6b0\uc5d0\ub9cc \uc804\uc1a1\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.secure.enable) <br>\ud56b\uc2a4\uc651: \uc608
a170=CDSSO \ub3c4\uba54\uc778 \ubaa9\ub85d
a170.help=CDSSO \uc2dc\ub098\ub9ac\uc624\uc5d0\uc11c \uc124\uc815\ud574\uc57c \ud558\ub294 \ucfe0\ud0a4\uc758 \ub3c4\uba54\uc778\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.domain) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> .sun.com
a171=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30
a171.help=\ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uc5d0 \uc0ac\uc6a9\ud560 \ucc98\ub9ac\uae30\ub97c \uc2dd\ubcc4\ud558\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc804\uc6a9 \ub9f5\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.application.handler) <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc62c\ubc14\ub978 \uac12: \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984 <br>\uc774 \ub4f1\ub85d \uc815\ubcf4\uc758 \uacbd\uc6b0 \ud2b9\uc815 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30\uac00 \uc5c6\ub294 \ubaa8\ub4e0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \uc801\uc6a9\ub418\ub3c4\ub85d \uc804\uc5ed \uac12\uc744 \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>\uc804\uc5ed \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\ub97c \ube44\uc6cc \ub450\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc804\uc5ed \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984\uc778 GlobalApplicationLogoutHandler\ub97c \uc785\ub825\ud569\ub2c8\ub2e4. <br>\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \ucc98\ub9ac\uae30 \ud074\ub798\uc2a4 \uc774\ub984\uc778 BankAppLogoutHandler\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a172=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 URI
a172.help=\ub85c\uadf8\uc544\uc6c3 \uc774\ubca4\ud2b8\ub97c \ub098\ud0c0\ub0b4\ub294 \uc694\uccad URI\ub97c \uc2dd\ubcc4\ud558\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc804\uc6a9 \ub9f5\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.uri) <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc62c\ubc14\ub978 \uac12: \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 URI <br>\uc774 \ub4f1\ub85d \uc815\ubcf4\uc758 \uacbd\uc6b0 \ud2b9\uc815 \ub85c\uadf8\uc544\uc6c3 URI\uac00 \uc5c6\ub294 \ubaa8\ub4e0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \uc801\uc6a9\ub418\ub3c4\ub85d \uc804\uc5ed \uac12\uc744 \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>\uc804\uc5ed \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 URI\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\ub97c \ube44\uc6cc \ub450\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc804\uc5ed \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 URI\uc778 /logout.jsp\ub97c \uc785\ub825\ud569\ub2c8\ub2e4. <br> \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \ub85c\uadf8\uc544\uc6c3 URI\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 URI\uc778 /BankApp/logout.jsp\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a173=\ub85c\uadf8\uc544\uc6c3 \uc694\uccad \ub9e4\uac1c \ubcc0\uc218
a173.help=HTTP \uc694\uccad\uc5d0\uc11c \ub85c\uadf8\uc544\uc6c3 \uc774\ubca4\ud2b8\ub97c \ub098\ud0c0\ub0b4\ub294 \ub9e4\uac1c \ubcc0\uc218\ub97c \uc2dd\ubcc4\ud558\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc804\uc6a9 \ub9f5\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.request.param)  <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc62c\ubc14\ub978 \uac12: \ub85c\uadf8\uc544\uc6c3 \uc694\uccad \ub9e4\uac1c \ubcc0\uc218 <br>\uc774 \ub4f1\ub85d \uc815\ubcf4\uc758 \uacbd\uc6b0 \ud2b9\uc815 \ub85c\uadf8\uc544\uc6c3 \uc694\uccad \ub9e4\uac1c \ubcc0\uc218\uac00 \uc5c6\ub294 \ubaa8\ub4e0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \uc801\uc6a9\ub418\ub3c4\ub85d \uc804\uc5ed \uac12\uc744 \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>\uc804\uc5ed \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \uc694\uccad \ub9e4\uac1c \ubcc0\uc218\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\ub97c \ube44\uc6cc \ub450\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc804\uc5ed \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \uc694\uccad \ub9e4\uac1c \ubcc0\uc218\uc778 logoutparam\uc744 \uc785\ub825\ud569\ub2c8\ub2e4. <br> \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \ub85c\uadf8\uc544\uc6c3 \uc694\uccad \ub9e4\uac1c \ubcc0\uc218\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \ub85c\uadf8\uc544\uc6c3 \uc694\uccad \ub9e4\uac1c \ubcc0\uc218\uc778 logoutparam\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a174=\ub85c\uadf8\uc544\uc6c3 Introspect \ud65c\uc131\ud654
a174.help=\uc5d0\uc774\uc804\ud2b8\uac00 HTTP \uc694\uccad \ubcf8\ubb38\uc744 \uac80\uc0c9\ud558\uc5ec \ub85c\uadf8\uc544\uc6c3 \ub9e4\uac1c \ubcc0\uc218\ub97c \ucc3e\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.introspect.enabled<br>\ud56b\uc2a4\uc651: \uc608
a175=\ub85c\uadf8\uc544\uc6c3 \ud56d\ubaa9 URI
a175.help=\uc131\uacf5\uc801\uc778 \ub85c\uadf8\uc544\uc6c3\uacfc \ud6c4\uc18d \uc778\uc99d(\ud574\ub2f9\ub418\ub294 \uacbd\uc6b0) \uc774\ud6c4 \uc2dc\uc791\uc810\uc73c\ub85c \uc0ac\uc6a9\ud560 URI\ub97c \uc2dd\ubcc4\ud558\ub294 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc804\uc6a9 \ub9f5\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.entry.uri) <br>\uc62c\ubc14\ub978 \ud0a4: \uc6f9 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc774\ub984 <br>\uc62c\ubc14\ub978 \uac12: \ub85c\uadf8\uc544\uc6c3 \ud56d\ubaa9 URI <br>\uc774 \ub4f1\ub85d \uc815\ubcf4\uc758 \uacbd\uc6b0 \ud2b9\uc815 \ub85c\uadf8\uc544\uc6c3 \ud56d\ubaa9 URI\uac00 \uc5c6\ub294 \ubaa8\ub4e0 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \uc801\uc6a9\ub418\ub3c4\ub85d \uc804\uc5ed \uac12\uc744 \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>\uc804\uc5ed \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \ud56d\ubaa9 URI\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\ub97c \ube44\uc6cc \ub450\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \uc804\uc5ed \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 \ud56d\ubaa9 URI\uc778 /welcome.html\uc744 \uc785\ub825\ud569\ub2c8\ub2e4. <br> \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 BankApp\uc758 \ub85c\uadf8\uc544\uc6c3 \ud56d\ubaa9 URI\ub97c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 BankApp\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 \ub85c\uadf8\uc544\uc6c3 \ud56d\ubaa9 URI\uc778 /BankApp/welcome.html\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a176=FQDN \ud655\uc778
a176.help=fqdn \uae30\ubcf8\uac12 \ubc0f fqdn \ub9f5 \uac12\uc744 \ud655\uc778\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.fqdn.check.enable) <br>\ud56b\uc2a4\uc651: \uc608
a177=FQDN \uae30\ubcf8\uac12
a177.help=\uc0ac\uc6a9\uc790\uac00 \uc790\uc6d0\uc5d0 \uc561\uc138\uc2a4\ud558\uae30 \uc704\ud574 \uc0ac\uc6a9\ud574\uc57c \ud558\ub294 \uc815\uaddc\ud654\ub41c \ud638\uc2a4\ud2b8 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.fqdn.default) <br>\ud56b\uc2a4\uc651: \uc608
a178=FQDN \uac00\uc0c1 \ud638\uc2a4\ud2b8 \ub9f5
a178.help=\ubcf4\ud638\ub418\ub294 \uc790\uc6d0\uc5d0 \uc561\uc138\uc2a4\ud560 \uc218 \uc788\ub3c4\ub85d \uac00\uc0c1 \ud638\uc2a4\ud2b8, \ubd80\ubd84\uc801\uc778 \ud638\uc2a4\ud2b8 \uc774\ub984 \ubc0f IP \uc8fc\uc18c\ub97c \ud65c\uc131\ud654\ud569\ub2c8\ub2e4. \uc798\ubabb\ub41c \ud0a4\ub97c \uc720\ud6a8\ud55c \uac12\uc5d0 \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.fqdn.mapping) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>  myserver.mydomain.com\uc5d0 myserver\ub97c \ub9e4\ud551\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 myserver\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 myserver.mydomain.com\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a179=\ub808\uac70\uc2dc \uc0ac\uc6a9\uc790 \uc5d0\uc774\uc804\ud2b8 \uc9c0\uc6d0 \uc0ac\uc6a9
a179.help=\ub808\uac70\uc2dc \uc0ac\uc6a9\uc790 \uc5d0\uc774\uc804\ud2b8(\ube0c\ub77c\uc6b0\uc800)\uc5d0 \ub300\ud55c \uc9c0\uc6d0\uc744 \ud65c\uc131\ud654\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.legacy.support.enable) <br>\ud56b\uc2a4\uc651: \uc608
a181=\ub808\uac70\uc2dc \uc0ac\uc6a9\uc790 \uc5d0\uc774\uc804\ud2b8 \ubaa9\ub85d
a181.help=\uae30\uc874 \ube0c\ub77c\uc6b0\uc800\ub97c \uc2dd\ubcc4\ud558\ub294 \uc0ac\uc6a9\uc790 \uc5d0\uc774\uc804\ud2b8 \ud5e4\ub354 \uac12 \ubaa9\ub85d\uc785\ub2c8\ub2e4. \uc774 \ubaa9\ub85d\uc758 \ud56d\ubaa9\uc5d0\ub294 \uc640\uc77c\ub4dc\uce74\ub4dc \ubb38\uc790 '*'\uac00 \ud3ec\ud568\ub420 \uc218 \uc788\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.legacy.user.agent) <br>\ud56b\uc2a4\uc651: \uc608
a182=\ub808\uac70\uc2dc \uc0ac\uc6a9\uc790 \uc5d0\uc774\uc804\ud2b8 \ub9ac\ub514\ub809\uc158 URI
a182.help=\uc5d0\uc774\uc804\ud2b8\uc5d0\uc11c \ub808\uac70\uc2dc \uc0ac\uc6a9\uc790 \uc5d0\uc774\uc804\ud2b8 \uc694\uccad\uc744 \ub9ac\ub514\ub809\uc158\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \uc911\uac04 URI\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.legacy.redirect.uri) <br>\ud56b\uc2a4\uc651: \uc608
a183=\uc0ac\uc6a9\uc790 \uc815\uc758 \uc751\ub2f5 \ud5e4\ub354
a183.help=\ub9f5\uc740 \ud074\ub77c\uc774\uc5b8\ud2b8 \ube0c\ub77c\uc6b0\uc800\uc5d0\uc11c \uc5d0\uc774\uc804\ud2b8\uac00 \uc124\uc815\ud55c \uc0ac\uc6a9\uc790 \uc815\uc758 \ud5e4\ub354\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. \ud0a4\uac00 \ud5e4\ub354 \uc774\ub984\uc774\uace0 \uac12\uc740 \ud5e4\ub354 \uac12\uc744 \ub098\ud0c0\ub0c5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.response.header) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>  \uc0ac\uc6a9\uc790 \uc815\uc758 \ud5e4\ub354 Cache-Control\uc744 no-cache \uac12\uc73c\ub85c \uc124\uc815\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 Cache-Control\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 no-cache\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a184=\ub9ac\ub514\ub809\uc158 \uc2dc\ub3c4 \uc81c\ud55c
a184.help=\uc0ac\uc6a9\uc790 \uc694\uccad\uc758 \ucc28\ub2e8\uc744 \ud2b8\ub9ac\uac70\ud558\ub294 \ub2e8\uc77c \ube0c\ub77c\uc6b0\uc800 \uc138\uc158\uc744 \uc0ac\uc6a9\ud558\uc5ec \ub9cc\ub4e4 \uc218 \uc788\ub294 \uc5f0\uc18d \ub2e8\uc77c \uc9c0\uc810 \ub9ac\ub514\ub809\uc158 \uc218\uc785\ub2c8\ub2e4. 0\uc73c\ub85c \uc124\uc815\ud558\uba74 \uc774 \uae30\ub2a5\uc774 \ube44\ud65c\uc131\ud654\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.redirect.attempt.limit) <br>\ud56b\uc2a4\uc651: \uc608
a185=\ud3ec\ud2b8 \ud655\uc778 \uc0ac\uc6a9
a185.help=\ud3ec\ud2b8 \ud655\uc778 \uae30\ub2a5\uc744 \uc0ac\uc6a9\ud560 \uc218 \uc788\ub294\uc9c0 \uc5ec\ubd80\ub97c \ub098\ud0c0\ub0c5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.port.check.enable) <br>\ud56b\uc2a4\uc651: \uc608
a186=\ud3ec\ud2b8 \ud655\uc778 \ud30c\uc77c
a186.help=\ud3ec\ud2b8\ub97c \uc218\uc815\ud574\uc57c \ud558\ub294 \uc694\uccad\uc744 \ucc98\ub9ac\ud558\ub294 \ub370 \ud544\uc694\ud55c \ud544\uc218 \ucee8\ud150\ud2b8\uac00 \uc788\ub294 \ud30c\uc77c\uc758 \uc774\ub984 \ub610\ub294 \uc804\uccb4 \uacbd\ub85c\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.port.check.file) <br>\ud56b\uc2a4\uc651: \uc608
a187=\ud3ec\ud2b8 \ud655\uc778 \uc124\uc815
a187.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc798\ubabb\ub41c \ud3ec\ud2b8 \ubc88\ud638\ub97c \uc0ac\uc6a9\ud55c \uc694\uccad\uc744 \uc2dd\ubcc4\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218\uc2e0 \ud504\ub85c\ud1a0\ucf5c\uc758 \uc218\uc2e0 \ud3ec\ud2b8 \ubc88\ud638\uc640 \uac12\uc758 \ud0a4\uac00 \uc788\ub294 \ud504\ub85c\ud1a0\ucf5c \ud56d\ubaa9\uacfc \ud3ec\ud2b8\uc758 \ub9f5\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.port.check.setting) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> \ud3ec\ud2b8 80\uc744 http \ud504\ub85c\ud1a0\ucf5c\uc5d0 \ub9e4\ud551\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 80\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 http\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a188=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URI
a188.help=\uc5d0\uc774\uc804\ud2b8\uc5d0\uc11c \ubcf4\ud638\uac00 \uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URI\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.uri) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> /BankApp/public/* <br> /BankApp/images/*
a189=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URI \ubc18\uc804
a189.help=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URI \ubaa9\ub85d\uc5d0\uc11c \uc9c0\uc815\ud55c URI\uc758 \ubcf4\ud638\ub97c \ubc18\uc804\ud569\ub2c8\ub2e4. \uc774 \uac12\uc744 true\ub85c \uc124\uc815\ud558\uba74 \uc5d0\uc774\uc804\ud2b8\uac00 \uc9c0\uc815\ub41c URI\ub97c \uc801\uc6a9\ud558\uace0 \ub2e4\ub978 \ubaa8\ub4e0 URI\ub294 \uac15\uc81c \uc801\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.uri.invert) <br>\ud56b\uc2a4\uc651: \uc608
a191=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URI \uce90\uc2dc \ud65c\uc131\ud654
a191.help=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URI \ubaa9\ub85d \ud3c9\uac00 \uacb0\uacfc\ub97c \uce90\uc2dc\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.uri.cache.enable) <br>\ud56b\uc2a4\uc651: \uc608
a192=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URI \uce90\uc2dc \ud06c\uae30
a192.help=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URI \ubaa9\ub85d \ud3c9\uac00 \uacb0\uacfc\ub97c \uce90\uc2f1\ud558\ub294 \uacbd\uc6b0\uc5d0 \uc0ac\uc6a9\ud560 \uce90\uc2dc\uc758 \ud06c\uae30\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.uri.cache.size) <br>\ud56b\uc2a4\uc651: \uc608
a193=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 \ud074\ub77c\uc774\uc5b8\ud2b8 IP \ubaa9\ub85d
a193.help=\uc774\ub4e4 \ud074\ub77c\uc774\uc5b8\ud2b8 IP \uc8fc\uc18c\uc5d0\uc11c \ubcf4\ub0b4\ub294 \uc694\uccad\uc5d0\ub294 \uc5d0\uc774\uc804\ud2b8\uc758 \uc778\uc99d \ubc0f \uc778\uc99d \ubcf4\ud638\uac00 \ud544\uc694\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.ip) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> 192.18.145.* <br> 192.18.146.123
a194=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 IP \ubc18\uc804 \ubaa9\ub85d
a194.help=\uad00\ub828\ub41c \uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 \ud074\ub77c\uc774\uc5b8\ud2b8 IP \ubaa9\ub85d\uc5d0 \ub098\uc5f4\ub41c IP \uc8fc\uc18c\uc758 \ubcf4\ud638\ub97c \ubc18\uc804\ud558\uae30 \uc704\ud55c \ud074\ub77c\uc774\uc5b8\ud2b8 IP \uc8fc\uc18c\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.ip.invert) <br>\ud56b\uc2a4\uc651: \uc608
a195=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 IP \uce90\uc2dc \ud50c\ub798\uadf8
a195.help=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 IP \ubaa9\ub85d \ud3c9\uac00 \uacb0\uacfc\ub97c \uce90\uc2f1\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.ip.cache.enable) <br>\ud56b\uc2a4\uc651: \uc608
a196=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 IP \uce90\uc2dc \ud06c\uae30
a196.help=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 IP \uce90\uc2dc \ud50c\ub798\uadf8\ub97c \ud65c\uc131\ud654\ud55c \uacbd\uc6b0\uc5d0 \uc0ac\uc6a9\ud560 \uce90\uc2dc\uc758 \ud06c\uae30\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.ip.cache.size) <br>\ud56b\uc2a4\uc651: \uc608
a197=\ucfe0\ud0a4 \uad6c\ubd84 \ubb38\uc790
a197.help=\ub3d9\uc77c\ud55c \uc18d\uc131\uc758 \uc5ec\ub7ec \uac12\uc744 \ucfe0\ud0a4\ub85c \uc124\uc815\ud560 \ub54c \uac12\uc744 \uad6c\ubd84\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \ubb38\uc790\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.attribute.cookie.separator) <br>\ud56b\uc2a4\uc651: \uc608
a198=\ubd88\ub7ec\uc624\uae30 \uc18d\uc131 \ub0a0\uc9dc \ud615\uc2dd
a198.help=\ub0a0\uc9dc \uc18d\uc131\uc744 HTTP \ud5e4\ub354\ub85c \uc124\uc815\ud560 \ub54c \uc0ac\uc6a9\ud560 \ub0a0\uc9dc \uc18d\uc131 \uac12\uc758 \ud615\uc2dd\uc785\ub2c8\ub2e4. \ud615\uc2dd\uc740 java.text.SimpleDateFormat\uc744 \ubc14\ud0d5\uc73c\ub85c \ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.attribute.date.format) <br>\ud56b\uc2a4\uc651: \uc608
a199=\uc18d\uc131 \ucfe0\ud0a4 \uc778\ucf54\ub529
a199.help=\uc18d\uc131 \uac12\uc744 \ucfe0\ud0a4\ub85c \uc124\uc815\ud558\uae30 \uc804\uc5d0 URL \uc778\ucf54\ub529\uc744 \ud574\uc57c \ud558\ub294\uc9c0 \uc5ec\ubd80\ub97c \ub098\ud0c0\ub0c5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.attribute.cookie.encode) <br>\ud56b\uc2a4\uc651: \uc608
a201=\ud504\ub85c\ud544 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc
a201.help=\ud504\ub85c\ud544 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.profile.attribute.fetch.mode) <br>\ud56b\uc2a4\uc651: \uc608
a202=\ud504\ub85c\ud544 \uc18d\uc131 \ub9e4\ud551
a202.help=\ud604\uc7ac \uc778\uc99d\ub41c \uc0ac\uc6a9\uc790\uc758 \ud2b9\uc815 \uc774\ub984 \uc544\ub798\uc5d0 \ucc44\uc6b8 \ud504\ub85c\ud544 \uc18d\uc131\uc744 \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.profile.attribute.mapping) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> CUSTOM-Common-Name \uc774\ub984 \uc544\ub798\uc758 \ud504\ub85c\ud544 \uc18d\uc131 cn \uac12\uc744 \ucc44\uc6b0\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 cn\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 CUSTOM-Common-Name\uc744 \uc785\ub825\ud569\ub2c8\ub2e4. <br> CUSTOM-Email \uc774\ub984 \uc544\ub798\uc758 \ud504\ub85c\ud544 \uc18d\uc131 mail \uac12\uc744 \ucc44\uc6b0\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 mail\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 CUSTOM-Email\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a203=\uc138\uc158 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc
a203.help=\uc138\uc158 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.session.attribute.fetch.mode) <br>\ud56b\uc2a4\uc651: \uc608
a204=\uc138\uc158 \uc18d\uc131 \ub9e4\ud551
a204.help=\ud604\uc7ac \uc778\uc99d\ub41c \uc0ac\uc6a9\uc790\uc758 \ud2b9\uc815 \uc774\ub984 \uc544\ub798\uc5d0 \ucc44\uc6b8 \uc138\uc158 \uc18d\uc131\uc744 \ub9e4\ud551\ud569\ub2c8\ub2e4.  (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.session.attribute.mapping) <br>\ud56b\uc2a4\uc651: \uc608  <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>  CUSTOM-userid \uc774\ub984 \uc544\ub798\uc758 \uc138\uc158 \uc18d\uc131 UserToken \uac12\uc744 \ucc44\uc6b0\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 UserToken\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 CUSTOM-userid\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a205=\uc751\ub2f5 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc
a205.help=\uc815\ucc45 \uc751\ub2f5 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.response.attribute.fetch.mode) <br>\ud56b\uc2a4\uc651: \uc608
a206=\uc751\ub2f5 \uc18d\uc131 \ub9e4\ud551
a206.help=\ud604\uc7ac \uc778\uc99d\ub41c \uc0ac\uc6a9\uc790\uc758 \ud2b9\uc815 \uc774\ub984 \uc544\ub798\uc5d0 \ucc44\uc6b8 \uc815\ucc45 \uc751\ub2f5 \uc18d\uc131\uc744 \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.response.attribute.mapping) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> CUSTOM-USER-NAME \uc774\ub984 \uc544\ub798\uc758 \uc751\ub2f5 \uc18d\uc131 uid \uac12\uc744 \ucc44\uc6b0\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 uid\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 CUSTOM-USER-NAME\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a207=\uc6b0\ud68c \uae30\ubcf8 \ubaa9\ub85d
a207.help=\uc778\uc99d \ubc0f \uac80\uc0c9\uc744 \uc704\ud574 \uc5d0\uc774\uc804\ud2b8\uac00 \uc6b0\ud68c\ud558\ub294 \uae30\ubcf8\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.bypass.principal) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> guest <br> testuser
a208=\uae30\ubcf8 \uad8c\ud55c \uc18d\uc131
a208.help=\uc720\ud6a8\ud55c OpenAM \uc138\uc158\uc744 \uac16\ub294 \ubaa8\ub4e0 \uc0ac\uc6a9\uc790\uc5d0\uac8c \ubd80\uc5ec\ud560 \uad8c\ud55c \uc18d\uc131\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.default.privileged.attribute) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> AUTHENTICATED_USERS
a209=\uad8c\ud55c \uc18d\uc131 \uc720\ud615
a209.help=\uac01 \uc0ac\uc6a9\uc790\uc5d0 \ub300\ud574 \ubd88\ub7ec\uc62c \uad8c\ud55c \uc18d\uc131 \uc720\ud615\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.privileged.attribute.type) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> Group
a211=\uad8c\ud55c \uc18d\uc131\uc744 \uc18c\ubb38\uc790\ub85c
a211.help=\uad8c\ud55c \uc18d\uc131 \uc720\ud615\uc744 \uc18c\ubb38\uc790\ub85c \ubcc0\ud658\ud560\uc9c0 \uc5ec\ubd80\uc5d0 \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.privileged.attribute.tolowercase) <br> \uc62c\ubc14\ub978 \ud0a4: \uadf8\ub8f9, \uc5ed\ud560 \ub4f1\uc758 \uad8c\ud55c \uc788\ub294 \uc18d\uc131 \uc720\ud615 <br>\uc62c\ubc14\ub978 \uac12: true, false <br>\ud56b\uc2a4\uc651: \uc608  <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 Group\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 false\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a212=\uad8c\ud55c \uc138\uc158 \uc18d\uc131
a212.help=\uc778\uc99d\ub41c \uc0ac\uc6a9\uc790\uc5d0 \ub300\ud55c \uad8c\ud55c \uc18d\uc131\uc744 \uac16\ub294 \uc138\uc158 \ub4f1\ub85d \uc815\ubcf4 \uc774\ub984\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.privileged.session.attribute) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> UserToken 
a213=\uad8c\ud55c \uc18d\uc131 \ub9e4\ud551 \uc0ac\uc6a9
a213.help=\uc18d\uc131\uc744 \uc6d0\ub798 \uac12\uc5d0\uc11c \ub2e4\ub978 \uac12\uc73c\ub85c \ub9e4\ud551\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \ud2b9\uc815 \uad6c\uc131 \ud30c\uc77c\uc5d0\uc11c \uc0ac\uc6a9\ud560 \ubb38\uc790 \uc9d1\ud569\uc5d0 \ub300\ud574 \ucee8\ud14c\uc774\ub108\ubcc4 \uc81c\ud55c \uc0ac\ud56d\uc744 \ub9cc\uc871\ud558\uae30 \uc704\ud55c \uac83\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.privileged.attribute.mapping.enable) <br>\ud56b\uc2a4\uc651: \uc608
a214=\uad8c\ud55c \uc18d\uc131 \ub9e4\ud551
a214.help=\uad8c\ud55c \uc18d\uc131 \ub9e4\ud551 \uc0ac\uc6a9\uc744 \uc124\uc815\ud55c \uacbd\uc6b0\uc758 \ub9f5\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.privileged.attribute.mapping) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> webapp\uc758 \ubc30\ud3ec \uc124\uba85\uc790\uc5d0 \uc9c0\uc815\ub41c \uae30\ubcf8 \uc774\ub984 am_manager_role\uc5d0 UUID id=manager,ou=group,dc=openam,dc=openidentityplatform,dc=org\ub97c \ub9e4\ud551\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 id=manager,ou=group,dc=openam,dc=openidentityplatform,dc=org\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 am_manager_role\uc744 \uc785\ub825\ud569\ub2c8\ub2e4. <br> webapp\uc758 \ubc30\ud3ec \uc124\uba85\uc790\uc5d0 \uc9c0\uc815\ub41c \uae30\ubcf8 \uc774\ub984 am_employee_role\uc5d0 UUID id=employee,ou=group,dc=openam,dc=openidentityplatform,dc=org\ub97c \ub9e4\ud551\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 id=employee,ou=group,dc=openam,dc=openidentityplatform,dc=org\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 am_employee_role\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a215=\uc5d0\uc774\uc804\ud2b8 \ub514\ubc84\uadf8 \uc218\uc900
a215.help=\uae30\ub85d\ud560 \uc5d0\uc774\uc804\ud2b8 \ub514\ubc84\uadf8 \uba54\uc2dc\uc9c0 \uc720\ud615\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.services.debug.level) <br>\ud56b\uc2a4\uc651: \uc608
a216=\ucfe0\ud0a4 \uc774\ub984
a216.help=OpenAM \uc11c\ubc84\uc640 \uc5d0\uc774\uc804\ud2b8 \uac04\uc5d0 \uc0ac\uc6a9\ud558\ub294 SSO \ud1a0\ud070 \ucfe0\ud0a4\uc758 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.am.cookie.name) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a218=\ud074\ub77c\uc774\uc5b8\ud2b8 \ud3f4\ub9c1 \uc0ac\uc6a9
a218.help=\uc138\uc158 \ud074\ub77c\uc774\uc5b8\ud2b8\uac00 \uc138\uc158 \uc815\ubcf4 \uc5c5\ub370\uc774\ud2b8\uc5d0 \ud3f4\ub9c1\uc744 \uc0ac\uc6a9\ud558\uace0 \uc11c\ubc84 \uc54c\ub9bc\uc5d0 \uc758\uc874\ud558\uc9c0 \uc54a\uc744\uc9c0 \uc5ec\ubd80\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.am.session.client.polling.enable) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a219=\ud074\ub77c\uc774\uc5b8\ud2b8 \ud3f4\ub9c1 \uae30\uac04
a219.help=\uc138\uc158 \ud074\ub77c\uc774\uc5b8\ud2b8\uac00 \uc11c\ubc84\ub85c\ubd80\ud130 \uce90\uc2dc\ud55c \uc138\uc158 \uc815\ubcf4\uc758 \uc5c5\ub370\uc774\ud2b8\ub97c \uc694\uccad\ud55c \ud6c4\uc758 \uc2dc\uac04(\ucd08)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.am.session.client.polling.period) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a221=\uc554\ud638\ud654 \uacf5\uae09\uc790
a221.help=\uc5d0\uc774\uc804\ud2b8\uc5d0\uc11c \uc0ac\uc6a9\ud560 \uc554\ud638\ud654 \uacf5\uae09\uc790 \uad6c\ud604\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.security.encryptor) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a222=\uc0ac\uc6a9\uc790 \ub370\uc774\ud130 \uce90\uc2dc \uc54c\ub9bc \uc0ac\uc6a9
a222.help=amsdk \ubc0f IdRepo \uce90\uc2dc\uc5d0 \ub300\ud55c \uc54c\ub9bc\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.idm.remote.notification.enabled) <br>\ud56b\uc2a4\uc651: \uc608
a223=\uc0ac\uc6a9\uc790 \ub370\uc774\ud130 \uce90\uc2dc \ud3f4\ub9c1 \uc2dc\uac04
a223.help=\uc0ac\uc6a9\uc790 \uad00\ub9ac \ub370\uc774\ud130\uc5d0 \ub300\ud55c \uce90\uc2dc \uc5c5\ub370\uc774\ud2b8 \uc2dc\uac04(\ubd84)\uc785\ub2c8\ub2e4. '0'\uc73c\ub85c \uc124\uc815\ud558\uba74 \uc5c5\ub370\uc774\ud2b8\uac00 \uc2e4\ud589\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.am.sdk.remote.pollingTime)<br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a224=\uc11c\ube44\uc2a4 \ub370\uc774\ud130 \uce90\uc2dc \uc54c\ub9bc \uc0ac\uc6a9
a224.help=\uc11c\ube44\uc2a4 \uad00\ub9ac \uce90\uc2dc\uc5d0 \ub300\ud55c \uc54c\ub9bc\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.sm.notification.enabled) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a225=\uc11c\ube44\uc2a4 \ub370\uc774\ud130 \uce90\uc2dc \uc2dc\uac04
a225.help=\uc11c\ube44\uc2a4 \uad6c\uc131 \ub370\uc774\ud130\uc5d0 \ub300\ud55c \uce90\uc2dc \uc5c5\ub370\uc774\ud2b8 \uc2dc\uac04(\ubd84)\uc785\ub2c8\ub2e4. '0'\uc73c\ub85c \uc124\uc815\ud558\uba74 \uc5c5\ub370\uc774\ud2b8\uac00 \uc2e4\ud589\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.sm.cacheTime) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a229=OpenAM \uc778\uc99d \uc11c\ube44\uc2a4 \ud504\ub85c\ud1a0\ucf5c
a229.help=OpenAM \uc778\uc99d \uc11c\ube44\uc2a4\uc5d0\uc11c \uc0ac\uc6a9\ud560 \ud504\ub85c\ud1a0\ucf5c\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.am.server.protocol)<br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a231=OpenAM \uc778\uc99d \uc11c\ube44\uc2a4 \ud638\uc2a4\ud2b8 \uc774\ub984
a231.help=OpenAM \uc778\uc99d \uc11c\ube44\uc2a4\uc5d0\uc11c \uc0ac\uc6a9\ud560 \ud638\uc2a4\ud2b8 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.am.server.host)<br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a232=OpenAM \uc778\uc99d \uc11c\ube44\uc2a4 \ud3ec\ud2b8
a232.help=OpenAM \uc778\uc99d \uc11c\ube44\uc2a4\uc5d0\uc11c \uc0ac\uc6a9\ud560 \ud3ec\ud2b8\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.iplanet.am.server.port)<br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a235=\uc815\ucc45 \uc54c\ub9bc \uc0ac\uc6a9
a235.help=\uc6d0\uaca9 \uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8\uc5d0\uc11c \uc54c\ub9bc\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.notification.enabled) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a237=\uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8 \ud3f4\ub9c1 \uac04\uaca9
a237.help=\uc6d0\uaca9 \uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8\uc5d0\uc11c \uce90\uc2dc\ub41c \ud56d\ubaa9\uc744 \uc0c8\ub85c \uace0\uce58\ub294 \uac04\uaca9(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.polling.interval) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a238=\uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8 \uce90\uc2dc \ubaa8\ub4dc
a238.help=\uc6d0\uaca9 \uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8\uc5d0\uc11c \uc0ac\uc6a9\ud560 \uce90\uc2f1 \ubaa8\ub4dc\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.policy.client.cacheMode) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a239=\uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8 \ubd80\uc6b8 \uc791\uc5c5 \uac12
a239.help=\uc815\ucc45 \uc791\uc5c5 \uc774\ub984\uc758 \ubd80\uc6b8 \uc791\uc5c5 \uac12\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.policy.client.booleanActionValues) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a241=\uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8 \uc790\uc6d0 \ube44\uad50\uae30
a241.help=\ub2e4\ub978 \uc11c\ube44\uc2a4 \uc774\ub984\uc5d0 \ub300\ud574 \uc0ac\uc6a9\ud560 \uc790\uc6d0 \ube44\uad50\uae30\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.policy.client.resourceComparators) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a242=\uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8 \ud074\ub7ed \uc624\ucc28
a242.help=OpenAM \uc11c\ubc84 \uc2dc\uc2a4\ud15c\uacfc \uc6d0\uaca9 \uc815\ucc45 \ud074\ub77c\uc774\uc5b8\ud2b8 \uc2dc\uc2a4\ud15c \uc0ac\uc774\uc758 \uc2dc\uac04 \uc624\ucc28\ub97c \uc870\uc815\ud558\uae30 \uc704\ud574 \ud5c8\uc6a9\ub418\ub294 \uc2dc\uac04(\ucd08)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.policy.client.clockSkew) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a243=URL \uc815\ucc45 Env GET \ub9e4\uac1c \ubcc0\uc218
a243.help=OpenAM \uc11c\ubc84\uc5d0\uc11c URL \uc815\ucc45 \ud3c9\uac00\uc6a9\uc73c\ub85c \ud658\uacbd \ub9f5\uc5d0\uc11c \uc774\ub984\uacfc \uac12\uc744 \uc124\uc815\ud560 HTTP GET \uc694\uccad \ub9e4\uac1c \ubcc0\uc218\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4.(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.policy.env.get.param) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> name <br> phonenumber
a244=URL \uc815\ucc45 Env POST \ub9e4\uac1c \ubcc0\uc218
a244.help=OpenAM \uc11c\ubc84\uc5d0\uc11c URL \uc815\ucc45 \ud3c9\uac00\uc6a9\uc73c\ub85c \ud658\uacbd \ub9f5\uc5d0\uc11c \uc774\ub984\uacfc \uac12\uc744 \uc124\uc815\ud560 HTTP POST \uc694\uccad \ub9e4\uac1c \ubcc0\uc218\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4.(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.policy.env.post.param) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> name <br> phonenumber
a245=URL \uc815\ucc45 Env jsession \ub9e4\uac1c \ubcc0\uc218
a245.help=OpenAM \uc11c\ubc84\uc5d0\uc11c URL \uc815\ucc45 \ud3c9\uac00\uc6a9\uc73c\ub85c \ud658\uacbd \ub9f5\uc5d0\uc11c \uc774\ub984\uacfc \uac12\uc744 \uc124\uc815\ud560 HTTP SESSION \uc18d\uc131\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.policy.env.jsession.param) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> name <br> phonenumber
a246=\uc5d0\uc774\uc804\ud2b8 \uad6c\uc131 \ubcc0\uacbd \uc54c\ub9bc
a246.help=\uc5d0\uc774\uc804\ud2b8\uac00 OpenAM \uc11c\ubc84\ub85c\ubd80\ud130 \uad6c\uc131 \ubcc0\uacbd\uc5d0 \ub300\ud55c \uc54c\ub9bc \uba54\uc2dc\uc9c0\ub97c \ubc1b\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.change.notification.enable) <br>\ud56b\uc2a4\uc651: \uc608
a247=\uc0ac\uc6a9\uc790 \uc815\uc758 \ub4f1\ub85d \uc815\ubcf4
a247.help=\uc0ac\uc6a9\uc790\uac00 \uc5d0\uc774\uc804\ud2b8\uc5d0\uc11c \uc9c0\uc6d0\ud558\ub294 \ub4f1\ub85d \uc815\ubcf4 \uc9d1\ud569\uc5d0 \uc778\uc218\ub97c \uc9c0\uc815\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218 \uc788\ub294 \ucd94\uac00 \ub4f1\ub85d \uc815\ubcf4\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.freeformproperties) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> customproperty=custom-value1 <br> customlist[0]=customlist-value-0 <br> customlist[1]=customlist-value-1 <br> custommap[key1]=custommap-value-1 <br> custommap[key2]=custommap-value-2
a248=WebAuthentication \uc0ac\uc6a9 \uac00\ub2a5 
a248.help=\uc5d0\uc774\uc804\ud2b8\uac00 WebAuthentication \uae30\ub2a5\uc744 \uc0ac\uc6a9\ud558\uc5ec JBoss \uc6f9 \ucee8\ud14c\uc774\ub108\ub85c \ud504\ub85c\uadf8\ub798\ubc0d \uc778\uc99d\uc744 \ud560 \uc218 \uc788\ub3c4\ub85d \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.jboss.webauth.available) <br>\ud56b\uc2a4\uc651: \uc608
a250=\ud574\uc81c
a251=\uc624\ub958
a252=\uacbd\uace0
a253=\uba54\uc2dc\uc9c0
a254=OpenAM \ub85c\uadf8\uc544\uc6c3 URL
a254.help=OpenAM \ub85c\uadf8\uc544\uc6c3 \ud398\uc774\uc9c0 URL\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.url) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://host:port/opensso/UI/Logout
a255=\ub85c\uadf8\uc544\uc6c3 URL \uc6b0\uc120 \uc21c\uc704 \uc9c0\uc815
a255.help=\ub85c\uadf8\uc544\uc6c3 URL\uc758 \ud398\uc77c\uc624\ubc84 \uc6b0\uc120 \uc21c\uc11c\ub97c OpenAM \ub85c\uadf8\uc778 URL \ubaa9\ub85d\uc5d0 \uc815\uc758\ub41c \ub300\ub85c \uc9c0\uc815\ud560\uc9c0 \uc5ec\ubd80\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.url.prioritized) <br>\ud56b\uc2a4\uc651: \uc608
a256=\ub85c\uadf8\uc544\uc6c3 URL \uac80\uc99d
a256.help=URL\ub85c \ub9ac\ub514\ub809\uc158\ud558\uae30 \uc804\uc5d0 \uc5d0\uc774\uc804\ud2b8\uac00 \ud574\ub2f9 URL\uc758 \uac00\uc6a9\uc131\uc744 \ud655\uc778\ud560\uc9c0 \uc5ec\ubd80\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.url.probe.enabled) <br>\ud56b\uc2a4\uc651: \uc608
a257=\ub85c\uadf8\uc544\uc6c3 URL \uac80\uc99d \uc2dc\uac04 \ucd08\uacfc
a257.help=\ub85c\uadf8\uc544\uc6c3 URL \uac80\uc99d\uc774 true\ub85c \uc124\uc815\ub41c \uacbd\uc6b0 \uc5f0\uacb0 \uc2dc\uac04 \ucd08\uacfc \uac12(\ubc00\ub9ac\ucd08)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.url.probe.timeout) <br>\ud56b\uc2a4\uc651: \uc608


# WSS Agents properties
a301=\ubcf4\uc548 \uccb4\uacc4
a302=STS \uad6c\uc131
a302.help=\ubcf4\uc548 \uba54\ucee4\ub2c8\uc998\uc774 STSSecurity\ub85c \uc124\uc815\ub41c \uacbd\uc6b0 \ud544\uc218\uc784
a303=\uac80\uc0c9 \uad6c\uc131
a303.help=\ubcf4\uc548 \uba54\ucee4\ub2c8\uc998\uc774 LibertyDiscoverySecurity\ub85c \uc124\uc815\ub41c \uacbd\uc6b0 \ud544\uc218\uc784
a304=\uc0ac\uc6a9\uc790 \uc778\uc99d \ud544\uc694
a305=\uc694\uccad \uc11c\uba85\ub428
a306=\uc694\uccad \ud5e4\ub354 \uc554\ud638\ud654\ub428
a307=\uc694\uccad \uc554\ud638\ud654\ub428
a308=\uc751\ub2f5 \uc11c\uba85 \ud655\uc778\ub428
a309=\uc751\ub2f5 \ud574\ub3c5\ub428
a310=\uba54\uc2dc\uc9c0\uc758 \ubcf4\uc548 \ud5e4\ub354 \ubcf4\uc874
a311=\uae30\ubcf8 \ud0a4 \uc800\uc7a5\uc18c \uc0ac\uc6a9
a312=\ud0a4 \uc800\uc7a5\uc18c \uc704\uce58
a313=\ud0a4 \uc800\uc7a5\uc18c \ube44\ubc00\ubc88\ud638
a314=\ud0a4 \ube44\ubc00\ubc88\ud638
a315=\uac1c\uc778 \ud0a4 \ubcc4\uce6d
a315.help=\uc6f9 \uc11c\ube44\uc2a4 \uc694\uccad/\uc751\ub2f5\uc5d0 \uc11c\uba85\ud558\ub294 \ud0a4\uc785\ub2c8\ub2e4.
a316=\uc6f9 \uc11c\ube44\uc2a4 \uacf5\uae09\uc790\uc758 \uacf5\uac1c \ud0a4 \ubcc4\uce6d
a316.help=\uc6f9 \uc11c\ube44\uc2a4 \uc694\uccad\uc744 \uc554\ud638\ud654\ud558\ub294 \ub370 \ud544\uc694\ud55c \ud0a4\uc785\ub2c8\ub2e4.
a317=\uc6f9 \uc11c\ube44\uc2a4 \uc5d4\ub4dc \ud3ec\uc778\ud2b8
a317.help=\uc6f9 \uc11c\ube44\uc2a4 \uacf5\uae09\uc790\uac00 Liberty \ud1a0\ud070\uc744 \uc0ac\uc6a9\ud558\ub3c4\ub85d \uad6c\uc131\ub418\uc9c0 \uc54a\uc740 \uacbd\uc6b0 \uc774 \uc5d4\ub4dc \ud3ec\uc778\ud2b8\ub294 \uc635\uc158\uc785\ub2c8\ub2e4.
a318=\uc6f9 \uc11c\ube44\uc2a4 \ubcf4\uc548 \ud504\ub85d\uc2dc \uc5d4\ub4dc \ud3ec\uc778\ud2b8
a318.help=\uc6f9 \ubcf4\uc548 \ud504\ub85d\uc2dc\ub97c \uc0ac\uc6a9\ud558\ub3c4\ub85d \uad6c\uc131\ub418\uc9c0 \uc54a\uc740 \uacbd\uc6b0 \uc774 \uc5d4\ub4dc \ud3ec\uc778\ud2b8\ub294 \uc635\uc158\uc785\ub2c8\ub2e4.
a319=\ub9ac\ubc84\ud2f0 \uc11c\ube44\uc2a4 \uc720\ud615 URN
a319.help=\ubcf4\uc548 \uba54\ucee4\ub2c8\uc998\uc774 LibertyDiscoverySecurity\ub85c \uc124\uc815\ub420 \ub54c\uae4c\uc9c0\ub294 \uc774 \ud56d\ubaa9\uc774 \uc120\ud0dd \uc0ac\ud56d\uc785\ub2c8\ub2e4. 


a320=\uc0ac\uc6a9\uc790 \ud1a0\ud070\uc758 \uc790\uaca9 \uc99d\uba85
a321=\uc778\uc99d \uccb4\uc778
a322=\uc694\uccad \uc11c\uba85 \ud655\uc778\ub428
a323=\uc694\uccad \ud5e4\ub354 \ud574\ub3c5\ub428
a324=\uc694\uccad \ud574\ub3c5\ub428
a325=\uc751\ub2f5 \uc11c\uba85\ub428
a326=\uc751\ub2f5 \uc554\ud638\ud654\ub428
a327=\uac1c\uc778 \ud0a4 \uc720\ud615
a328=\uc6f9 \uc11c\ube44\uc2a4 \ud074\ub77c\uc774\uc5b8\ud2b8\uc758 \uacf5\uac1c \ud0a4 \ubcc4\uce6d
a328.help=\uc6f9 \uc11c\ube44\uc2a4 \uc751\ub2f5\uc744 \uc554\ud638\ud654\ud558\ub294 \ud0a4
a329=\ubcf4\uc548 \ud1a0\ud070 \uc11c\ube44\uc2a4\uc758 \uacf5\uac1c \ud0a4 \ubcc4\uce6d
a330=\ubcf4\uc548 \ud1a0\ud070 \uc11c\ube44\uc2a4 \uc5d4\ub4dc \ud3ec\uc778\ud2b8
a331=\ubcf4\uc548 \ud1a0\ud070 \uc11c\ube44\uc2a4 MEX \uc5d4\ub4dc \ud3ec\uc778\ud2b8
a332=\uac80\uc0c9 \uc11c\ube44\uc2a4 \uc5d4\ub4dc \ud3ec\uc778\ud2b8
a333=\uc778\uc99d \uc6f9 \uc11c\ube44\uc2a4 \uc5d4\ub4dc \ud3ec\uc778\ud2b8
a334=SAML \uc18d\uc131 \ub9e4\ud551
a335=SAML NameID \ub9e4\ud37c \ud50c\ub7ec\uadf8\uc778
a336=SAML \uc18d\uc131 \uc774\ub984 \uacf5\uac04
a337=\uad6c\uc131\uc6d0 \ud3ec\ud568
a338=\ucee4\ubc84\ub85c\uc2a4 \ub3c4\uba54\uc778 \uc11c\ubc84
a339=\ucee4\ubc84\ub85c\uc2a4 \ub3c4\uba54\uc778
a340=\ucee4\ubc84\ub85c\uc2a4 \uc11c\ube44\uc2a4 \uae30\ubcf8 \uc0ac\uc6a9\uc790(Principal)
a341=\ucee4\ubc84\ub85c\uc2a4 \ud0a4 \ud0ed \ud30c\uc77c
a342=\ucee4\ubc84\ub85c\uc2a4 \uc11c\uba85 \ud655\uc778
a342.help=\uc120\ud0dd \uc0ac\ud56d\uc774\uba70 JDK6\uc744 \uc0ac\uc6a9\ud558\ub294 \uacbd\uc6b0\uc5d0\ub9cc \uc0ac\uc6a9\ud574\uc57c \ud569\ub2c8\ub2e4.
a343=\ud1a0\ud070 \ubcc0\ud658 \uc720\ud615
a344=SSOToken
a345=SAML11Token
a346=SAML2Token

a350= \ucee4\ubc84\ub85c\uc2a4 \ub3c4\uba54\uc778 \uc11c\ubc84
a351= \ucee4\ubc84\ub85c\uc2a4 \ub3c4\uba54\uc778
a352= \ucee4\ubc84\ub85c\uc2a4 \uc11c\ube44\uc2a4 \uae30\ubcf8
a353= \ucee4\ubc84\ub85c\uc2a4 \ud2f0\ucf13 \uce90\uc2dc \ub514\ub809\ud1a0\ub9ac
a354= \ud1b5\uacfc \ubcf4\uc548 \ud1a0\ud070 \uc0ac\uc6a9
a354.help=\ud504\ub85d\uc2dc \uc6f9 \uc11c\ube44\uc2a4 \ud074\ub77c\uc774\uc5b8\ud2b8\uc5d0 \ub300\ud574 \uc0ac\uc6a9\ud560 \uc218 \uc788\uc73c\uba70 SAML \ubcf4\uc548 \uba54\ucee4\ub2c8\uc998\uc774 \ud65c\uc131\ud654\ub41c \uacbd\uc6b0\uc5d0\ub9cc \uc0ac\uc6a9\ub429\ub2c8\ub2e4.
a355= \uc11c\uba85 \ucc38\uc870 \uc720\ud615.
a355.help=X509 \ud1a0\ud070 \ubcf4\uc548 \uba54\ucee4\ub2c8\uc998\uc5d0\ub9cc \uc801\uc6a9\ub429\ub2c8\ub2e4.
a356=\uc9c1\uc811 \ucc38\uc870
a357=\ud0a4 \uc2dd\ubcc4\uc790 \ucc38\uc870
a358=X509 \ubc1c\uae09\uc790 \uc9c1\ub82c \ucc38\uc870
a359=\uc554\ud638\ud654 \uc54c\uace0\ub9ac\uc998
a360=\uc554\ud638\ud654 \uac15\ub3c4
a360.help=\uc0ac\uc6a9 \uac00\ub2a5\ud55c \uc554\ud638\ud654 \uac15\ub3c4\ub294 3DES\uc758 \uacbd\uc6b0 0, 112, 168\uc774\uace0 AES\uc758 \uacbd\uc6b0\uc5d0\ub294 128, 192 \ub610\ub294 256\uc785\ub2c8\ub2e4.
a361=WS-Trust \ubc84\uc804
a362=\uc0ac\uc6a9\uc790 \ud1a0\ud070 \uc7ac\uc804\uc1a1 \uac10\uc9c0
a363=\uba54\uc2dc\uc9c0 \uc7ac\uc804\uc1a1 \uac10\uc9c0

# Web Agent Properties
a400=\ucfe0\ud0a4 \uc774\ub984
a400.help=OpenAM \uc11c\ubc84\uc640 \uc5d0\uc774\uc804\ud2b8 \uac04\uc5d0 \uc0ac\uc6a9\ud558\ub294 SSO \ud1a0\ud070 \ucfe0\ud0a4\uc758 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cookie.name) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a401=\ucfe0\ud0a4 \ubcf4\uc548
a401.help=\ud1b5\uc2e0\uc774 \ubcf4\uc548\ub418\uc5b4 \uc788\ub294 \uacbd\uc6b0 \uc5d0\uc774\uc804\ud2b8\uac00 \uc548\uc804\ud55c \ucfe0\ud0a4\ub97c \ubcf4\ub0c5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cookie.secure) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a405=\uc54c\ub9bc \uc0ac\uc6a9
a405.help=\uc54c\ub9bc\uc740 \uc5d0\uc774\uc804\ud2b8\uc758 SSO, \uc815\ucc45 \ubc0f \uad6c\uc131 \uce90\uc2dc\ub97c \uc720\uc9c0 \uad00\ub9ac\ud558\ub294 \ub370 \ub3c4\uc6c0\uc774 \ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notification.enable) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a406=\uc5d0\uc774\uc804\ud2b8 \uc54c\ub9bc URL
a406.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc54c\ub9bc Listener\ub97c \ub4f1\ub85d\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 URL\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.client.notification.url) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a407=URL \ube44\uad50 \ub300\uc18c\ubb38\uc790 \uad6c\ubd84 \ud655\uc778
a407.help=\uc815\ucc45\uacfc \uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URL \ud3c9\uac00\uc5d0\uc11c \ub300\uc18c\ubb38\uc790\ub97c \uad6c\ubd84\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.url.comparison.case.ignore) <br>\ud56b\uc2a4\uc651: \uc608
a408=\uc815\ucc45 \uce90\uc2dc \ud3f4\ub9c1 \uae30\uac04
a408.help=\uc5d0\uc774\uc804\ud2b8\uc758 \uc815\ucc45 \uce90\uc2dc\ub97c \uc0c8\ub85c \uace0\uce58\uae30 \uc704\ud55c \ud3f4\ub9c1 \uac04\uaca9(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.policy.cache.polling.interval) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a409=SSO \uce90\uc2dc \ud3f4\ub9c1 \uae30\uac04
a409.help=\uc5d0\uc774\uc804\ud2b8\uc758 SSO \uce90\uc2dc\ub97c \uc0c8\ub85c \uace0\uce58\uae30 \uc704\ud55c \ud3f4\ub9c1 \uac04\uaca9(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.sso.cache.polling.interval) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a410=\uc0ac\uc6a9\uc790 \uc544\uc774\ub514 \ub9e4\uac1c \ubcc0\uc218
a410.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc0ac\uc6a9\uc790 \uc544\uc774\ub514\uc758 \uac12\uc744 REMOTE_USER \uc11c\ubc84 \ubcc0\uc218\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.userid.param) <br>\ud56b\uc2a4\uc651: \uc608
a411=\uc0ac\uc6a9\uc790 \uc544\uc774\ub514 \ub9e4\uac1c \ubcc0\uc218 \uc720\ud615
a411.help=\uc0ac\uc6a9\uc790 \uc544\uc774\ub514\ub97c SESSION \ubc0f LDAP \uc18d\uc131\uc5d0\uc11c \ubd88\ub7ec\uc62c \uc218 \uc788\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.userid.param.type) <br>\ud56b\uc2a4\uc651: \uc608
a412=\ud504\ub85c\ud544 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc
a412.help= (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.profile.attribute.fetch.mode) <br>\ud56b\uc2a4\uc651: \uc608
a413=\ud504\ub85c\ud544 \uc18d\uc131 \ub9f5
a413.help=\ud604\uc7ac \uc778\uc99d\ub41c \uc0ac\uc6a9\uc790\uc758 \ud2b9\uc815 \uc774\ub984 \uc544\ub798\uc5d0 \ucc44\uc6b8 \ud504\ub85c\ud544 \uc18d\uc131\uc744 \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.profile.attribute.mapping) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> CUSTOM-Common-Name \uc774\ub984 \uc544\ub798\uc758 \ud504\ub85c\ud544 \uc18d\uc131 cn \uac12\uc744 \ucc44\uc6b0\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 cn\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 CUSTOM-Common-Name\uc744 \uc785\ub825\ud569\ub2c8\ub2e4. <br> CUSTOM-Email \uc774\ub984 \uc544\ub798\uc758 \ud504\ub85c\ud544 \uc18d\uc131 mail \uac12\uc744 \ucc44\uc6b0\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 mail\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 CUSTOM-Email\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a414=\uc138\uc158 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc
a414.help= (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.session.attribute.fetch.mode) <br>\ud56b\uc2a4\uc651: \uc608
a415=\uc138\uc158 \uc18d\uc131 \ub9f5
a415.help=\ud604\uc7ac \uc778\uc99d\ub41c \uc0ac\uc6a9\uc790\uc758 \ud2b9\uc815 \uc774\ub984 \uc544\ub798\uc5d0 \ucc44\uc6b8 \uc138\uc158 \uc18d\uc131\uc744 \ub9e4\ud551\ud569\ub2c8\ub2e4.  (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.session.attribute.mapping) <br>\ud56b\uc2a4\uc651: \uc608  <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>  CUSTOM-userid \uc774\ub984 \uc544\ub798\uc758 \uc138\uc158 \uc18d\uc131 UserToken \uac12\uc744 \ucc44\uc6b0\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 UserToken\uc744 \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 CUSTOM-userid\ub97c \uc785\ub825\ud569\ub2c8\ub2e4.
a416=\uc751\ub2f5 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30 \ubaa8\ub4dc
a416.help= (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.response.attribute.fetch.mode) <br>\ud56b\uc2a4\uc651: \uc608
a417=\uc751\ub2f5 \uc18d\uc131 \ub9f5
a417.help=\ud604\uc7ac \uc778\uc99d\ub41c \uc0ac\uc6a9\uc790\uc758 \ud2b9\uc815 \uc774\ub984 \uc544\ub798\uc5d0 \ucc44\uc6b8 \uc815\ucc45 \uc751\ub2f5 \uc18d\uc131\uc744 \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.response.attribute.mapping) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> CUSTOM-USER-NAME \uc774\ub984 \uc544\ub798\uc758 \uc751\ub2f5 \uc18d\uc131 uid \uac12\uc744 \ucc44\uc6b0\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 uid\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 CUSTOM-USER-NAME\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a418=\uc18d\uc131 \uac12 \uad6c\ubd84\uc790
a418.help=\ud504\ub85c\ud544, \uc138\uc158 \ubc0f \uc751\ub2f5 \uc18d\uc131 \ub9f5\uc5d0\uc11c \uc0ac\uc6a9\ud558\ub294 \uad6c\ubd84 \ubb38\uc790\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.attribute.multi_value_separator) <br>\ud56b\uc2a4\uc651: \uc608
a419=\ub85c\ub4dc \ubc38\ub7f0\uc11c \uc124\uc815
a419.help=\ub85c\ub4dc \ubc38\ub7f0\uc11c\ub97c OpenAM \uc11c\ube44\uc2a4\uc5d0 \uc0ac\uc6a9\ud558\ub294 \uacbd\uc6b0 true\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.load.balancer.enable) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a420=\uc11c\ubc84 \ud655\uc778 \ubb34\uc2dc
a420.help=\uc5d0\uc774\uc804\ud2b8\uac00 302 \ub9ac\ub514\ub809\uc158\uc744 \uc218\ud589\ud558\uae30 \uc804\uc5d0 \uc774 \uac12\uc744 \uc0ac\uc6a9\ud558\uc5ec OpenAM\uac00 \uc2e4\ud589 \uc911\uc778\uc9c0 \ud655\uc778\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.ignore.server.check) <br>\ud56b\uc2a4\uc651: \uc608
a421=\uc774\ub984 \uc9c0\uc815 \uc694\uccad\uc5d0\uc11c \uae30\ubcf8 \uc774\ub984 \uc9c0\uc815 URL \ubb34\uc2dc
a421.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc774 \uac12\uc744 \uc0ac\uc6a9\ud558\uc5ec \uc774\ub984 \uc9c0\uc815 \uc694\uccad \uc2dc \uae30\ubcf8 \uc774\ub984 \uc9c0\uc815 URL\uc744 \ubcf4\ub0c5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.ignore.preferred.naming.url) <br>\ud56b\uc2a4\uc651: \uc608
a422=\uae30\ubcf8 \uc11c\ubc84\uc758 \ud3f4\ub9c1 \uac04\uaca9
a422.help=\uae30\ubcf8 \uc11c\ubc84\uac00 \uc791\ub3d9 \ubc0f \uc2e4\ud589 \uc911\uc778\uc9c0 \ud655\uc778\ud558\uae30 \uc704\ud574 \uc5d0\uc774\uc804\ud2b8\uac00 \ud3f4\ub9c1\ud558\ub294 \uac04\uaca9(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.poll.primary.server) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a423=OpenAM \ub85c\uadf8\uc778 URL
a423.help=OpenAM \ub85c\uadf8\uc778 \ud398\uc774\uc9c0 URL\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.login.url) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://host:port/opensso/UI/Login
a426=\uc5d0\uc774\uc804\ud2b8 \ubc30\ud3ec URI \uc811\ub450\uc5b4
a426.help=(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.agenturi.prefix) <br>\ud56b\uc2a4\uc651: \uc608
a427=\uc5d0\uc774\uc804\ud2b8 \ub85c\ucf08
a427.help=\uc81c\ud488\uc758 \uae30\ubcf8 \ub85c\ucf08\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.locale) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a428=SSO \uc804\uc6a9 \ubaa8\ub4dc
a428.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc778\uc99d(SSO)\uc744 \uc801\uc6a9\ud558\uc9c0\ub9cc \uc815\ucc45\uc5d0 \ub300\ud574\uc11c\ub294 \uc778\uc99d\uc744 \uc218\ud589\ud558\uc9c0 \uc5c6\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.sso.only) <br>\ud56b\uc2a4\uc651: \uc608
a429=\uc790\uc6d0 \uc561\uc138\uc2a4 \uac70\ubd80 URL
a429.help=\uc0ac\uc6a9\uc790 \uc9c0\uc815 \uc561\uc138\uc2a4 \uac70\ubd80 \ud398\uc774\uc9c0\uc758 URL\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.access.denied.url) <br>\ud56b\uc2a4\uc651: \uc608
a430=FQDN \ud655\uc778
a430.help=fqdn \uae30\ubcf8\uac12 \ubc0f fqdn \ub9f5 \uac12\uc744 \ud655\uc778\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.fqdn.check.enable) <br>\ud56b\uc2a4\uc651: \uc608
a431=FQDN \uae30\ubcf8\uac12
a431.help=\uc0ac\uc6a9\uc790\uac00 \uc790\uc6d0\uc5d0 \uc561\uc138\uc2a4\ud558\uae30 \uc704\ud574 \uc0ac\uc6a9\ud574\uc57c \ud558\ub294 \uc815\uaddc\ud654\ub41c \ud638\uc2a4\ud2b8 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.fqdn.default) <br>\ud56b\uc2a4\uc651: \uc608
a432=FQDN \uac00\uc0c1 \ud638\uc2a4\ud2b8 \ub9f5
a432.help=\ubcf4\ud638\ub418\ub294 \uc790\uc6d0\uc5d0 \uc561\uc138\uc2a4\ud560 \uc218 \uc788\ub3c4\ub85d \uac00\uc0c1 \ud638\uc2a4\ud2b8, \ubd80\ubd84\uc801\uc778 \ud638\uc2a4\ud2b8 \uc774\ub984 \ubc0f IP \uc8fc\uc18c\ub97c \ud65c\uc131\ud654\ud569\ub2c8\ub2e4. \uc798\ubabb\ub41c \ud0a4\ub97c \uc720\ud6a8\ud55c \uac12\uc5d0 \ub9e4\ud551\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.fqdn.mapping) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>  myserver.mydomain.com\uc5d0 myserver\ub97c \ub9e4\ud551\ud558\ub824\uba74 \ub9f5 \ud0a4 \ud544\ub4dc\uc5d0 myserver\ub97c \uc785\ub825\ud558\uace0 \ud574\ub2f9 \ub9f5 \uac12 \ud544\ub4dc\uc5d0 myserver.mydomain.com\uc744 \uc785\ub825\ud569\ub2c8\ub2e4.
a433=\ucfe0\ud0a4 \uc7ac\uc124\uc815
a433.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc778\uc99d\uc73c\ub85c \ub9ac\ub514\ub809\uc158\ud558\uae30 \uc804\uc5d0 \uc751\ub2f5\uc5d0\uc11c \ucfe0\ud0a4\ub97c \uc7ac\uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cookie.reset.enable) <br>\ud56b\uc2a4\uc651: \uc608
a434=\ucfe0\ud0a4 \uc7ac\uc124\uc815 \uc774\ub984 \ubaa9\ub85d
a434.help=\ucfe0\uae30 \ubaa9\ub85d \ud615\uc2dd: name[=value][;Domain=value]. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cookie.reset) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> Cookie1 <br> Cookie2=value;Domain=subdomain.domain.com
a435=\ub3c4\uba54\uc778 \uac04 SSO
a435.help=\ub3c4\uba54\uc778 \uac04 \ub2e8\uc77c \uc0ac\uc778\uc628(SSO)\uc744 \ud65c\uc131\ud654\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.enable) <br>\ud56b\uc2a4\uc651: \uc608
a436=\uc775\uba85 \uc0ac\uc6a9\uc790 \uae30\ubcf8\uac12
a436.help=\uc778\uc99d\ub418\uc9c0 \uc54a\uc740 \uc0ac\uc6a9\uc790\uc758 \uc544\uc774\ub514\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.anonymous.user.id) <br>\ud56b\uc2a4\uc651: \uc608
a437=\uc775\uba85 \uc0ac\uc6a9\uc790
a437.help=\uc775\uba85 \uc0ac\uc6a9\uc790\uc758 REMOTE_USER \ucc98\ub9ac\ub97c \ud65c\uc131\ud654/\ube44\ud65c\uc131\ud654\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.anonymous.user.enable) <br>\ud56b\uc2a4\uc651: \uc608
a438=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URL
a438.help=\uc778\uc99d\uc774 \ud544\uc694\ud558\uc9c0 \uc54a\uc740 URL\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.url) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://myagent.mydomain.com/*.gif 
a439=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URL \ubc18\uc804
a439.help=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URL \ubaa9\ub85d\ub9cc \uc801\uc6a9\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.url.invert) <br>\ud56b\uc2a4\uc651: \uc608
a440=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 \ud074\ub77c\uc774\uc5b8\ud2b8 IP \ubaa9\ub85d
a440.help=\uc774\ub4e4 \ud074\ub77c\uc774\uc5b8\ud2b8 IP \uc8fc\uc18c\uc5d0\uc11c \ubcf4\ub0b4\ub294 \uc694\uccad\uc5d0\ub294 \uc778\uc99d \ubc0f \uad8c\ud55c\uc774 \ud544\uc694\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.ip) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> 192.18.145.* <br> 192.18.146.123
a441=POST \ub370\uc774\ud130 \ubcf4\uc874
a441.help=POST \ub370\uc774\ud130 \ubcf4\uc874\uc744 \ud65c\uc131\ud654\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.postdata.preserve.enable) <br>\ud56b\uc2a4\uc651: \uc608
a442=POST \ub370\uc774\ud130 \ud56d\ubaa9 \uce90\uc2dc \uae30\uac04
a442.help=POST \uce90\uc2dc \ud56d\ubaa9 \uc218\uba85(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.postcache.entry.lifetime)<br>\ud56b\uc2a4\uc651: \uc608
a443=CDSSO \uc11c\ube14\ub9bf URL
a443.help=\uc5d0\uc774\uc804\ud2b8\uac00 CDSSO \ucc98\ub9ac\uc5d0 \uc0ac\uc6a9\ud560 \uc218 \uc788\ub294 CDSSO \ucee8\ud2b8\ub864\ub7ec\uc758 URL \ubaa9\ub85d\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.cdcservlet.url) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://host:port/opensso/cdcservlet
a444=\ucfe0\ud0a4 \ub3c4\uba54\uc778 \ubaa9\ub85d
a444.help=CDSSO\uc5d0\uc11c \ucfe0\ud0a4\ub97c \uc124\uc815\ud574\uc57c \ud558\ub294 \ub3c4\uba54\uc778\uc758 \ubaa9\ub85d\uc785\ub2c8\ub2e4.(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cdsso.cookie.domain) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> .sun.com
a445=\ud074\ub77c\uc774\uc5b8\ud2b8 IP \uac80\uc99d
a445.help=SSO \ud1a0\ud070\uc774 \ucc98\uc74c \ubc1c\uae09\ub41c \uc8fc\uc18c\uc640 \ub3d9\uc77c\ud55c IP \uc8fc\uc18c\uc5d0\uc11c \ud6c4\uc18d \ube0c\ub77c\uc6b0\uc800 \uc694\uccad\uc774 \uc628 \uac83\uc778\uc9c0 \uac80\uc99d\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.client.ip.validation.enable) <br>\ud56b\uc2a4\uc651: \uc608
a446=\ud504\ub85c\ud544 \uc18d\uc131 \ucfe0\ud0a4 \uc811\ub450\uc5b4
a446.help=\uc18d\uc131 \ud5e4\ub354\uc758 \ucfe0\ud0a4 \uc811\ub450\uc5b4\ub97c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.profile.attribute.cookie.prefix) <br>\ud56b\uc2a4\uc651: \uc608
a447=\ud504\ub85c\ud544 \uc18d\uc131 \ucfe0\ud0a4 \ucd5c\ub300 \uc218\uba85
a447.help=\uc18d\uc131 \ucfe0\ud0a4 \ud5e4\ub354\uc758 \ucd5c\ub300 \uc218\uba85\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.profile.attribute.cookie.maxage) <br>\ud56b\uc2a4\uc651: \uc608
a448=\ub85c\uadf8\uc544\uc6c3 URL \ubaa9\ub85d
a448.help=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub85c\uadf8\uc544\uc6c3 URL \ubaa9\ub85d\uc785\ub2c8\ub2e4. \uc0ac\uc6a9\uc790\uac00 \uc774\ub7ec\ud55c URL\uc5d0 \uc561\uc138\uc2a4\ud558\ub294 \uacbd\uc6b0 OpenAM \uc138\uc158\uc5d0\uc11c \ub85c\uadf8\uc544\uc6c3\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.agent.logout.url). \uc774 \ub4f1\ub85d \uc815\ubcf4\ub97c \uc0ac\uc6a9\ud558\ub294 \uacbd\uc6b0 \uc0ac\uc6a9\uc790\uac00 \uc544\ub798\uc758 \ub85c\uadf8\uc544\uc6c3 \ub9ac\ub514\ub809\uc158 URL \ub4f1\ub85d \uc815\ubcf4 \uac12\uc744 \uc9c0\uc815\ud574\uc57c \ud569\ub2c8\ub2e4.<br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> http://myagent.mydomain.com/logout.html
a449=\uc7ac\uc124\uc815\uc744 \uc704\ud55c \ub85c\uadf8\uc544\uc6c3 \ucfe0\ud0a4 \ubaa9\ub85d
a449.help=\ub85c\uadf8\uc544\uc6c3 \uc2dc \ucfe0\ud0a4 \uc7ac\uc124\uc815 \ubaa9\ub85d\uacfc \uac19\uc740 \ud615\uc2dd\uc73c\ub85c \uc7ac\uc124\uc815\ub418\ub294 \ucfe0\ud0a4\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.cookie.reset) <br>\ud56b\uc2a4\uc651: \uc608 <br> Cookie1 <br> Cookie2=value;Domain=subdomain.domain.com
a450=\ub8e8\ud2b8 \uc790\uc6d0\uc5d0\uc11c \uc815\ucc45 \ubd88\ub7ec\uc624\uae30
a450.help=\uc5d0\uc774\uc804\ud2b8\uac00 \uc790\uc6d0\uc758 \uc815\ucc45 \uacb0\uc815\uacfc \uc790\uc6d0 \ub8e8\ud2b8 \uc544\ub798\uc758 \ubaa8\ub4e0 \uc790\uc6d0\uc744 \uce90\uc2f1\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.fetch.from.root.resource) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a451=\ud074\ub77c\uc774\uc5b8\ud2b8 \ud638\uc2a4\ud2b8 \uc774\ub984 \uac80\uc0c9
a451.help=\uc815\ucc45 \ud3c9\uac00\uc5d0\uc11c \uc0ac\uc6a9\ud558\uae30 \uc704\ud574 DNS \uc5ed\ubc29\ud5a5 \uc870\ud68c\ub97c \ud1b5\ud574 \ud074\ub77c\uc774\uc5b8\ud2b8\uc758 \ud638\uc2a4\ud2b8 \uc774\ub984\uc744 \uac00\uc838\uc635\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.get.client.host.name) <br>\ud56b\uc2a4\uc651: \uc608
a452=\ud504\ub85c\ud544 \uc18d\uc131\uc758 \uc6d0\uc2dc \uc778\ucf54\ub529
a452.help=\uc5d0\uc774\uc804\ud2b8\uac00 OS \ub85c\ucf08\uc758 \uae30\ubcf8 \uc778\ucf54\ub529\uc73c\ub85c LDAP \ud5e4\ub354 \uac12\uc744 \uc778\ucf54\ub529\ud569\ub2c8\ub2e4. false\uc778 \uacbd\uc6b0 UTF-8\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.convert.mbyte.enable) <br>\ud56b\uc2a4\uc651: \uc608
a453=URL \ud2b9\uc218 \ubb38\uc790 \uc778\ucf54\ub529
a453.help=\uc815\ucc45\uc744 \ud3c9\uac00\ud558\uae30 \uc804\uc5d0 \ud2b9\uc218 \ubb38\uc790\uac00 \uc788\ub294 URL\uc744 \uc778\ucf54\ub529\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.encode.url.special.chars.enable) <br>\ud56b\uc2a4\uc651: \uc608
a454=\uc694\uccad URL\uc758 \uacbd\ub85c \uc815\ubcf4 \ubb34\uc2dc
a454.help=\uc774 \uac12\uc744 true\ub85c \uc124\uc815\ud558\uba74 \uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 \ubaa9\ub85d \ud655\uc778 \ubc0f URL \uc815\ucc45 \ud3c9\uac00 \uc911\uc5d0 \uc694\uccad URL\uc5d0\uc11c \uacbd\ub85c \uc815\ubcf4\uac00 \uc81c\uac70\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.ignore.path.info) <br>\ud56b\uc2a4\uc651: \uc608
a455=\uc694\uccad URL \ud504\ub85c\ud1a0\ucf5c \uc7ac\uc815\uc758
a455.help=\uc5d0\uc774\uc804\ud2b8\uac00 SSL \uc624\ud504\ub85c\ub354, \ub85c\ub4dc \ubc38\ub7f0\uc11c \ub610\ub294 \ud504\ub85d\uc2dc \ub4a4\uc5d0 \uc788\ub294 \uacbd\uc6b0 true\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.override.protocol) <br>\ud56b\uc2a4\uc651: \uc608
a456=\uc694\uccad URL \ud638\uc2a4\ud2b8 \uc7ac\uc815\uc758
a456.help=\uc5d0\uc774\uc804\ud2b8\uac00 SSL \uc624\ud504\ub85c\ub354, \ub85c\ub4dc \ubc38\ub7f0\uc11c \ub610\ub294 \ud504\ub85d\uc2dc \ub4a4\uc5d0 \uc788\ub294 \uacbd\uc6b0 true\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.override.host) <br>\ud56b\uc2a4\uc651: \uc608
a457=\uc694\uccad URL \ud3ec\ud2b8 \uc7ac\uc815\uc758
a457.help=\uc5d0\uc774\uc804\ud2b8\uac00 SSL \uc624\ud504\ub85c\ub354, \ub85c\ub4dc \ubc38\ub7f0\uc11c \ub610\ub294 \ud504\ub85d\uc2dc \ub4a4\uc5d0 \uc788\ub294 \uacbd\uc6b0 true\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.override.port) <br>\ud56b\uc2a4\uc651: \uc608
a458=\uc54c\ub9bc URL \uc7ac\uc815\uc758
a458.help=\uc5d0\uc774\uc804\ud2b8\uac00 SSL \uc624\ud504\ub85c\ub354, \ub85c\ub4dc \ubc38\ub7f0\uc11c \ub610\ub294 \ud504\ub85d\uc2dc \ub4a4\uc5d0 \uc788\ub294 \uacbd\uc6b0 true\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.override.notification.url) <br>\ud56b\uc2a4\uc651: \uc608
a459=\uc5d0\uc774\uc804\ud2b8 \uc5f0\uacb0 \uc2dc\uac04 \ucd08\uacfc
a459.help=OpenAM \uc778\uc99d \uc11c\ubc84\uc640 \uc5d0\uc774\uc804\ud2b8\uc758 \uc5f0\uacb0 \uc2dc\uac04 \ucd08\uacfc \uac04\uaca9(\ucd08)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.auth.connection.timeout)<br>\ud56b\uc2a4\uc651: \uc608
a460=\uae30\ubcf8 \uc11c\ubc84\uc758 \ud3f4\ub9c1 \uac04\uaca9
a460.help=\uae30\ubcf8 \uc11c\ubc84\uac00 \uc791\ub3d9 \ubc0f \uc2e4\ud589 \uc911\uc778\uc9c0 \ud655\uc778\ud558\uae30 \uc704\ud574 \uc5d0\uc774\uc804\ud2b8\uac00 \ud3f4\ub9c1\ud558\ub294 \uac04\uaca9(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.poll.primary.server) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a461=\uc5d0\uc774\uc804\ud2b8 \ub85c\ucf08
a461.help=\uc81c\ud488\uc758 \uae30\ubcf8 \ub85c\ucf08\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.locale) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a462= \ud504\ub85d\uc2dc \uc11c\ubc84\uc758 \ud638\uc2a4\ud2b8 \ubc0f \ud3ec\ud2b8 \uc7ac\uc815\uc758
a462.help=(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.proxy.override.host.port) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a463=\uad6c\uc131 \uc7ac\ub85c\ub4dc \uac04\uaca9
a463.help=OpenAM\uc5d0\uc11c \uc5d0\uc774\uc804\ud2b8 \uad6c\uc131\uc744 \ubd88\ub7ec\uc624\ub294 \uac04\uaca9(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.polling.interval) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a464=\uad6c\uc131 \uc815\ub9ac \uac04\uaca9
a464.help=\uc774\uc804 \uc5d0\uc774\uc804\ud2b8 \uad6c\uc131 \ud56d\ubaa9\uc744 \uc815\ub9ac\ud558\ub294 \uac04\uaca9(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.cleanup.interval)<br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a465=\uc0ac\uc6a9\uc790 \uc815\uc758 \ub4f1\ub85d \uc815\ubcf4
a465.help=\uc0ac\uc6a9\uc790\uac00 \uc5d0\uc774\uc804\ud2b8\uc5d0\uc11c \uc9c0\uc6d0\ud558\ub294 \ub4f1\ub85d \uc815\ubcf4 \uc9d1\ud569\uc5d0 \uc778\uc218\ub97c \uc9c0\uc815\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 \uc218 \uc788\ub294 \ucd94\uac00 \ub4f1\ub85d \uc815\ubcf4\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.freeformproperties) <br>\ud56b\uc2a4\uc651: \uc608 <br> \uc608\ub97c \ub4e4\uc5b4 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br> customproperty=custom-value1 <br> customlist[0]=customlist-value-0 <br> customlist[1]=customlist-value-1 <br> custommap[key1]=custommap-value-1 <br> custommap[key2]=custommap-value-2
a467=\uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URL\uc758 \uc18d\uc131 \ubd88\ub7ec\uc624\uae30
a467.help=\uc5d0\uc774\uc804\ud2b8\ub294 \uc815\ucc45 \ud3c9\uac00\ub97c \uc218\ud589\ud558\uc5ec \uac15\uc81c \uc801\uc6a9\ub418\uc9c0 \uc54a\uc740 URL\uc758 \ud504\ub85c\ud544 \uc18d\uc131\uc744 \ubd88\ub7ec\uc635\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.notenforced.url.attributes.enable) <br>\ud56b\uc2a4\uc651: \uc608
a468=\uc624\ub958
a469=\uacbd\uace0
a470=\uc815\ubcf4
a471=\uba54\uc2dc\uc9c0
a472=\ubaa8\ub450
a473=\ub192\uc74c
a474=\ub0ae\uc74c
a475=\uc911\uac04
a476=\uae30\ubcf8
a477=\uc778\uc99d \uc720\ud615 
a477.help=(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.iis.auth.type) 
a478=\ube44\ubc00\ubc88\ud638 \ud0a4 \uc7ac\uc0dd 
a478.help=\uc138\uc158\uc758 \uae30\ubcf8 \uc778\uc99d \ube44\ubc00\ubc88\ud638\ub97c \ud574\ub3c5\ud558\ub294 \ub370 \uc0ac\uc6a9\ud560 DES \ud0a4\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.replaypasswd.key) 
a479=\ud544\ud130 \uc6b0\uc120 \uc21c\uc704 
a479.help=\ud544\ud130\uc758 \ub85c\ub4dc \uc6b0\uc120 \uc21c\uc704\uc785\ub2c8\ub2e4.(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.iis.filter.priority)
a480=OWA\ub85c \uad6c\uc131\ub41c \ud544\ud130 
a480.help=OWA\uc5d0 \ub300\ud574 IIS \uc5d0\uc774\uc804\ud2b8 \ud544\ud130\ub97c \uad6c\uc131\ud55c \uacbd\uc6b0 true\ub85c \uc124\uc815\ud569\ub2c8\ub2e4.(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.iis.owa.enable)
a481=URL \ud504\ub85c\ud1a0\ucf5c\uc744 https\ub85c \ubcc0\uacbd 
a481.help=true\uc778 \uacbd\uc6b0 IE6 \ubcf4\uc548 \ud31d\uc5c5\uc744 \ucc28\ub2e8\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.iis.owa.enable.change.protocol)
a482=\uc720\ud734 \uc138\uc158 \uc2dc\uac04 \ucd08\uacfc \ud398\uc774\uc9c0 URL
a482.help=\ub85c\uceec \uc720\ud734 \uc138\uc158 \uc2dc\uac04 \ucd08\uacfc \ud398\uc774\uc9c0\uc758 URL\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.iis.owa.enable.session.timeout.url) 
a483=Domino \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc758 \uc0ac\uc6a9\uc790 \ud655\uc778
a483.help=true\uc778 \uacbd\uc6b0 \uc5d0\uc774\uc804\ud2b8\uac00 Domino \uc774\ub984 \ub370\uc774\ud130\ubca0\uc774\uc2a4\uc5d0\uc11c \uc0ac\uc6a9\uc790\uc758 \uc874\uc7ac\ub97c \ud655\uc778\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.domino.check.name.database) 
a484=LTPA \ud1a0\ud070 \uc0ac\uc6a9
a484.help=\uc5d0\uc774\uc804\ud2b8\uac00 LTPA \ud1a0\ud070\uc744 \uc0ac\uc6a9\ud574\uc57c \ud558\ub294 \uacbd\uc6b0 true\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.domino.ltpa.enable)
a485=LTPA \ud1a0\ud070 \ucfe0\ud0a4 \uc774\ub984
a485.help=LTPA \ud1a0\ud070\uc774 \ud3ec\ud568\ub41c \ucfe0\ud0a4\uc758 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.domino.ltpa.cookie.name) 
a486=LTPA \ud1a0\ud070 \uad6c\uc131 \uc774\ub984
a486.help=\uc5d0\uc774\uc804\ud2b8\uac00 LTPA \ud1a0\ud070 \uba54\ucee4\ub2c8\uc998\uc744 \uc801\uc6a9\ud558\uae30 \uc704\ud574 \uc0ac\uc6a9\ud558\ub294 \uad6c\uc131 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.domino.ltpa.config.name) 
a487=LTPA \ud1a0\ud070 \uc870\uc9c1 \uc774\ub984
a487.help=LTPA \ud1a0\ud070\uc774 \uc18d\ud55c \uc870\uc9c1 \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.domino.ltpa.org.name)
a488=\uc815\ucc45 \ud074\ub7ed \uc624\ucc28
a488.help=\uc5d0\uc774\uc804\ud2b8 \uc2dc\uc2a4\ud15c\uacfc OpenAM \uac04\uc758 \uc2dc\uac04 \uc624\ucc28\ub97c \uc870\uc815\ud558\ub294 \ub370 \uc0ac\uc6a9\ud558\ub294 \uc2dc\uac04(\ucd08)\uc785\ub2c8\ub2e4. \ud074\ub7ed \uc624\ucc28(\ucd08) = AgentTime - OpenAMServerTime. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.policy.clock.skew) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a489=\uac10\uc0ac \uc561\uc138\uc2a4 \uc720\ud615
a489.help=\uc0ac\uc6a9\uc790 URL \uc561\uc138\uc2a4 \uc2dc\ub3c4\ub97c \ubc14\ud0d5\uc73c\ub85c \uae30\ub85d\ud560 \uba54\uc2dc\uc9c0 \uc720\ud615\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.audit.accesstype) <br>\ud56b\uc2a4\uc651: \uc608
a490=\uac10\uc0ac \ub85c\uadf8 \uc704\uce58
a490.help=\uac10\uc0ac \uba54\uc2dc\uc9c0\ub97c \uae30\ub85d\ud560 \uc704\uce58\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.log.disposition) <br>\ud56b\uc2a4\uc651: \uc608
a491=\uc6d0\uaca9 \ub85c\uadf8 \ud30c\uc77c \uc774\ub984 
a491.help=OpenAM \uc11c\ubc84\uc5d0 \uc800\uc7a5\ub418\uba70 \uc5d0\uc774\uc804\ud2b8 \uac10\uc0ac \uba54\uc2dc\uc9c0\uac00 \ub4e4\uc5b4 \uc788\ub294 \ud30c\uc77c \uc774\ub984\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.remote.logfile) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a492=\uc6d0\uaca9 \uac10\uc0ac \ub85c\uadf8 \uac04\uaca9
a492.help=\uc815\uae30\uc801\uc73c\ub85c \uac10\uc0ac \ub85c\uadf8 \uba54\uc2dc\uc9c0\ub97c \uc6d0\uaca9 \ub85c\uadf8 \ud30c\uc77c\ub85c \ubcf4\ub0b4\ub294 \uac04\uaca9(\ubd84)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.remote.log.interval) <br>\ud56b\uc2a4\uc651: \uc544\ub2c8\uc694
a493=\ub85c\uceec \uac10\uc0ac \ub85c\uadf8 \ud68c\uc804
a493.help=\ud2b9\uc815 \ud06c\uae30\uc5d0 \ub3c4\ub2ec\ud55c \uac10\uc0ac \ub85c\uadf8 \ud30c\uc77c\uc744 \ud68c\uc804\ud558\ub3c4\ub85d \ud45c\uc2dc\ud558\ub294 \ud50c\ub798\uadf8\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.local.log.rotate) <br>\ud56b\uc2a4\uc651: \uc608
a494=\ub85c\uceec \uac10\uc0ac \ub85c\uadf8 \ud68c\uc804 \ud06c\uae30
a494.help=\ub85c\uceec \uac10\uc0ac \ub85c\uadf8 \ud30c\uc77c\uc744 \uc0c8 \ud30c\uc77c\ub85c \ud68c\uc804\ud558\ub294 \uacbd\uc6b0 \ud06c\uae30 \uc81c\ud55c(\ubc14\uc774\ud2b8)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.local.log.size) <br>\ud56b\uc2a4\uc651: \uc608
a495=\uc5d0\uc774\uc804\ud2b8 \ub514\ubc84\uadf8 \uc218\uc900
a495.help=\uc5d0\uc774\uc804\ud2b8 \ub514\ubc84\uadf8 \uc218\uc900\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.debug.level) <br>\ud56b\uc2a4\uc651: \uc608
a496=\uc5d0\uc774\uc804\ud2b8 \ub514\ubc84\uadf8 \ud30c\uc77c \ud68c\uc804
a496.help=\uc9c0\uc815\ub41c \ud06c\uae30\uc5d0 \ub530\ub77c \ub514\ubc84\uadf8 \ud30c\uc77c\uc774 \ud68c\uc804\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.debug.file.rotate) <br>\ud56b\uc2a4\uc651: \uc608
a497=\uc5d0\uc774\uc804\ud2b8 \ub514\ubc84\uadf8 \ud30c\uc77c \ud06c\uae30
a497.help=\uc5d0\uc774\uc804\ud2b8 \ub514\ubc84\uadf8 \ud30c\uc77c \ud06c\uae30(\ubc14\uc774\ud2b8)\uc785\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.debug.file.size) <br>\ud56b\uc2a4\uc651: \uc608
a498=\uc18d\uc131 \ub2e4\uc911 \uac12 \uad6c\ubd84 \uae30\ud638 
a498.help=\uac12\uc774 \uc5ec\ub7ec \uac1c\uc77c \ub54c \uc0ac\uc6a9\ud560 \uad6c\ubd84 \uae30\ud638\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. \ud504\ub85c\ud544, \uc138\uc158 \ubc0f \uc751\ub2f5 \uc18d\uc131 \ub4f1\uacfc \uac19\uc740 \ubaa8\ub4e0 \uc18d\uc131 \uc720\ud615\uc5d0 \uc801\uc6a9\ub429\ub2c8\ub2e4. (\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.attribute.multi.value.separator) <br>\ud56b\uc2a4\uc651: \uc608
a499=\ub85c\uadf8\uc544\uc6c3 \ub9ac\ub514\ub809\uc158 URL
a499.help= \uc0ac\uc6a9\uc790\uac00 \ub85c\uadf8\uc544\uc6c3\ud55c \ud6c4 \uc774 URL\ub85c \ub9ac\ub514\ub809\uc158\ub429\ub2c8\ub2e4.(\ub4f1\ub85d \uc815\ubcf4 \uc774\ub984: com.sun.identity.agents.config.logout.redirect.url). \uc774 \ub4f1\ub85d \uc815\ubcf4\ub294 \uc704\uc758 \ub85c\uadf8\uc544\uc6c3 URL \ubaa9\ub85d\uacfc \ud568\uaed8 \uc9c0\uc815\ud574\uc57c \ud569\ub2c8\ub2e4.<br>\ud56b\uc2a4\uc651: \uc608


# 2.2 Policy Agent properties
a500=\uc124\uba85
a501=\uc5d0\uc774\uc804\ud2b8 \ud0a4 \uac12
a501.help=\uc5d0\uc774\uc804\ud2b8 \ub4f1\ub85d \uc815\ubcf4\ub97c \ud55c \uc30d\uc758 \ud0a4/\uac12\uc73c\ub85c \uc124\uc815\ud569\ub2c8\ub2e4. \uc774 \ub4f1\ub85d \uc815\ubcf4\ub294 OpenAM\uac00 \uc0ac\uc6a9\uc790 \uc790\uaca9 \uc99d\uba85 \uba85\uc81c\uc5d0 \ub300\ud55c \uc5d0\uc774\uc804\ud2b8 \uc694\uccad\uc744 \ubc1b\ub294 \ub370 \uc0ac\uc6a9\ub429\ub2c8\ub2e4. \ud604\uc7ac \ud558\ub098\uc758 \ub4f1\ub85d \uc815\ubcf4\ub9cc \uc720\ud6a8\ud558\uba70 \ub2e4\ub978 \ub4f1\ub85d \uc815\ubcf4\ub294 \ubaa8\ub450 \ubb34\uc2dc\ub429\ub2c8\ub2e4. \ub2e4\uc74c \ud615\uc2dd\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624. <br> agentRootURL=\ud504\ub85c\ud1a0\ucf5c://\ud638\uc2a4\ud2b8 \uc774\ub984:\ud3ec\ud2b8/ <br> \ud574\ub2f9 \ud56d\ubaa9\uc740 \uc815\ud655\ud574\uc57c \ud558\uba70 agentRootURL\uc740 \ub300\uc18c\ubb38\uc790\ub97c \uad6c\ubd84\ud569\ub2c8\ub2e4.

# Agent Authenticator properties
a600=\uc77d\uc744 \uc218 \uc788\ub294 \uc5d0\uc774\uc804\ud2b8 \ud504\ub85c\ud544.
a601=CDSSO\uc758 \uc5d0\uc774\uc804\ud2b8 \ub8e8\ud2b8 URL
a601.help=CDSSO\uc758 \uc5d0\uc774\uc804\ud2b8 \ub8e8\ud2b8 URL\uc785\ub2c8\ub2e4. \uc62c\ubc14\ub978 \uac12\uc758 \ud615\uc2dd\uc740 \ub2e4\uc74c\uacfc \uac19\uc2b5\ub2c8\ub2e4. <br>protocol://hostname:port/<br> protocol\uc740 \uc0ac\uc6a9\ub418\ub294 \ud504\ub85c\ud1a0\ucf5c(\uc608: http \ub610\ub294 https)\uc744 \ub098\ud0c0\ub0c5\ub2c8\ub2e4. hostname\uc740 \uc5d0\uc774\uc804\ud2b8\uac00 \uc788\ub294 \uc2dc\uc2a4\ud15c\uc758 \ud638\uc2a4\ud2b8 \uc774\ub984\uc744 \ub098\ud0c0\ub0c5\ub2c8\ub2e4. port\ub294 \uc5d0\uc774\uc804\ud2b8\uac00 \uc124\uce58\ub418\uc5b4 \uc788\ub294 \ud3ec\ud2b8 \ubc88\ud638\ub97c \ub098\ud0c0\ub0c5\ub2c8\ub2e4. \ud3ec\ud2b8 \ubc88\ud638 \ub4a4\uc5d0\ub294 \ubc18\ub4dc\uc2dc \uc2ac\ub798\uc2dc(/)\uac00 \uc640\uc57c \ud569\ub2c8\ub2e4. 

# UI properties
wss.header.general=\uc77c\ubc18
wss.header.security=\ubcf4\uc548
wss.header.signencrypt=\uc11c\uba85 \ubc0f \uc554\ud638\ud654
wss.header.keystore=\ud0a4 \uc800\uc7a5\uc18c
wss.header.endpoints=\uc5d4\ub4dc \ud3ec\uc778\ud2b8
wss.header.saml.configuration=SAML \uad6c\uc131
wss.header.kerberos=\ucee4\ubc84\ub85c\uc2a4 \uad6c\uc131
blank.header=
label.Yes=\uc608
web.services.profile.username-token-header=\uc0ac\uc6a9\uc790 \ud1a0\ud070\uc758 \uc790\uaca9 \uc99d\uba85
label.agentgroup=\uadf8\ub8f9
keystore.usage=\ud0a4 \uc800\uc7a5\uc18c \uc0ac\uc6a9
keystore.usage.default=\uae30\ubcf8
keystore.usage.custom=\uc0ac\uc6a9\uc790 \uc815\uc758
keystore.information=\ud0a4 \uc800\uc7a5\uc18c \uc704\uce58(\uae30\ubcf8 \ud0a4 \uc800\uc7a5\uc18c \uc0ac\uc6a9\uc774 \uc120\ud0dd\ub418\uc5b4 \uc788\uc9c0 \uc54a\uc744 \uacbd\uc6b0 \ud544\uc218\uc784)
entity.attribute.label.uuid=\ubc94\uc6a9 \uc2dd\ubcc4\uc790
entity.attribute.label.identityType=\uc720\ud615
web.services.profile.usernametokenname=\uc774\ub984
web.services.profile.usernametokenpassword=\ube44\ubc00\ubc88\ud638
