<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Informaci&oacute;n del documento - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">

<a name="documentinfo"></a><p>Referencia: 820-4361</p>8.0<p></p><p>4150 Network Circle<br>Santa Clara,  CA 95054<br>U.S.A.</p><p>Copyright 2008 Sun Microsystems, Inc.</p><p>La
Ayuda en l&#237;nea de la consola de Sun<sup>TM</sup> OpenSSO 8.0 proporciona informaci&#243;n
sobre las tareas administrativas para el control de acceso, la federaci&#243;n y
los servicios web, y contiene definiciones de atributos para los servicios predeterminados
de OpenSSO 8.0.</p><p>Sun Microsystems, Inc. posee derechos de propiedad intelectual en relaci&#243;n
con la tecnolog&#237;a incluida en el producto descrito en este documento. De
forma espec&#237;fica y sin limitaci&#243;n, entre estos derechos de propiedad intelectual se
incluyen una o varias patentes en los EE.UU. o aplicaciones pendientes de
patente en los EE.UU. y otros pa&#237;ses.</p><p>Derechos gubernamentales de los EE. UU.
&#8211; Software comercial. Los usuarios gubernamentales est&#225;n sujetos al acuerdo de licencia
est&#225;ndar de Sun Microsystems, Inc. y a las disposiciones aplicables de la
regulaci&#243;n FAR y sus suplementos.</p><p>Esta distribuci&#243;n puede incluir materiales desarrollados por terceras
partes.</p><p>Determinadas partes del producto pueden derivarse de Berkeley BSD Systems, con licencia
de la Universidad de California. UNIX es una marca registrada en los
EE.UU. y otros pa&#237;ses, bajo licencia exclusiva de X/Open Company, Ltd.</p><p>Sun, Sun
Microsystems, el logotipo de Sun, el logotipo de Solaris, el logotipo de
la taza de caf&#233; de Java, docs.sun.com,        Java y Solaris son marcas
comerciales o marcas comerciales registradas de Sun Microsystems, Inc. en EE.UU y
otros pa&#237;ses. Todas las marcas registradas SPARC se usan bajo licencia y
son marcas comerciales o marcas registradas de SPARC International, Inc. en los
EE.UU. y en otros pa&#237;ses. Los productos con las marcas registradas de
SPARC se basan en una arquitectura desarrollada por Sun Microsystems, Inc.    </p><p>La
interfaz gr&#225;fica de usuario OPEN LOOK y Sun fue desarrollada por Sun
Microsystems, Inc. para sus usuarios y licenciatarios. Sun reconoce los esfuerzos pioneros
de Xerox en la investigaci&#243;n y desarrollo del concepto de interfaces gr&#225;ficas
o visuales de usuario para el sector inform&#225;tico. Sun dispone de una
licencia no exclusiva de Xerox para la interfaz gr&#225;fica de usuario de
Xerox, que tambi&#233;n cubre a los licenciatarios de Sun que implementen las
GUI de OPEN LOOK y que, por otra parte, cumplan con los
acuerdos de licencia por escrito de Sun.</p><p>Los productos descritos y abordados en
esta publicaci&#243;n est&#225;n sometidos a la legislaci&#243;n de control de exportaciones de
los EE.UU. y pueden estar sujetos a leyes de importaci&#243;n o exportaci&#243;n
de otros pa&#237;ses. Se proh&#237;be estrictamente el uso final de estos productos
en misiles nucleares, armas qu&#237;micas o biol&#243;gicas o aplicaciones nucleares mar&#237;timas, ya
sea de forma directa o indirecta. Se proh&#237;be estrictamente la exportaci&#243;n o
reexportaci&#243;n a pa&#237;ses bajo el embargo de los EE.UU o a entidades
incluidas en la lista de exclusi&#243;n de exportaci&#243;n de los EE.UU., incluidas,
pero no limit&#225;ndose a, las personas rechazadas y a las listas nacionales
designadas espec&#237;ficamente.</p><p>ESTA DOCUMENTACI&#211;N SE PROPORCIONA &#8220;TAL CUAL&#8221;. SE RENUNCIA A TODAS LAS
CONDICIONES EXPRESAS O IMPL&#205;CITAS, REPRESENTACIONES Y GARANT&#205;AS, INCLUIDAS CUALQUIER GARANT&#205;A IMPL&#205;CITA DE
COMERCIALIZACI&#211;N, ADECUACI&#211;N PARA UNA FINALIDAD DETERMINADA O DE NO CONTRAVENCI&#211;N, EXCEPTO EN
AQUELLOS CASOS EN QUE DICHA RENUNCIA NO FUERA LEGALMENTE V&#193;LIDA.</p>
<br/>

</body>
</html>
