<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para agregar un nuevo proveedor de servicios alojado a una entidad de proveedores - Ayuda en l&#237;nea de la consola de Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fsserviceproviderhostedadd"></a><h4>Para agregar un nuevo proveedor de servicios alojado a una entidad de proveedores</h4><p>Un <b>proveedor alojado</b> est&#225; alojado en el mismo servidor que Federated Access Manager.
La configuraci&#243;n de los atributos del nuevo proveedor de servicios alojado incluye
la adici&#243;n de metadatos relacionados con el proveedor de servicios al perfil
de la entidad. El punto de partida de este procedimiento es <a href="federation.fsserviceprovider.html">Para agregar un proveedor de servicios a una entidad de proveedores</a>.</p>
<hr><p><b>Nota &#8211; </b>Los atributos adicionales se pueden configurar, pero no est&#225;n visibles en la
p&#225;gina de configuraci&#243;n inicial. Consulte <a href="federation.fsserviceproviderhostedprofile.html">Para modificar atributos de un proveedor de servicios alojado en una entidad de proveedores</a>.</p>
<hr>
<ol>
<li><b>Proporcione informaci&#243;n para los atributos comunes.</b><p>Los atributos comunes contienen valores que definen generalmente el propio proveedor de
identidades.</p><dl><dt>Descripci&#243;n</dt>
<dd><p>El valor de este atributo es la descripci&#243;n proporcionada al crear la entidad. Puede modificar la descripci&#243;n introducida originalmente y agregar una si no hay ninguna.</p></dd>
<dt>Enumeraci&#243;n de compatibilidad de protocolos</dt>
<dd><p>Seleccione la versi&#243;n del Marco de federaci&#243;n de identidades Liberty (ID-FF de Liberty) de Liberty Alliance Project admitida por esta entidad.</p>
<ul><li><p><tt>urn:liberty:iff:2003-08</tt> hace referencia a la versi&#243;n 1.2 de ID-FF de Liberty.</p></li>
<li><p><tt>urn:liberty:iff:2002-12</tt> hace referencia a la versi&#243;n 1.1 de ID-FF de Liberty.</p></li></ul>
</dd>
</dl>
</li>
<li><b>Seleccione cualquiera de los c&#237;rculos de confianza disponibles para asignarlo al proveedor.</b><p>Un proveedor puede pertenecer a uno o varios c&#237;rculos de confianza. Sin
embargo, un proveedor sin un c&#237;rculo de confianza especificado no puede participar
en las comunicaciones basadas en las especificaciones de Liberty Alliance Project. Si
no se ha creado ning&#250;n c&#237;rculo de confianza, puede definir este atributo
m&#225;s adelante.</p></li>
<li><b>Proporcione informaci&#243;n para los atributos de proveedores de servicios.</b><p>Los atributos de proveedores de servicios definen informaci&#243;n general acerca del proveedor
de servicios.</p><dl><dt>URL de consumidor de aserci&#243;n</dt>
<dd><p>Escriba una URL al punto final en el que se recibir&#225;n y procesar&#225;n todas las aserciones SAML enviadas al proveedor de servicios.</p></dd>
<dt>Id. de URL de servicio de consumidor de aserci&#243;n</dt>
<dd><p>Si el atributo com&#250;n Enumeraci&#243;n de compatibilidad de protocolos es <tt>urn:liberty:iff:2003-08</tt>, escriba el Id. necesario.</p></dd>
<dt>Establecer la URL del servicio de consumidor de aserci&#243;n como predeterminada</dt>
<dd><p>Marque la casilla para utilizar la direcci&#243;n URL del servicio del consumidor de aserciones como valor predeterminado si no se especifica ning&#250;n identificador en la solicitud.</p></dd>
</dl>
</li>
<li><b>Proporcione informaci&#243;n para los atributos de configuraci&#243;n de Federated Access Manager.</b><p>Los atributos de configuraci&#243;n de Access Manager definen la informaci&#243;n sobre esta
instancia alojada de Access Manager.</p><dl><dt>URL de proveedor</dt>
<dd><p>Escriba la URL del proveedor alojado localmente.</p></dd>
<dt>Alias del proveedor</dt>
<dd><p>El alias del proveedor es un nombre utilizado para identificar el proveedor alojado en el perfil de entidad al que pertenece. Define si se trata de una configuraci&#243;n de proveedor de servicios o de proveedor de identidades. Este valor debe ser exclusivo y puede representarse en forma de URL. Por ejemplo, <tt>sunAlias</tt>.</p></dd>
<dt>Tipo de autenticaci&#243;n</dt>
<dd><p>Seleccione el tipo de proveedor que debe utilizarse para las solicitudes de autenticaci&#243;n procedentes de un proveedor alojado localmente.</p>
<ul><li><p><b>Local</b> significa que el proveedor alojado localmente se pondr&#225; en contacto con un proveedor de identidades local tras recibir una solicitud de autenticaci&#243;n (b&#225;sicamente, &#233;l mismo).</p></li>
<li><p><b>Remoto</b> significa que el proveedor alojado localmente se pondr&#225; en contacto con un proveedor de identidades remoto tras recibir una solicitud de autenticaci&#243;n.</p></li></ul>
</dd>
<dt>Contexto de autenticaci&#243;n predeterminado</dt>
<dd><p>Seleccione la clase de contexto de autenticaci&#243;n (m&#233;todo de autenticaci&#243;n que utilizar&#225; este proveedor de identidades si la informaci&#243;n no se recibe como parte de una solicitud del proveedor de servicios. Este valor tambi&#233;n especifica la clase de contexto de autenticaci&#243;n que se utilizar&#225; cuando un usuario desconocido intente acceder a un recurso protegido del proveedor de servicios y &#233;ste env&#237;e una solicitud de autenticaci&#243;n. Las opciones son:</p>
<ul><li><p>Password (Contrase&#241;a)</p></li>
<li><p>ID digital m&#243;vil</p></li>
<li><p>Smartcard (Tarjeta inteligente)</p></li>
<li><p>Smartcard-PKI (Tarjeta inteligente - PKI)</p></li>
<li><p>MobileUnregistered (M&#243;vil no registrado)</p></li>
<li><p>Software-PKI (Software - PKI)</p></li>
<li><p>Previous-Session (Sesi&#243;n previa)</p></li>
<li><p>Contrato m&#243;vil</p></li>
<li><p>Time-Sync-Token (Token de sincronizaci&#243;n de tiempo)</p></li>
<li><p>Password-ProtectedTransport (Transporte protegido con contrase&#241;a)</p></li></ul>
</dd>
<dt>Implementaci&#243;n del identificador de nombre</dt>
<dd><p>Este campo define la clase que utilizar&#225; un proveedor de servicios para participar en el registro de nombres. El registro de nombres es un perfil mediante el que los proveedores de servicios especifican el identificador del nombre de un principal que un proveedor de identidades utilizar&#225; cuando se comunique con el proveedor de servicios. El valor es <tt>com.sun.identity.</tt><tt>federation.services.</tt><tt>util.FSNameIdentifierImpl </tt> .</p></dd>
<dt>URL de p&#225;gina principal</dt>
<dd><p>Escriba la URL de la p&#225;gina principal del proveedor alojado localmente.</p></dd>
<dt>URL de redirecci&#243;n por fallo de inicio de sesi&#243;n &#250;nico</dt>
<dd><p>Escriba la URL a la que se redirigir&#225; un principal si falla un inicio de sesi&#243;n &#250;nico.</p></dd>
</dl>
</li>
<li><b>Haga clic en Aceptar para agregar el proveedor a la entidad.</b></li>
<li><b>Seleccione otra opci&#243;n del men&#250; Ver para continuar con la configuraci&#243;n de
la entidad o haga clic en Guardar para completar la configuraci&#243;n.</b></li></ol>
<br/>

</body>
</html>
