<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para crear un nuevo c&#237;rculo de confianza - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.createcot"></a><h4>Para crear un nuevo c&#237;rculo de confianza</h4><a name="indexterm-56"></a><p>Siga este procedimiento para crear un nuevo c&#237;rculo de confianza. El punto
de partida es Nuevo c&#237;rculo de confianza en la interfaz Federaci&#243;n.</p><ol>
<li><b>Haga clic en Nuevo para mostrar los atributos del c&#237;rculo de confianza.</b><p>Se muestra la p&#225;gina del perfil del nuevo c&#237;rculo de confianza.</p></li>
<li><b>Escriba el nombre del c&#237;rculo de confianza.</b></li>
<li><b>Escriba una descripci&#243;n del c&#237;rculo de confianza en el campo Descripci&#243;n.</b></li>
<li><b>Escriba un valor para la direcci&#243;n URL del servicio de escritor de
IDFF.</b><p>La direcci&#243;n URL del servicio de escritor de IDFF especifica la ubicaci&#243;n
del servlet que escribe la cookie del dominio com&#250;n. Utilice el formato
<tt>http://</tt><i> common-domain-host</i><tt> :</tt><i>port</i><tt>/common/idffwriter </tt>.</p></li>
<li><b>Escriba un valor para la direcci&#243;n URL del servicio de lector de
IDFF.</b><p>La direcci&#243;n URL del servicio de lector de IDFF especifica la ubicaci&#243;n
del servlet que lee la cookie del dominio com&#250;n. Utilice el formato
<tt>http://</tt><i> common-domain-host</i><tt> :</tt><i>port</i><tt>/common/idffreader </tt>.</p></li>
<li><b>Escriba un valor para la direcci&#243;n URL del servicio de escritor de
SAML2.</b><p>Este atributo especifica la ubicaci&#243;n del servicio de escritor de SAML2 que
escribe la cookie en el dominio com&#250;n. Utilice el formato <tt>http://</tt><i> common-domain-host</i><tt> :</tt><i>port</i><tt>/common/saml2writer </tt>.</p></li>
<li><b>Escriba un valor para la direcci&#243;n URL del servicio de lector de
SAML2.</b><p>Este atributo especifica la ubicaci&#243;n del servicio de lector de SAML2 que
lee la cookie desde el dominio com&#250;n. Utilice el formato <tt>http://</tt><i> common-domain-host</i><tt> :</tt><i>port</i><tt>/common/saml2reader </tt>.</p></li>
<li><b>Seleccione Activo o Inactivo.</b><p>El estado predeterminado es &#8220;Activo&#8221; (Active). Si selecciona Inactivo, se deshabilita la
comunicaci&#243;n dentro del dominio de autenticaci&#243;n.</p></li>
<li><b>Seleccione el dominio en el que se crear&#225; el c&#237;rculo de confianza.
</b></li>
<li><b>Elija uno o varios de los proveedores disponibles y haga clic en
la flecha Agregar para seleccionarlos.</b><p>La lista proporcionada contiene los nombres de las entidades creadas y rellenadas
con proveedores. Para obtener m&#225;s informaci&#243;n, consulte <a href="federation.fsauthdomainsselectprovider.html">Para agregar proveedores a un c&#237;rculo de confianza</a>.</p></li>
<li><b>Haga clic en "Aceptar" para completar la configuraci&#243;n.</b><p>El nuevo c&#237;rculo de confianza se muestra en la lista de c&#237;rculos
de confianza.</p></li></ol>
<br/>

</body>
</html>
