<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Introducci&#243;n - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="intro"></a><h3>Introducci&#243;n</h3>
<p>Sun impide el acceso no autorizado a las aplicaciones de servicios web
y al contenido web. OpenSSO integra servicios de autenticaci&#243;n y autorizaci&#243;n, agentes
de directivas y federaci&#243;n de identidades para proporcionar una completa soluci&#243;n que
permita proteger los recursos de red.</p><p>Un gran n&#250;mero de empresas conceden acceso a la informaci&#243;n en funci&#243;n
de cada aplicaci&#243;n. Por ejemplo, es posible que un empleado tenga que
configurar un nombre de usuario y una contrase&#241;a para acceder al sitio
Web de administraci&#243;n de las prestaciones sanitarias de la empresa. El mismo
empleado debe utilizar un nombre de usuario y una contrase&#241;a diferentes para
acceder a los formularios en l&#237;nea del departamento de contabilidad. En la
misma empresa, un cliente debe configurar un nombre de usuario y una
contrase&#241;a para acceder a la zona p&#250;blica del sitio Web de la
compa&#241;&#237;a. En cada sitio Web o servicio, un administrador debe convertir la
informaci&#243;n introducida por el usuario de la empresa a un formato de
datos que el servicio pueda reconocer. Se deben proporcionar datos para cada
servicio agregado a la empresa y realizar su mantenimiento de forma independiente.</p><p>OpenSSO reduce los costes administrativos y elimina la informaci&#243;n de usuario redundante
asociada a las soluciones por aplicaci&#243;n, a la vez que permite al
administrador asignar reglas y directivas espec&#237;ficas que controlen la informaci&#243;n o los
servicios a los que el usuario puede acceder. Los agentes de pol&#237;ticas
se implementan en la aplicaci&#243;n o servidores Web para procesar las solicitudes
HTTP e imponer el cumplimiento de las pol&#237;ticas actuales. Adem&#225;s, la informaci&#243;n
del usuario y las pol&#237;ticas de acceso asociadas conforman la identidad empresarial
del usuario. OpenSSO permite a un usuario acceder a un gran n&#250;mero
de recursos de la empresa con s&#243;lo una identidad.</p>
<br/>

</body>
</html>
