<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para agregar un proveedor de respuesta a una pol&#237;tica - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="policy.responseprovideradd"></a><h5>Para agregar un proveedor de respuesta a una pol&#237;tica</h5>
<ol>
<li><b><a name="indexterm-42"></a>Si ya ha creado la pol&#237;tica, haga clic en el nombre de
la pol&#237;tica para la que desea agregar el proveedor de respuesta. Si
a&#250;n no la ha creado, consulte <a href="policy.policynormaladd.html">Para crear una pol&#237;tica normal nueva</a>.</b></li>
<li><b>En la lista de proveedores de respuesta, haga clic en Nuevo.</b></li>
<li><b>Introduzca un nombre para el proveedor de respuesta.</b></li>
<li><b>Defina los siguientes valores:</b><dl><dt>Atributo est&#225;tico</dt>
<dd><p>Son atributos est&#225;ticos con el formato de valor de atributo que se ha definido en una instancia de <tt>IDResponseProvider</tt> almacenada en la directiva.</p></dd>
<dt>Atributo din&#225;mico</dt>
<dd><p>Los atributos de respuesta seleccionados aqu&#237; deben definirse primero en el <a href="service.scpolicy.html">Configuraci&#243;n de pol&#237;ticas</a> del dominio correspondiente. Los nombres de atributos definidos deben ser un subconjunto de los existentes en el almac&#233;n de datos configurado (ID Repository). Para obtener informaci&#243;n sobre c&#243;mo definir los atributos, consulte las definiciones de los atributos de configuraci&#243;n de pol&#237;ticas. Para seleccionar varios atributos o atributos espec&#237;ficos, mantenga pulsada la tecla Control y haga clic con el bot&#243;n izquierdo del rat&#243;n.</p></dd>
</dl>
</li>
<li><b>Haga clic en Finalizar (Finish).</b></li>
<li><b>Para suprimir un proveedor de respuesta de una pol&#237;tica, seleccione el asunto
y haga clic en Delete (Eliminar). Puede editar cualquier definici&#243;n de proveedor
de respuesta haciendo clic en su nombre.</b></li></ol>
<br/>

</body>
</html>
