<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@14981-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=iso-8859-1">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Atributos del complemento de repositorio LDAPv3
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="realm.idrepoadd"></A><h3>Atributos del complemento de repositorio LDAPv3</h3>
<p><A NAME="indexterm-13"></A>Los siguientes atributos se utilizan para configurar un complemento de repositorio LDAPv3:</p>
<ul><li><p><A HREF="realm.idrepoadd.html#fyfdo">Servidor LDAP principal</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdt">DN de conexi&oacute;n de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfds">Contrase&ntilde;a de conexi&oacute;n de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdu">Contrase&ntilde;a de conexi&oacute;n de LDAP (confirmar)</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdv">DN de organizaci&oacute;n de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdw">Habilitar LDAP SSL</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfej">Tama&ntilde;o m&iacute;nimo de grupo de conexi&oacute;n LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfee">Tama&ntilde;o m&aacute;ximo de grupo de conexi&oacute;n LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdx">N&uacute;mero m&aacute;ximo de resultados de b&uacute;squeda</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfen">Tiempo de espera de b&uacute;squeda</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfdz">LDAP sigue la referencia</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffh">Nombre de clase de complemento de repositorio LDAPv3</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfeu">Asignaci&oacute;n de nombre de atributo</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffb">Operaciones y tipos de complementos compatibles de LDAPv3</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffj">Atributo de b&uacute;squeda de usuarios de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfeo">Filtro de b&uacute;squeda de usuarios de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffi">Clase de objeto de usuario LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfez">Atributos de usuarios de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfeb">Atributo de b&uacute;squeda de grupos de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfep">Filtro de b&uacute;squeda de grupos de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfed">Atributo de asignaci&oacute;n de nombre de contenedor de grupos LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfec">Valor de contenedor de grupos LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffc">Clase de objeto de grupos LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfff">Atributos de grupos de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfea">Nombre de atributo para la condici&oacute;n de miembro de grupo</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfes">Nombre de atributo de miembro de grupo</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfev">Nombre de atributo de URL de miembro de grupo</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfem">Atributo de asignaci&oacute;n de nombre de contenedor de personas LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffe">Valor de contenedor de personas LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffk">Atributo de b&uacute;squeda de agentes de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffl">Atributo de asignaci&oacute;n de nombre de contenedor de agentes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffa">Valor de contenedor de agentes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffd">Filtro de b&uacute;squeda de agentes de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfey">Clase de objeto de agentes LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfew">Atributos de agentes de LDAP</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfef">DN base de b&uacute;squeda persistente</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffz">Tiempo de inactividad m&aacute;ximo de b&uacute;squeda persistente antes de reiniciar</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfgh">N&uacute;mero m&aacute;ximo de intentos tras los c&oacute;digos de error</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyfge">El tiempo de retardo entre los intentos</A></p>
</li>
<li><p><A HREF="realm.idrepoadd.html#fyffr">C&oacute;digos de error de excepci&oacute;n LDAP para seguir intentando</A></p>
</li>
</ul>
<A NAME="fyfdo"></A><h4>Servidor LDAP principal</h4>
<p>Introduzca el nombre del servidor LDAP con el que establecer&aacute; conexi&oacute;n. Deber&iacute;a tener el siguiente formato, <tt>hostname.domainname:portnumber</tt>. </p>
<p>Si se introducen varias entradas de <tt>host:portnumber</tt>, se intentar&aacute; conectar con el primer host de la lista. Si este primer intento falla, se utilizar&aacute; la siguiente entrada de la lista.</p>
<A NAME="fyfdt"></A><h4>DN de conexi&oacute;n de LDAP</h4>
<p>Especifica el nombre DN que utilizar&aacute; Access Manager para autenticarse en el servidor LDAP al que est&aacute; conectado actualmente. El usuario con el nombre DN utilizado para la conexi&oacute;n debe disponer de los privilegios de adici&oacute;n, modificaci&oacute;n y eliminaci&oacute;n correctos, configurados en el atributo <A HREF="realm.idrepoadd.html#fyffb">Operaciones y tipos de complementos compatibles de LDAPv3</A>.</p>
<A NAME="fyfds"></A><h4>Contrase&ntilde;a de conexi&oacute;n de LDAP</h4>
<p>Especifica la contrase&ntilde;a DN que utilizar&aacute; Access Manager para autenticarse en el servidor LDAP al que est&aacute; conectado actualmente.</p>
<A NAME="fyfdu"></A><h4>Contrase&ntilde;a de conexi&oacute;n de LDAP (confirmar)</h4>
<p>Confirme la contrase&ntilde;a.</p>
<A NAME="fyfdv"></A><h4>DN de organizaci&oacute;n de LDAP</h4>
<p>El DN al que se asignar&aacute; este repositorio de almac&eacute;n de datos. Se trata del DN base de todas las operaciones realizadas en este almac&eacute;n de datos. </p>
<A NAME="fyfdw"></A><h4>Habilitar LDAP SSL</h4>
<p>Si se habilita esta opci&oacute;n, Access Manager se conectar&aacute; al servidor principal con el protocolo HTTPS.</p>
<A NAME="fyfej"></A><h4>Tama&ntilde;o m&iacute;nimo de grupo de conexi&oacute;n LDAP</h4>
<p>Especifica el n&uacute;mero inicial de conexiones del grupo de conexi&oacute;n. Si se utiliza el grupo de conexi&oacute;n, no es necesario crear una conexi&oacute;n de forma individual. </p>
<A NAME="fyfee"></A><h4>Tama&ntilde;o m&aacute;ximo de grupo de conexi&oacute;n LDAP</h4>
<p>Especifica el n&uacute;mero m&aacute;ximo de conexiones que se permitir&aacute;.</p>
<A NAME="fyfdx"></A><h4>N&uacute;mero m&aacute;ximo de resultados de b&uacute;squeda</h4>
<p>Especifica el n&uacute;mero m&aacute;ximo de entradas devueltas por una operaci&oacute;n de b&uacute;squeda. Si se alcanza este l&iacute;mite, Directory Server devuelve las entradas que coincidan con la solicitud de b&uacute;squeda.</p>
<A NAME="fyfen"></A><h4>Tiempo de espera de b&uacute;squeda</h4>
<p>Especifica el n&uacute;mero m&aacute;ximo de segundos asignado a la solicitud de b&uacute;squeda. Si se alcanza este l&iacute;mite, Directory Server devuelve las entradas de b&uacute;squeda que coincidan con la solicitud de b&uacute;squeda.</p>
<A NAME="fyfdz"></A><h4>LDAP sigue la referencia</h4>
<p>Si se habilita, esta opci&oacute;n indica que se seguir&aacute;n autom&aacute;ticamente las referencias a otros servidores LDAP.</p>
<A NAME="fyffh"></A><h4>Nombre de clase de complemento de repositorio LDAPv3</h4>
<p>Especifica la ubicaci&oacute;n del archivo de clase que implementa el repositorio LDAPv3.</p>
<A NAME="fyfeu"></A><h4>Asignaci&oacute;n de nombre de atributo</h4>
<p>Permite asignar los atributos comunes reconocidos por la estructura al almac&eacute;n de datos nativo. Por ejemplo, si la estructura utiliza <tt>inetUserStatus </tt> para determinar el estado del usuario, es posible que el almac&eacute;n de datos nativo use realmente <tt>userStatus</tt>. Las definiciones de atributos distinguen entre may&uacute;sculas y min&uacute;sculas.</p>
<A NAME="fyffb"></A><h4>Operaciones y tipos de complementos compatibles de LDAPv3</h4>
<p>Especifica las operaciones permitidas o que pueden realizadas en este servidor LDAP. Este complemento de repositorio LDAPv3 s&oacute;lo admite las operaciones predeterminadas. A continuaci&oacute;n, se muestran las operaciones admitidas por el complemento de repositorio LDAPv3:</p>
<ul><li><p>grupo: lectura, creaci&oacute;n, edici&oacute;n y eliminaci&oacute;n.</p>
</li>
<li><p>dominio: lectura, creaci&oacute;n, edici&oacute;n, eliminaci&oacute;n y servicio.</p>
</li>
<li><p>usuario: lectura, creaci&oacute;n, edici&oacute;n, eliminaci&oacute;n y servicio.</p>
</li>
<li><p>agente: lectura, creaci&oacute;n, edici&oacute;n y eliminaci&oacute;n.</p>
</li>
</ul>
<p>Puede eliminar permisos </p>
<p>de los indicados anteriormente en funci&oacute;n de las tareas y la configuraci&oacute;n del servidor LDAP, pero no puede agregar permisos adicionales.</p>
<A NAME="fyffj"></A><h4>Atributo de b&uacute;squeda de usuarios de LDAP</h4>
<p>Este campo define el tipo de atributo mediante el que se realiza la b&uacute;squeda en un usuario. Por ejemplo, si el DN de usuario es <tt>uid=user1,ou=people,dc=iplanet,dc=com </tt>, el atributo de asignaci&oacute;n de nombre es <tt>uid</tt>. </p>
<A NAME="fyfeo"></A><h4>Filtro de b&uacute;squeda de usuarios de LDAP</h4>
<p>Especifica el filtro de b&uacute;squeda que se va a utilizar para encontrar las entradas de usuario.</p>
<A NAME="fyffi"></A><h4>Clase de objeto de usuario LDAP</h4>
<p>Especifica las clases de objeto de un usuario. Al crear un usuario, la lista de clases de objeto se agregar&aacute; a la lista de atributos del usuario.</p>
<A NAME="fyfez"></A><h4>Atributos de usuarios de LDAP</h4>
<p>Define la lista de atributos asociados al usuario. No se permite leer o escribir atributos de usuario que no se encuentren en la lista. Los atributos distinguen entre may&uacute;sculas y min&uacute;sculas. Las clases de objeto y el esquema de atributo deben definirse en Directory Server antes que en esta opci&oacute;n.</p>
<A NAME="fyfeb"></A><h4>Atributo de b&uacute;squeda de grupos de LDAP</h4>
<p>Este campo define el tipo de atributo mediante el que se realiza la b&uacute;squeda en un grupo. El valor predeterminado es <tt>cn</tt>.</p>
<A NAME="fyfep"></A><h4>Filtro de b&uacute;squeda de grupos de LDAP</h4>
<p>Especifica el filtro de b&uacute;squeda que se va a utilizar para encontrar las entradas de grupo. El valor predeterminado es <tt>(objectclass=groupOfUniqueNames)</tt>.</p>
<A NAME="fyfed"></A><h4>Atributo de asignaci&oacute;n de nombre de contenedor de grupos LDAP</h4>
<p>Especifica el atributo de asignaci&oacute;n de nombre de un contenedor de grupos, siempre que el grupo resida en un contenedor. De lo contrario, este atributo se deja vac&iacute;o. Por ejemplo, si el DN de grupo de <tt>cn=group1,ou=groups,dc=iplanet,dc=com</tt> reside en <tt>ou=groups</tt>, el atributo de asignaci&oacute;n de nombre del contenedor de grupos es <tt>ou</tt>.</p>
<A NAME="fyfec"></A><h4>Valor de contenedor de grupos LDAP</h4>
<p>Especifica el valor del contenedor de grupos. Por ejemplo, si el DN de grupo de <tt>cn=group1,ou=groups,dc=iplanet,dc=com</tt> reside en el nombre de contenedor <tt>ou=groups</tt>, el valor del contenedor de grupos ser&aacute; <tt>groups</tt>. </p>
<A NAME="fyffc"></A><h4>Clase de objeto de grupos LDAP</h4>
<p>Especifica las clases de objeto de grupos. Al crear un grupo, la lista de clases de objeto se agregar&aacute; a la lista de atributos del grupo.</p>
<A NAME="fyfff"></A><h4>Atributos de grupos de LDAP</h4>
<p>Define la lista de atributos asociados al grupo. No se permite leer o escribir atributos de grupo que no se encuentren en la lista. Los atributos distinguen entre may&uacute;sculas y min&uacute;sculas. Las clases de objeto y el esquema de atributo deben definirse en Directory Server antes que en esta opci&oacute;n.</p>
<A NAME="fyfea"></A><h4>Nombre de atributo para la condici&oacute;n de miembro de grupo</h4>
<p>Especifica el nombre del atributo cuyos valores son los nombres de todos los grupos a los que pertenece el DN. El valor predeterminado es <tt>memberOf</tt>. </p>
<A NAME="fyfes"></A><h4>Nombre de atributo de miembro de grupo</h4>
<p>Especifica el nombre del atributo cuyos valores consisten en un DN perteneciente a este grupo. El valor predeterminado es <tt>uniqueMember</tt>.</p>
<A NAME="fyfev"></A><h4>Nombre de atributo de URL de miembro de grupo</h4>
<p>Especifica el nombre del atributo cuyo valor es una direcci&oacute;n URL de LDAP que representa a miembros pertenecientes a este grupo. El valor predeterminado es <tt> memberUrl</tt>.</p>
<A NAME="fyfem"></A><h4>Atributo de asignaci&oacute;n de nombre de contenedor de personas LDAP</h4>
<p>Especifica el atributo de asignaci&oacute;n de nombre de un contenedor de personas, siempre que el usuario resida en este tipo de contenedor. De lo contrario, este campo se deja en blanco. </p>
<A NAME="fyffe"></A><h4>Valor de contenedor de personas LDAP</h4>
<p>Especifica el valor del contenedor de personas. El valor predeterminado es <tt> people</tt>.</p>
<A NAME="fyffk"></A><h4>Atributo de b&uacute;squeda de agentes de LDAP</h4>
<p>Este campo define el tipo de atributo mediante el que se realiza la b&uacute;squeda en un agente. El valor predeterminado es <tt>uid</tt>.</p>
<A NAME="fyffl"></A><h4>Atributo de asignaci&oacute;n de nombre de contenedor de agentes LDAP</h4>
<p>Especifica el atributo de asignaci&oacute;n de nombre del contenedor de agente, siempre que el agente resida en un contenedor de este tipo. De lo contrario, este campo se deja en blanco.</p>
<A NAME="fyffa"></A><h4>Valor de contenedor de agentes LDAP</h4>
<p>Especifica el valor del contenedor de agentes. El valor predeterminado es <tt> agents</tt>.</p>
<A NAME="fyffd"></A><h4>Filtro de b&uacute;squeda de agentes de LDAP</h4>
<p>Define el filtro utilizado en la b&uacute;squeda de un agente. El atributo de b&uacute;squeda de agentes de LDAP se especifica al principio de este campo para formar el filtro de b&uacute;squeda del agente actual. </p>
<p>Por ejemplo, si el atributo de b&uacute;squeda de agentes de LDAP es <tt>uid</tt> y el filtro de b&uacute;squeda de agentes de LDAP es <tt>(objectClass=sunIdentityServerDevice) </tt>, el filtro de b&uacute;squeda de usuarios real ser&aacute;: <tt>(&amp;(uid=*)(objectClass=sunIdentityServ erDevice))</tt></p>
<A NAME="fyfey"></A><h4>Clase de objeto de agentes LDAP</h4>
<p>Especifica las clases de objeto de agentes. Al crear un agente, la lista de clases de objeto se agregar&aacute; a la lista de atributos del agente.</p>
<A NAME="fyfew"></A><h4>Atributos de agentes de LDAP</h4>
<p>Define la lista de atributos asociados al agente. No se permite leer o escribir atributos de agente que no se encuentren en la lista. Los atributos distinguen entre may&uacute;sculas y min&uacute;sculas. Las clases de objeto y el esquema de atributo deben definirse en Directory Server antes que en esta opci&oacute;n.</p>
<A NAME="fyfef"></A><h4>DN base de b&uacute;squeda persistente</h4>
<p>Define el DN base utilizado para la b&uacute;squeda persistente. Algunos servidores LDAPv3 s&oacute;lo admiten la b&uacute;squeda persistente en el nivel del sufijo ra&iacute;z.</p>
<A NAME="fyffz"></A><h4>Tiempo de inactividad m&aacute;ximo de b&uacute;squeda persistente antes de reiniciar</h4>
<p>Define el tiempo de inactividad m&aacute;ximo antes de reiniciar la b&uacute;squeda persistente. Este valor debe ser superior a 1. Si es inferior o igual a 1, se reiniciar&aacute; la b&uacute;squeda, independientemente del tiempo de inactividad de la conexi&oacute;n especificado.</p>
<p>Si Access Manager se implementa con un equilibrador de carga, se agotar&aacute; el tiempo de espera de algunos de los equilibradores cuando haya permanecido inactivo durante un periodo de tiempo especificado. En este caso, deber&iacute;a definir el Tiempo de inactividad m&aacute;ximo de b&uacute;squeda persistente antes de reiniciar con un valor inferior al tiempo especificado para el equilibrador de carga. </p>
<A NAME="fyfgh"></A><h4>N&uacute;mero m&aacute;ximo de intentos tras los c&oacute;digos de error</h4>
<p>Define el n&uacute;mero m&aacute;ximo de reintentos para la operaci&oacute;n de b&uacute;squeda persistente si se encuentran los c&oacute;digos de error especificados en C&oacute;digos de error de excepci&oacute;n LDAP para seguir intentando.</p>
<A NAME="fyfge"></A><h4>El tiempo de retardo entre los intentos</h4>
<p>Especifica el tiempo que se debe esperar antes de cada reintento. Esta opci&oacute;n s&oacute;lo se aplica a la conexiones de b&uacute;squeda persistente.</p>
<A NAME="fyffr"></A><h4>C&oacute;digos de error de excepci&oacute;n LDAP para seguir intentando</h4>
<p>Especifica los c&oacute;digos de error que provocan que se vuelva a intentar una operaci&oacute;n de b&uacute;squeda persistente. Este atributo s&oacute;lo es v&aacute;lido para la b&uacute;squeda persistente y no para todas las operaciones de LDAP.</p>

<br />

</body>
</html>
