<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para crear una nueva instancia del servidor - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.serveradd"></a><h4>Para crear una nueva instancia del servidor</h4><p>Se crea autom&#225;ticamente una entrada para cada servidor en la lista de
servidores cuando se ejecuta el configurador de OpenSSO para la configuraci&#243;n del
servidor. En condiciones normales, estos pasos no deber&#237;an ser necesarios.</p><ol>
<li><b>Inicie una sesi&#243;n en la consola de OpenSSO como administrador de nivel
superior.</b></li>
<li><b>Haga clic en la ficha Configuraci&#243;n y, a continuaci&#243;n, en Sitios y
servidores.</b></li>
<li><b>Haga clic en Nuevo en la lista de servidores.</b></li>
<li><b>Introduzca el nombre de dominio completo (FQDN) del servidor que desee agregar
y haga clic en Aceptar.</b><p>El FQDN debe tener el formato <tt>http</tt><i> (s)</i><tt>://</tt><i>host.dominio</i><tt>:</tt><i>puerto </i><tt>/</tt><i>uri</i><tt></tt>.</p></li>
<li><b>La instancia del servidor reci&#233;n creada aparecer&#225; en la lista.</b></li>
<li><b>Para editar el servidor, haga clic en su nombre. Aparecer&#225;n los atributos
de configuraci&#243;n que puede personalizar.</b><p>La configuraci&#243;n predeterminada del servidor hace referencia a los valores predeterminados de
las instancias del servidor. Cada instancia del servidor debe tener un conjunto
m&#237;nimo de valores de propiedades. La mayor&#237;a de los valores de propiedades
pueden ser iguales en todas las instancias del servidor en funci&#243;n de
su implementaci&#243;n.  Esta configuraci&#243;n le permite introducir las propiedades b&#225;sicas en
una ubicaci&#243;n sin necesidad de cambiarlas para cada instancia del servidor adicional.
</p><p>Estos valores predeterminados se pueden sobrescribir. Para ello, haga clic en el
bot&#243;n Configuraci&#243;n de la herencia, ubicado en la parte superior de la
p&#225;gina del perfil de la instancia del servidor. Despu&#233;s de hacer clic
en este bot&#243;n, la consola muestra una p&#225;gina en la que puede
seleccionar (o anular la selecci&#243;n de) los valores que se van a
heredar o sobrescribir. </p></li></ol>
<br/>

</body>
</html>
