<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Seguridad - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.servereditsecurity"></a><h4>Seguridad</h4>
<p>Los atributos de seguridad definen la informaci&#243;n de cifrado, validaci&#243;n y cookies
utilizada para controlar el nivel de seguridad de la instancia del servidor.</p>

<a name="ggkbi"></a><h5>Cifrado</h5>
<p>Los atributos de cifrado son:</p>

<a name="ggkcb"></a><h5>Clave de cifrado de contrase&#241;a</h5>
<p>Especifica la clave utilizada para cifrar y descifrar las contrase&#241;as, y se
almacena en la configuraci&#243;n del sistema de administraci&#243;n de servicios. Este valor
se establece durante la instalaci&#243;n. Ejemplo: <tt>dSB9LkwPCSoXfIKHVMhIt3bKgibtsggd </tt></p>

<a name="ggkbg"></a><h5>Secreto compartido del servicio de autenticaci&#243;n</h5>
<p>El secreto compartido del m&#243;dulo de autenticaci&#243;n de la aplicaci&#243;n. Este valor
se establece durante la instalaci&#243;n. Ejemplo: <tt>AQICPX9e1cxSxB2RSy1WG1+O4msWpt/6djZl </tt></p>

<a name="ggkbd"></a><h5>Clase de cifrado</h5>
<p>El valor predeterminado es <tt>com.iplanet.services.util.JCEEncryption</tt>. Especifica la implementaci&#243;n de la clase de
cifrado. Las clases disponibles son: <tt> com.iplanet.services.util.JCEEncryption</tt> y <tt>com.iplanet.services.util.JSSEncryption </tt>.</p>

<a name="ggkby"></a><h5>Clase de f&#225;brica aleatoria de seguridad</h5>
<p>El valor predeterminado es <tt>com.iplanet.am.util.JSSSecureRandomFactoryImp </tt>l. Especifica el nombre de clase de f&#225;brica
para <tt>SecureRandomFactory </tt>. Las clases de implementaci&#243;n disponibles son: <tt>com.iplanet.am.util.JSSSecureRandomFactoryImpl </tt> que utiliza JSS,
y <tt>com.iplanet.am.util.SecureRandomFactoryImpl </tt> que utiliza Java puro.   </p>

<a name="ggkbr"></a><h5>Validaci&#243;n</h5>
<p>Los atributos de validaci&#243;n son:</p>

<a name="ggkay"></a><h5>Comunicaciones de nivel bajo de la plataforma Max. Longitud del contenido</h5>
<p>El valor predeterminado es 16.384 &#243; 16.000. Especifica la longitud m&#225;xima del
contenido de la solicitud HTTP (<tt>HttpRequest</tt>) que aceptar&#225; OpenSSO.</p>

<a name="ggkbb"></a><h5>Comprobaci&#243;n de la direcci&#243;n IP del cliente</h5>
<p>El valor predeterminado es NO.  Especifica si se debe comprobar o
no la direcci&#243;n IP del cliente en todas las creaciones o validaciones
de <tt>SSOToken</tt>.</p>

<a name="ggkba"></a><h5>Cookie</h5>
<p>Los atributos de cookies son:</p>

<a name="ggkad"></a><h5>Nombre del cookie</h5>
<p>El valor predeterminado es <tt>iPlanetDirectoryPro</tt>. El nombre de la cookie utilizada por
el servicio de autenticaci&#243;n para establecer el Id. de controlador de sesi&#243;n
v&#225;lido. El valor de este nombre de cookie se utiliza para recuperar
la informaci&#243;n de sesi&#243;n v&#225;lida.</p>

<a name="ggkaw"></a><h5>Cookie segura</h5>
<p>Permite establecer la cookie de OpenSSO en un modo seguro en el
que el navegador s&#243;lo devolver&#225; la cookie cuando se utilice un protocolo
seguro como, por ejemplo, <tt>HTTP(s)</tt>. El valor predeterminado es false. </p>

<a name="ggkbk"></a><h5>Codificar valor de cookie</h5>
<p>Esta propiedad permite a OpenSSO codificar mediante URL (<tt>URLencode</tt>) el valor de
cookie que convierte caracteres en n&#250;meros uno (1) que puede comprender el
protocolo HTTP.</p>

<a name="ggkbc"></a><h5>Almac&#233;n de claves</h5>
<p>Los siguientes atributos permiten configurar la informaci&#243;n del almac&#233;n de claves para
los servidores y sitios adicionales que cree:</p>

<a name="ggkbj"></a><h5>Archivo del almac&#233;n de claves</h5>
<p>Este valor se establece durante la instalaci&#243;n. Ejemplo: <tt></tt><i>OpenSSO-base </i><tt>/</tt><i>server_URI</i><tt>/keystore.jks</tt>. Especifica la ruta
al archivo de contrase&#241;as del almac&#233;n de claves XML de SAML.</p>

<a name="ggkbu"></a><h5>Archivo de contrase&#241;as del almac&#233;n de claves</h5>
<p>Este valor se establece durante la instalaci&#243;n. Ejemplo: <tt></tt><i>OpenSSO-base </i><tt>/</tt><i>server_URI</i><tt>/.storepass</tt>. Especifica la ruta
al archivo "storepass" de claves XML de SAML.</p>

<a name="ggkbs"></a><h5>Archivo de contrase&#241;as de claves privadas</h5>
<p>Este valor se establece durante la instalaci&#243;n. Ejemplo: <tt></tt><i>OpenSSO-base </i><tt>/</tt><i>server_URI</i><tt>/.keypass</tt> Especifica la ruta
del archivo de contrase&#241;a de claves XML de SAML.</p>

<a name="ggkaq"></a><h5>Alias de certificado</h5>
<p>El valor predeterminado es "test".</p>

<a name="ggkbw"></a><h5>Almacenamiento en cach&#233; de la lista de revocaci&#243;n de certificados</h5>
<p>Este atributo define el dep&#243;sito de almacenamiento en cach&#233; de la lista
revocaci&#243;n de certificados local (CRL) que se utiliza para conservar la CRL
de las entidades emisoras de certificados. Cualquier servicio que necesite obtener una
CRL para la validaci&#243;n de certificados recibir&#225; la CRL en funci&#243;n de
esta informaci&#243;n. </p>

<a name="ggkch"></a><h5>Nombre de host del servidor LDAP</h5>
<p>Especifica el nombre del servidor LDAP en el que se almacenan los
certificados. El valor predeterminado es el nombre de host especificado al instalar
OpenSSO. Se puede utilizar el nombre de host de cualquier servidor LDAP
en el que se hayan guardado los certificados. </p>

<a name="ggkau"></a><h5>N&#250;mero de puerto del servidor LDAP</h5>
<p>Especifica el n&#250;mero de puerto del servidor LDAP en el que se
almacenan los certificados. El valor predeterminado es el puerto especificado al instalar
OpenSSO. Se puede utilizar el puerto de cualquier servidor LDAP en el
que se hayan guardado los certificados. </p>

<a name="ggkam"></a><h5>SSL activado</h5>
<p>Especifica si se utiliza SSL para acceder al servidor LDAP. De forma
predeterminada, el servicio de autenticaci&#243;n de certificados no utiliza SSL para el
acceso LDAP.</p>

<a name="ggkbv"></a><h5>Nombre de usuario del enlace del servidor LDAP</h5>
<p>Especifica el DN de conexi&#243;n del servidor LDAP. </p>

<a name="ggkaj"></a><h5>Contrase&#241;a del enlace del servidor LDAP.</h5>
<p>Define la contrase&#241;a que se va a utilizar para la conexi&#243;n con
el servidor LDAP. La contrase&#241;a amldapuser que se introdujo durante la instalaci&#243;n
se utiliza de forma predeterminada como usuario de conexi&#243;n.</p>

<a name="ggkce"></a><h5>DN base de b&#250;squeda LDAP</h5>
<p>Este atributo especifica el DN base utilizado por el asunto de usuarios
de LDAP del servidor LDAP para comenzar la b&#250;squeda. De forma predeterminada,
es el dominio de nivel superior de la de base de instalaci&#243;n
de OpenSSO.</p>

<a name="ggkbp"></a><h5>Atributos de b&#250;squeda</h5>
<p>Se puede utilizar cualquier componente de DN del DN de asunto (<tt>subjectDN</tt>)
del emisor para recuperar una CRL de un servidor LDAP local. Es
una cadena de valores &#250;nica, como "cn". Todas las CA ra&#237;z deben
utilizar el mismo atributo de b&#250;squeda.</p>

<a name="ggkaa"></a><h5>Comprobaci&#243;n del Protocolo de estado de los certificados en l&#237;nea</h5>
<p>El protocolo de estado de los certificados en l&#237;nea (OCSP, Online Certificate
Status Protocol) permite a los servicios de OpenSSO determinar el estado (de
revocaci&#243;n) de un certificado espec&#237;fico. OCSP se puede utilizar para satisfacer algunos
de los requisitos operativos relacionados con un suministro m&#225;s oportuno de la
informaci&#243;n de revocaci&#243;n de la que es posible con las CRL. Adem&#225;s,
puede utilizarse para obtener informaci&#243;n de estado adicional. Un cliente de OCSP
emite una solicitud de estado a un contestador de OCSP y suspende
la aceptaci&#243;n del certificado en cuesti&#243;n hasta que el contestador proporcione una
respuesta. </p>

<a name="ggkal"></a><h5>Comprobaci&#243;n habilitada</h5>
<p>Este atributo habilita la comprobaci&#243;n de OCSP. Se habilita de forma predeterminada.</p>

<a name="ggkav"></a><h5>URL del contestador</h5>
<p>Este atributo define una URL que identifica la ubicaci&#243;n del contestador de
OCSP. Por ejemplo, <tt>http://ocsp.example.net:80</tt>.</p><p>De forma predeterminada, la ubicaci&#243;n del contestador de OCSP se determina impl&#237;citamente
desde el certificado que se va a validar. Esta propiedad se utiliza
cuando falta la extensi&#243;n de acceso de informaci&#243;n de la entidad emisora
(definida en RFC 3280) en el certificado o cuando es necesario anularla.
</p>

<a name="ggkai"></a><h5>Sobrenombre del certificado</h5>
<p>El sobrenombre del contestador de OCSP es el sobrenombre del certificado de
CA de ese contestador como, por ejemplo, <tt>Certificate Manager - sun</tt>.  Si se establece
esta propiedad, el certificado de CA debe estar presente en la base
de datos de certificados del servidor web. Si se establece la URL
de OCSP, tambi&#233;n debe establecerse el sobrenombre del contestador de OCSP. De
lo contrario, ambos se omitir&#225;n. Si no se establece, se utilizar&#225; la
URL del contestador de OCSP presente en el certificado del usuario para
la validaci&#243;n de OCSP. Si la URL del contestador de OCSP no
est&#225; presente en el certificado del usuario, no se realizar&#225; ninguna validaci&#243;n
de OCSP. </p>

<a name="ggkag"></a><h5>Normas federales de procesamiento de la informaci&#243;n</h5>
<p>En virtud de la ley de administraci&#243;n de tecnolog&#237;a de la informaci&#243;n
(ley de aplicaci&#243;n general 104-106), la Secretar&#237;a de comercio aprueba las normas
y directrices desarrolladas por el Instituto nacional de normas y tecnolog&#237;as (NIST)
para los sistemas inform&#225;ticos federales de EE.UU. El NIST ha emitido estas
normas y directrices como Normas federales de procesamiento de la informaci&#243;n (FIPS)
para uso gubernamental. NIST desarrolla FIPS cuando existen requisitos obligatorios por parte
del gobierno federal como, por ejemplo, en materia de seguridad o interoperabilidad,
y no hay ninguna soluci&#243;n o norma del sector aceptable. </p>

<a name="ggkap"></a><h5>Modo FIPS</h5>
<p>Esta propiedad puede establecerse en "true" (verdadero) o "false" (falso). Todas las
operaciones criptogr&#225;ficas se ejecutar&#225;n en el modo compatible con FIPS s&#243;lo se
si se ha establecido en "true" (verdadero). </p>
<br/>

</body>
</html>
