<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para configurar una descripci&#243;n de servicio - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.smdiscoverydescriptionadd"></a><h5>Para configurar una descripci&#243;n de servicio</h5>
<a name="indexterm-148"></a><a name="indexterm-149"></a><p>El atributo de descripci&#243;n de servicio define un servicio Web que se
est&#225; ejecutando en un punto final de protocolo distinto. Se define al
configurar <a href="resourceofferingsbootstrapping.html">Ofertas de recursos para bootstrapping</a>. La informaci&#243;n sobre las instancias de servicio debe comunicarse en
distintos contextos. Por ejemplo, el Servicio de detecci&#243;n definido es un servicio
de identidades que proporciona una enumeraci&#243;n de las ofertas de recursos (cada
una de las cuales incluye una descripci&#243;n de instancia de servicio).</p><ol>
<li><b>Haga clic en Add Description (Agregar descripci&#243;n) para ver los nuevos atributos
de descripci&#243;n de servicio o haga clic en Editar para modificar una
descripci&#243;n existente.</b></li>
<li><b>Proporcione los valores de los atributos seg&#250;n la siguiente informaci&#243;n:</b><dl><dt>Id. de mecanismo de seguridad</dt>
<dd><p>Este atributo permite agregar los m&#233;todos de autenticaci&#243;n admitidos por el Servicio de detecci&#243;n. Estos mecanismos de seguridad hacen referencia a la forma en la que el consumidor de servicios Web se autentica al proveedor de servicios Web o proporciona seguridad en los mensajes. De forma predeterminada est&#225;n seleccionados todos los m&#233;todos disponibles que admite la instancia de servicios. Si no se selecciona un m&#233;todo de autenticaci&#243;n y un consumidor de servicios Web env&#237;a una solicitud mediante este m&#233;todo, la solicitud ser&#225; rechazada. Consulte <a href="supportedauthmechanisms.html">Mecanismos de autenticaci&#243;n admitidos</a>.</p></dd>
<dt>URL de punto final</dt>
<dd><p>El valor de este atributo es la URL de punto final de SOAP a trav&#233;s de HTTP. El esquema del URI debe ser HTTP o HTTPS, como en <tt>https://soap.profile-provider.com/soap</tt>.</p></dd>
<dt>Acci&#243;n SOAP</dt>
<dd><p>El valor de este atributo opcional es equivalente al atributo <tt>wsdlsoap:soapAction</tt> del elemento <tt>wsdlsoap:operation</tt> de la descripci&#243;n espec&#237;fica basada en WSDL del servicio.</p></dd>
</dl>
</li>
<li><b>Haga clic en Aceptar para completar la configuraci&#243;n del servicio.</b></li>
<li><b>Haga clic en Guardar en la p&#225;gina del Servicio de detecci&#243;n para
completar la configuraci&#243;n del servicio.</b></li></ol>
<br/>

</body>
</html>
