<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>UNIX - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="service.scserviceprofile.iplanetamauthunixservice"></a><h4>UNIX</h4>
<p><a name="indexterm-182"></a>Este m&#243;dulo exclusivo de Solaris permite realizar la autenticaci&#243;n mediante la identificaci&#243;n
y la contrase&#241;a de UNIX de un usuario. Si se modifica alguno
de los atributos de autenticaci&#243;n de UNIX, se deber&#225; reiniciar tanto OpenSSO
como el asistente amunixd.  Los atributos de autenticaci&#243;n de UNIX son atributos
globales y de dominio. Los atributos son:</p>
<ul><li><p><a href="#fwbsy">Puerto de configuraci&#243;n</a></p></li>
<li><p><a href="#fwbqv">Puerto de autenticaci&#243;n</a></p></li>
<li><p><a href="#fwbrv">Tiempo de espera</a></p></li>
<li><p><a href="#fwbls">Subprocesos</a></p></li>
<li><p><a href="#fwbra">Nivel de autenticaci&#243;n</a></p></li>
<li><p><a href="#fwbky">Nombre de servicio PAM</a></p></li></ul>


<a name="fwbsy"></a><h5>Puerto de configuraci&#243;n</h5>
<p>Este atributo especifica el puerto en el que el auxiliar de UNIX
recibe, durante el inicio, la informaci&#243;n de configuraci&#243;n incluida en los atributos
de puerto de autenticaci&#243;n del auxiliar de UNIX, tiempo de espera del
auxiliar de UNIX y subprocesos del auxiliar de UNIX. El valor predeterminado
es 58946.</p>

<a name="fwbqv"></a><h5>Puerto de autenticaci&#243;n</h5>
<p>Este atributo especifica el puerto en el que el auxiliar de UNIX
recibe las solicitudes de autenticaci&#243;n tras la configuraci&#243;n. El valor predeterminado es
57946.</p>

<a name="fwbrv"></a><h5>Tiempo de espera</h5>
<p>Este atributo especifica el n&#250;mero de minutos de los que disponen los
usuarios para completar la autenticaci&#243;n. Si los usuarios sobrepasan el tiempo asignado,
la autenticaci&#243;n presenta un error autom&#225;ticamente. El tiempo predeterminado es de 3
minutos.</p>

<a name="fwbls"></a><h5>Subprocesos</h5>
<p>Este atributo especifica el n&#250;mero m&#225;ximo permitido de sesiones de autenticaci&#243;n de
UNIX simult&#225;neas. Si se alcanza el n&#250;mero m&#225;ximo en un momento dado,
los siguientes intentos de autenticaci&#243;n no se permitir&#225;n hasta que se libere
una sesi&#243;n. El valor predeterminado es 5.</p>

<a name="fwbra"></a><h5>Nivel de autenticaci&#243;n</h5>
<p>El nivel de autenticaci&#243;n se define de forma independiente para cada m&#233;todo
de autenticaci&#243;n. El valor indica en qu&#233; medida se debe confiar en
un mecanismo de autenticaci&#243;n. Una vez que el usuario se ha autenticado,
este valor se guarda en el token SSO de la sesi&#243;n. Cuando
se presenta el token SSO a una aplicaci&#243;n a la que desea
acceder el usuario, la aplicaci&#243;n utiliza el valor almacenado para determinar si
el nivel es suficiente para permitir el acceso al usuario. Si el
nivel de autenticaci&#243;n guardado en un token SSO no satisface el valor
m&#237;nimo necesario, la aplicaci&#243;n puede solicitar al usuario que se autentique de
nuevo mediante un servicio con un mayor nivel de autenticaci&#243;n. El valor
predeterminado es 0.</p>
<hr><p><b>Nota &#8211; </b>Si no se especifica ning&#250;n nivel de autenticaci&#243;n, el token SSO almacena
el valor especificado en el <a href="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Nivel de autenticaci&#243;n predeterminado</a> del atributo de autenticaci&#243;n "Principal".</p>
<hr>


<a name="fwbky"></a><h5>Nombre de servicio PAM</h5>
<p>Define la configuraci&#243;n o la pila del M&#243;dulo de autenticaci&#243;n conectable (PAM,
siglas en ingl&#233;s) incluida en el sistema operativo y utilizada para la
autenticaci&#243;n de UNIX. En Solaris, el nombre es normalmente <tt>other</tt> y, en
Linux, es <tt>password</tt>.</p>
<br/>

</body>
</html>
