<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Componentes de Tarea com&#250;n - Ayuda en l&#237;nea de la consola de Sun OpenSSO 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="task.home"></a><h3>Componentes de Tarea com&#250;n</h3>
<p>Consulte la documentaci&#243;n en l&#237;nea o haga clic en el icono que
aparece junto a cada tarea para obtener informaci&#243;n acerca de los aspectos
espec&#237;ficos de cada tarea com&#250;n.</p><p>OpenSSO contiene los siguientes flujos de trabajo:</p><dl><dt>Crear proveedores de SAMLv2</dt>
<dd><p>Este flujo de trabajo permite crear entidades de los proveedores de servicios e identidades basadas en el protocolo SAMLv2. Ambos tipos de proveedores pueden alojarse o utilizarse de forma remota. Para crearlos, debe proporcionar informaci&#243;n b&#225;sica sobre los proveedores como, por ejemplo, el c&#237;rculo de confianza (COT) al que pertenecer&#225; el proveedor, as&#237; como los metadatos del mismo. Para obtener informaci&#243;n general sobre los proveedores SAMLv2, consulte <a href="ggwxp.html">Entidad de proveedor SAMLv2</a>. De lo contrario, siga las instrucciones en l&#237;nea que aparecen en cada pantalla.</p></dd>
<dt>Crear Fedlet</dt>
<dd><p>Un Fedlet es un peque&#241;o archivo ZIP que puede entregarse a un proveedor de servicios para permitir la federaci&#243;n inmediata con un proveedor de identidades configurado con OpenSSO. Resulta ideal para un proveedor de identidades que necesita habilitar un proveedor de servicios sin tener una soluci&#243;n de federaci&#243;n vigente. El proveedor de servicios s&#243;lo tiene que agregar la funci&#243;n Fedlet a su aplicaci&#243;n y la implementa; de este modo, ya est&#225;n habilitados para la federaci&#243;n. Consulte <a href="http://docs.sun.com/doc/820-3885"><i>Sun OpenSSO Enterprise 8.0 Administration Guide</i></a> para obtener informaci&#243;n sobre c&#243;mo implementar esta aplicaci&#243;n.</p></dd>
</dl>
<dl><dt>Probar la conectividad de federaci&#243;n</dt>
<dd><p>Esta prueba mostrar&#225; si las conexiones de federaci&#243;n se est&#225;n realizando correctamente mediante la identificaci&#243;n de d&#243;nde se encuentran los problemas, en caso de existir.</p></dd>
<dt>Acceder a la documentaci&#243;n</dt>
<dd><p>Esta opci&#243;n de tarea com&#250;n abre la p&#225;gina de documentaci&#243;n OpenSSO. Permite ver las preguntas m&#225;s frecuentes, sugerencias, documentaci&#243;n del producto, documentaci&#243;n de dise&#241;o y v&#237;nculos a los blogs de la comunidad.</p></dd>
<dt>Registre su producto</dt>
<dd><p>Este v&#237;nculo le permite registrar su producto en Sun Connection. Debe disponer de una cuenta de Sun en l&#237;nea para completar el registro. Si no dispone de una, puede solicitarla como parte de este proceso.</p></dd>
</dl>

<br/>

</body>
</html>
