#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: agentService_de.properties,v 1.15 2009/12/26 03:54:17 cbasha Exp $
#
# Portions Copyrighted 2015 ForgeRock AS.
# Portions Copyrighted 2015 Nomura Research Institute, Ltd.

label.Empty=---EMPTY----
a10=USER_ID
a11=PROFILE_ATTRIBUTE
a12=HTTP_HEADER
a13=SESSION_PROPERTY
a14=LOG_NONE
a15=LOG_ALLOW
a16=LOG_DENY
a17=LOG_BOTH
a18=REMOTE
a19=GESAMT
a20=KEINE
a21=HTTP_HEADER
a22=REQUEST_ATTRIBUTE
a23=HTTP_COOKIE
a24=LOKAL
a25=3DES
a26=AES
a27=Unterstruktur
a28=self
a29=1.3
a30=1.0
a100=Passwort
a100.confirm=Passwort (Best\u00e4tigung)
a101=Status
a101.help=Status der Agentenkonfiguration.
a102=Aktiv
a103=Inaktiv
a105=true  
a106=falsch
a109=Agent-Benachrichtigungs-URL
a109.help=Vom Agent zum Registrieren von Benachrichtigungsempf\u00e4ngern verwendete URL. (Eigenschaftsname: com.sun.identity.client.notification.url) <br>Hot-swap: Nein
a110=Speicherort des Agent-Konfigurations-Repository
a110.help=Gibt an, wo die Konfiguration des Agenten gespeichert ist (auf dem Host des Agenten oder zentral auf dem OpenAM-Server).
a111=zentralisiert
a112=lokal

# J2EE Agent properties
a113=Agent-Filtermodus
a113.help=Gibt den Betriebsmodus des Filters an. (Eigenschaftsname: com.sun.identity.agents.config.filter.mode) <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung. <br>G\u00fcltige Werte: ALL, J2EE_POLICY, URL_POLICY, SSO_ONLY, NONE <br>F\u00fcr diese Eigenschaft kann ein globaler Wert festgelegt werden, der f\u00fcr alle Anwendungen gilt, die nicht \u00fcber einen eigenen Filtermodus verf\u00fcgen. <br>Hot-swap: Nein <br>Beispiele: <br>So legen Sie ALL als globalen Filtermodus fest: Lassen Sie das Feld f\u00fcr den Zuordnungsschl\u00fcssel leer und geben Sie ALL in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. <br>So legen Sie URL_POLICY als Filtermodus f\u00fcr die Anwendung BankApp fest: Geben Sie BankApp in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und URL_POLICY in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a114=Benutzer-Zuordnungsmodus
a114.help=Gibt den Mechanismus an, mit dem der Agent die User-ID bestimmt. (Eigenschaftsname: com.sun.identity.agents.config.user.mapping.mode) <br>Hot-swap: Ja
a115=Benutzerattributname
a115.help=Name des Attributs, das die User-ID enth\u00e4lt. (Eigenschaftsname: com.sun.identity.agents.config.user.attribute.name) <br>Hot-swap: Ja
a116=Benutzer-Principal-Flag
a116.help=Verwendet Principal anstelle der User-ID zur Benutzerauthentifizierung. (Eigenschaftsname: com.sun.identity.agents.config.user.principal) <br>Hot-swap: Ja
a117=Benutzer-Tokenname
a117.help=Sitzungs-Eigenschaftsname f\u00fcr User-ID des authentifizierten Benutzers in der Sitzung. (Eigenschaftsname: com.sun.identity.agents.config.user.token) <br>Hot-swap: Ja
a118=Client-IP-Adress-Kopfzeile
a118.help=Name der HTTP-Kopfzeile, die die IP-Adresse des Client enth\u00e4lt. (Eigenschaftsname: com.sun.identity.agents.config.client.ip.header) <br>Hot-swap: Ja
a119=Client-Hostnamen-Kopfzeile
a119.help=Name der HTTP-Kopfzeile, die den Hostnamen des Client enth\u00e4lt. (Eigenschaftsname: com.sun.identity.agents.config.client.hostname.header) <br>Hot-swap: Ja
a121=Neulade-Intervall f\u00fcr Konfiguration
a121.help=Zeitdauer, nach der die Konfiguration neu geladen wird. (in Sekunden) (Eigenschaftsname: com.sun.identity.agents.config.load.interval) <br>Hot-swap: Ja
a122=Lokale Sprache 
a122.help=(Eigenschaftsname: com.sun.identity.agents.config.locale.language) <br>Hot-swap: Nein
a123=Lokales Land
a123.help=(Eigenschaftsname: com.sun.identity.agents.config.locale.country) <br>Hot-swap: Nein
a124=\u00dcberwachungszugriffstypen
a124.help=Typen von zu protokollierenden Nachrichten auf der Grundlage der URL-Zugriffsversuche der Benutzer. (Eigenschaftsname: com.sun.identity.agents.config.audit.accesstype) <br>Hot-swap: Ja
a125=\u00dcberwachungsprotokoll-Speicherort
a125.help=Gibt an wo \u00dcberwachungsnachrichten protokolliert werden. (Eigenschaftsname: com.sun.identity.agents.config.log.disposition) <br>Hot-swap: Ja
a126=Name der Remote-Protokolldatei
a126.help=Name der auf dem OpenAM-Server gespeicherten Datei mit den \u00dcberwachungsnachrichten des Agenten. (Eigenschaftsname: com.sun.identity.agents.config.remote.logfile) <br>Hot-swap: Ja
a128=Lokales \u00dcberwachungsprotokoll rotieren 
a128.help=Flag, das anzeigt, dass die \u00dcberwachungsprotokolldateien zu rotieren sind, sobald eine bestimmte Gr\u00f6\u00dfe erreicht wird. (Eigenschaftsname: com.sun.identity.agents.config.local.log.rotate) <br>Hot-swap: Ja
a129=Rotationsgr\u00f6\u00dfe f\u00fcr lokales \u00dcberwachungsprotokoll
a129.help=Gr\u00f6\u00dfe, bei der eine neue lokale \u00dcberwachungsprotokolldatei f\u00fcr die Rotation angelegt wird. (Eigenschaftsname: com.sun.identity.agents.config.local.log.size) <br>Hot-swap: Ja
a131=Webdienst-Aktivierung
a131.help=Flag gibt an, ob Webdienstverarbeitung aktiviert ist. (Eigenschaftsname: com.sun.identity.agents.config.webservice.enable) <br>Hot-Swap: Ja
a132=Webdienst-Endpunkte
a132.help=Eine Liste mit Webanwendungs-Endpunkten, die Webdienste darstellen. (Eigenschaftsname: com.sun.identity.agents.config.webservice.endpoint) <br>Hot-Swap: Ja
a133=Aktivierung von Webdienst-GET-Verarbeitung
a133.help=Flag zur Angabe, ob die Verarbeitung von HTTP GET-Anforderungen f\u00fcr Webdienst-Endpunkte aktiviert ist. (Eigenschaftsname: com.sun.identity.agents.config.webservice.process.get.enable) <br>Hot-Swap: Ja
a134=Webdienst-Authentifizierung
a134.help=Eine Implementierungsklasse der Schnittstelle com.sun.identity.agents.filter.IWebServiceAuthenticator, die zur Authentifizierung von Webdienstanforderungen verwendet werden kann. (Eigenschaftsname: com.sun.identity.agents.config.webservice.authenticator) <br>Hot-Swap: Ja
a134a=Webdienst-Reaktions-Verarbeitung
a134a.help=Eine Implementierungsklasse der Schnittstelle com.sun.identity.agents.filter.IWebServiceResponseProcessor, die zur Verarbeitung der Webdienst-Reaktionen verwendet werden kann. (Eigenschaftsname: com.sun.identity.agents.config.webservice.responseprocessor) <br>Hot-swap: Ja
a135=Webdienst - Inhaltsdatei f\u00fcr internen Fehler
a135.help= Der Name der Datei mit dem Inhalt, der vom Agenten zur Generierung eines internen Fehlers f\u00fcr Clients verwendet wird. (Eigenschaftsname: com.sun.identity.agents.config.webservice.internalerror.content) <br>Hot-Swap: Ja
a136=Webdienst - Inhaltsdatei f\u00fcr Autorisierungsfehler
a136.help=Der Name der Datei mit dem Inhalt, der vom Agenten zur Generierung eines Autorisierungsfehlers f\u00fcr Clients verwendet wird. (Eigenschaftsname: com.sun.identity.agents.config.webservice.autherror.content) <br>Hot-Swap: Ja
a137=URI f\u00fcr verweigerten Ressourcenzugriff
a137.help=Eine anwendungsspezifische Zuordnung, die einen URI der angepassten Seite f\u00fcr den verweigerten Zugriff identifiziert. (Eigenschaftsname: com.sun.identity.agents.config.access.denied.uri) <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung. <br>G\u00fcltiger Wert: der URI der angepassten Seite f\u00fcr den verweigerten Zugriff auf die Anwendung. <br>F\u00fcr diese Eigenschaft kann ein globaler Wert festgelegt werden, der bei allen Anwendungen angewendet wird, die keine eigene Seite f\u00fcr den verweigerten Zugriff aufweisen. <br>Hot-Swap: Ja <br> Beispiele: <br>So legen Sie eine globale Seite f\u00fcr den verweigerten Zugriff fest: Lassen Sie das Feld Zuordnungsschl\u00fcssel leer und geben Sie den globalen URI der Seite f\u00fcr den verweigerten Zugriff (/sample/accessdenied.html) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein. <br>So legen Sie den URI der Seite f\u00fcr den verweigerten Zugriff f\u00fcr die Anwendung BankApp fest: Geben Sie im Feld "Zuordnungsschl\u00fcssel" BankApp und den URI der Seite f\u00fcr den verweigerten Zugriff (/BankApp/accessdenied.html) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein.
a138=URI des Anmeldeformulars
a138.help=Liste der absoluten URIs, die dem web.xml-Anmeldeformularelement einer Anwendung entsprechen. (Eigenschaftsname: com.sun.identity.agents.config.login.form) <br>Hot-Swap: Ja <br> Beispiel: <br> /BankApp/jsp/login.jsp
a139=URI der Anmelde-Fehlerseite
a139.help=Liste der absoluten URIs, die dem web.xml-Anmelde-Fehlerseitenelement einer Anwendung entsprechen. (Eigenschaftsname: com.sun.identity.agents.config.login.error.uri) <br>Hot-Swap: Ja <br> Beispiel: <br> /BankApp/jsp/error.jsp
a141=Interne Anmeldung verwenden 
a141.help=Auf false setzen, wenn an Stelle des internen Standard-Inhalts die Inhaltsdatei f\u00fcr die Anmeldung individuell definiert werden soll. (Eigenschaftsname: com.sun.identity.agents.config.login.use.internal) <br>Hot-swap: Ja
a142=Name der Anmelde-Inhaltsdatei
a142.help=Vollst\u00e4ndiger Pfad und Name der benutzerdefinierten Anmelde-Inhaltsdatei. (Eigenschaftsname: com.sun.identity.agents.config.login.content.file) <br>Hot-swap: Ja
a143=Benutzerdefinierte Authentifizierungs-Behandlungsroutine
a143.help=Anwendungsspezifische Behandlungsroutine zum Authentifizieren des angemeldeten Benutzers am Anwendungsserver. (Eigenschaftsname: com.sun.identity.agents.config.auth.handler)  <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung. <br>G\u00fcltiger Wert: Klassenname der Authentifizierungs-Behandlungsroutine. <br>Hot-swap: Ja  <br>Beispiel: <br>So legen Sie die Authentifizierungs-Behandlungsroutine f\u00fcr die Anwendung BankApp fest: Geben Sie BankApp in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und den Klassennamen der Authentifizierungs-Behandlungsroutine, BankAuthHandler, in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a144=Benutzerdefinierte Abmeldungs-Behandlungsroutine
a144.help=Anwendungsspezifische Behandlungsroutine zum Abmelden des angemeldeten Benutzers am Anwendungsserver. (Eigenschaftsname: com.sun.identity.agents.config.logout.handler) <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung.  <br>G\u00fcltiger Wert: Klassenname des Abmeldungs-Behandlungsroutine.  <br>Hot-swap: Ja  <br> Beispiel: <br>So legen Sie die Abmeldungs-Behandlungsroutine f\u00fcr die Anwendung BankApp fest: Geben Sie BankApp in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und den Klassennamen der Abmeldungs-Behandlungsroutine, BankLogoutHandler, in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a145=Benutzerdefinierte Verifizierungs-Behandlungsroutine
a145.help=Anwendungsspezifische Verifizierungs-Behandlungsroutine zum Validieren der Benutzer-Berechtigungsnachweise am lokalen Repository. (Eigenschaftsname: com.sun.identity.agents.config.verification.handler) <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung.  <br>G\u00fcltiger Wert: Klassenname der Verifizierungs-Behandlungsroutine.  <br>Hot-swap: Ja  <br> Beispiel: <br>So legen Sie die Verifizierungs-Behandlungsroutine f\u00fcr die Anwendung BankApp fest: Geben Sie BankApp in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und den Klassennamen der Verifizierungs-Behandlungsroutine, BankVerificationHandler, in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a146=HTTP-Sitzungsverbindung
a146.help=Falls TRUE, wird die HTTP-Sitzung ung\u00fcltig, wenn die Anmeldung fehlschl\u00e4gt, der Benutzer nicht \u00fcber eine SSO-Sitzung verf\u00fcgt oder der Principal-Benutzername nicht dem SSO-Benutzernamen entspricht. (Eigenschaftsname: com.sun.identity.agents.config.httpsession.binding) <br>Hot-swap: Ja
a147=Name des Goto-Parameters
a147.help=Eigenschaft nur verwendet, wenn CDSSO aktiviert ist. Der Standardwert sollte nur ge\u00e4ndert werden, wenn in der Anmelde-URL eine Landing-Page angegeben ist. <br> Beispiel: com.sun.identity.agents.config.cdsso.cdcservlet.url = http://host:port/opensso/cdcservlet?goto=http://agent:port/landing.jsp <br> Der Parameter wird vom Agenten dazu verwendet, die urspr\u00fcngliche Anforderungs-URL an diesen cdcserlet-URL anzuh\u00e4ngen. Dieser Parameter wird von der Landing-Page zur Umleitung an die urspr\u00fcngliche URL verwendet. (Eigenschaftsname: com.sun.identity.agents.config.redirect.param) <br>Hot-Swap: Ja <br> Beispiel: com.sun.identity.agents.config.redirect.param = goto2<br> Die vollst\u00e4ndige, zur Authentifizierung gesendete URL lautet <br> http://host:port/opensso/cdcservlet?goto=http://agent:port/landing.jsp?goto2=http://agent.port/original.jsp
a148=URL f\u00fcr OpenAM-Anmeldung
a148.help=URL der OpenAM-Anmeldeseite. (Eigenschaftsname: com.sun.identity.agents.config.login.url) <br>Hot-Swap: Ja <br> Beispiel: <br> http://host:port/opensso/UI/Login
a149=Anmeldungs-URL priorisiert
a149.help=Gibt an, ob die Failover-Folge f\u00fcr Anmeldungs-URLs oder CDSSO-URLs entsprechend der Definition in der Liste der URLs f\u00fcr OpenAM-Anmeldung priorisiert werden soll.   (Eigenschaftsname: com.sun.identity.agents.config.login.url.prioritized) <br>Hot-swap: Ja
a151=Anmeldungs-URL-Probe
a151.help=Gibt an, ob der Agent die Verf\u00fcgbarkeit dieser URLs pr\u00fcft, bevor er eine Anfrage zu ihnen umleitet. (Eigenschaftsname: com.sun.identity.agents.config.login.url.probe.enabled) <br>Hot-swap: Ja
a152=Timeout f\u00fcr Anmeldungs-URL-Probe
a152.help=Zeitdauer in Millisekunden, nach der eine Zeit\u00fcberschreitungs-Fehlermeldung ausgegeben wird (Anmeldungs-URL-Probe muss auf true gesetzt sein. (Eigenschaftsname: com.sun.identity.agents.config.login.url.probe.timeout) <br>Hot-swap: Ja
a153=Name des alternativen Agent-Hosts
a153.help=Hostname, der f\u00fcr die Clientbrowser den agentgesch\u00fctzten Server angibt, sofern dieser vom eigentlichen Hostnamen abweicht. (Eigenschaftsname: com.sun.identity.agents.config.agent.host) <br>Hot-swap: Ja
a154=Name des alternativen Agent-Anschlusses
a154.help=F\u00fcr die Clientbrowser angegebene Nummer des Anschlusses, auf dem der agentgesch\u00fctzte Server Anfragen entgegennimmt, sofern dieser vom eigentlichen Anschluss abweicht. (Eigenschaftsname: com.sun.identity.agents.config.agent.port) <br>Hot-swap: Ja
a155=Alternatives Agent-Protokoll
a155.help=Das von den Clientbrowsern zur Kommunikation mit dem agentgesch\u00fctzten Server verwendete Protokoll (http/https), sofern dieses vom eigentlichen Protokoll des Servers abweicht. (Eigenschaftsname: com.sun.identity.agents.config.agent.protocol) <br>Hot-swap: Ja
a156=Grenze f\u00fcr Anmeldeversuche
a156.help=Anzahl der fehlgeschlagenen Anmeldeversuche f\u00fcr eine einzelne Browsersitzung, nach der die Benutzeranforderung blockiert wird. Ein Wert von 0 deaktiviert diese Funktion. (Eigenschaftsname: com.sun.identity.agents.config.login.attempt.limit) <br>Hot-swap: Ja
a158=SSO-Cache aktivieren
a158.help=Gibt an, ob der SSO-Cache f\u00fcr den Agent aktiv ist. Cache wird \u00fcber \u00f6ffentliche APIs verwendet, die mit dem Agent SDK zur Verf\u00fcgung gestellt werden. (Eigenschaftsname: com.sun.identity.agents.config.amsso.cache.enable) <br>Hot-swap: Ja
a159=Cookie zur\u00fccksetzen
a159.help=Agent setzt Cookies zur\u00fcck, ehe die Anfrage zur Authentifizierung umgeleitet wird. (Eigenschaftsname: com.sun.identity.agents.config.cookie.reset.enable) <br>Hot-swap: Ja
a161=Namensliste der zur\u00fcckzusetzenden Cookies
a161.help=Namen der Cookies, die vom Agent zur\u00fcckgesetzt werden, wenn Cookie zur\u00fccksetzen aktiviert ist. (Eigenschaftsname: com.sun.identity.agents.config.cookie.reset.name) <br>Hot-swap: Ja
a162=Domainzuordnung der zur\u00fcckzusetzenden Cookies
a162.help=Ordnet die in der Namensliste der zur\u00fcckzusetzenden Cookies angegebenen Cookienamen einem Wert zu, der der Dom\u00e4ne dieses Cookies entspricht und der bei einem Reset-Ereignis verwendet wird. (Eigenschaftsname: com.sun.identity.agents.config.cookie.reset.domain) <br>Hot-swap: Ja
a163=Pfadzuordnung der zur\u00fcckzusetzenden Cookies
a163.help=Ordnet die in der Namensliste der zur\u00fcckzusetzenden Cookies angegebenen Cookienamen einem Wert zu, der dem Pfad dieses Cookies entspricht und der bei einem Reset-Ereignis verwendet wird. (Eigenschaftsname: com.sun.identity.agents.config.cookie.reset.path) <br>Hot-swap: Ja
a164=Dom\u00e4nen\u00fcbergreifendes SSO
a164.help=Aktiviert Dom\u00e4nen\u00fcbergreifendes Single SignOn. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.enable) <br>Hot-swap: Ja
a165=CDSSO-Umleitungs-URI
a165.help= Eine zeitweise URI, die vom Agent zur Verarbeitung von CDSSO-Anforderungen verwendet wird. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.redirect.uri) <br>Hot-swap: Ja
a166=CDSSO-Servlet-URL
a166.help=Liste von URLs der verf\u00fcgbaren CDSSO-Controller, die vom Agent f\u00fcr die CDSSO-Verarbeitung verwendet werden k\u00f6nnen. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.cdcservlet.url) <br>Hot-Swap: Ja <br> Beispiel: <br> http://host:port/opensso/cdcservlet
a167=CDSSO-Zeitdifferenz
a167.help=Zeitdifferenz in Sekunden, anhand derer der Agent die G\u00fcltigkeit der CDSSO-AuthnResponse-Best\u00e4tigungsanweisung bestimmt. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.clock.skew) <br>Hot-swap: Ja
a168=Vertrauensw\u00fcrdiger CDSSO-ID-Anbieter
a168.help=Liste von OpenAM-Servern/ID-Anbietern, denen der Agent vertrauen soll, wenn CDC-Liberty-Responses ausgewertet werden. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.trusted.id.provider) <br>Hot-Swap: Ja <br> Beispiel: <br> http://host:port/opensso/cdcservlet
a169=CDSSO-Sicherheit aktivieren
a169.help=Das vom Agent in verschiedenen Dom\u00e4nen im CDSSO-Modus gesetzte SSO-Token-Cookie wird als sicher markiert. Wird nur \u00fcbertragen, wenn der Kanal, \u00fcber den die Kommunikation mit dem Host erfolgt, sicher ist. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.secure.enable) <br>Hot-swap: Ja
a170=CDSSO-Dom\u00e4nenliste
a170.help=Dom\u00e4nen, f\u00fcr die in einem CDSSO-Szenario Cookies gesetzt werden m\u00fcssen. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.domain) <br>Hot-Swap: Ja <br> Beispiel: <br> .sun.com
a171=Abmeldungs-Behandlungroutine der Anwendung
a171.help=Eine anwendungsspezifische Zuordnung, die eine Behandlungsroutine f\u00fcr die Verarbeitung der Abmeldung identifiziert. (Eigenschaftsname: com.sun.identity.agents.config.logout.application.handler) <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung.  <br>G\u00fcltiger Wert: Klassenname des Abmelde-Behandlungsroutine der Anwendung.   <br>F\u00fcr diese Eigenschaft kann ein globaler Wert festgelegt werden, der bei allen Anwendungen angewendet wird, die keine eigene Abmeldungsbehandlungsroutine aufweisen. <br>Hot-Swap: Ja <br> Beispiele: <br>So legen Sie eine globale Abmeldungsbehandlungsroutine einer Anwendung fest: lassen Sie das Feld "Zuordnungsschl\u00fcssel" leer, und geben Sie den globalen Klassennamen der Abmeldungsbehandlungsroutine einer Anwendung (GlobalApplicationLogoutHandler) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein. <br>So legen Sie die Abmeldungsbehandlungsroutine f\u00fcr die Anwendung BankApp fest: Geben Sie im Feld "Zuordnungsschl\u00fcssel" BankApp und den Klassennamen der Abmeldungsbehandlungsroutine der Anwendung (BankAppLogoutHandler) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein.
a172=Abmelde-URI der Anwendung
a172.help=Eine anwendungsspezifische Zuordnung, die eine Anforderungs-URI identifiziert, welche ein Abmeldungsereignis kennzeichnet. (Eigenschaftsname: com.sun.identity.agents.config.logout.uri) <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung.  <br>G\u00fcltiger Wert: Der Abmelde-URI der Anwendung. <br>F\u00fcr diese Eigenschaft kann ein globaler Wert festgelegt werden, der bei allen Anwendungen angewendet wird, die keinen eigenen Abmelde-URI aufweisen. <br>Hot-Swap: Ja <br> Beispiele: <br>So legen Sie einen globalen Abmelde-URI f\u00fcr eine Anwendung fest: Lassen Sie das Feld "Zuordnungsschl\u00fcssel" leer und geben Sie den globalen Abmelde-URI f\u00fcr eine Anwendung (/logout.jsp) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein. <br>So legen Sie den Abmelde-URI f\u00fcr die Anwendung BankApp fest: Geben Sie im Feld "Zuordnungsschl\u00fcssel" BankApp und den Abmelde-URI der Anwendung (/BankApp/logout.jsp) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein.
a173=Parameter f\u00fcr die Abmeldungsanforderung
a173.help=Eine anwendungsspezifische Zuordnung, die einen Parameter identifiziert, welcher bei Anwesenheit in der HTTP-Anforderung ein Abmeldungsereignis kennzeichnet. (Eigenschaftsname: com.sun.identity.agents.logout.request.param) <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung.  <br>G\u00fcltiger Wert: Parameter f\u00fcr Abmeldungsanforderung. <br>F\u00fcr diese Eigenschaft kann ein globaler Wert festgelegt werden, der bei allen Anwendungen angewendet wird, die keinen eigenen Parameter f\u00fcr die Abmeldungsanforderung aufweisen. <br>Hot-Swap: Ja <br> Beispiele: <br>So legen Sie einen globalen Parameter f\u00fcr die Abmeldungsanforderung f\u00fcr eine Anwendung fest: Lassen Sie das Feld "Zuordnungsschl\u00fcssel" leer und geben Sie den globalen Parameter f\u00fcr die Abmeldungsanforderung f\u00fcr eine Anwendung (logoutparam) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein. <br>So legen Sie den Parameter f\u00fcr die Abmeldungsanforderung f\u00fcr die Anwendung BankApp fest: Geben Sie im Feld "Zuordnungsschl\u00fcssel" BankApp und den Parameter f\u00fcr die Abmeldungsanforderung der Anwendung (logoutparam) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein.
a174=Abmeldungs-Introspektion aktiviert
a174.help=Erm\u00f6glicht dem Agenten, den HTTP-Anforderungsnachrichtentext nach dem Abmeldungsparameter zu durchsuchen. (Eigenschaftsname: com.sun.identity.agents.config.logout.introspect.enabled) <br>Hot-swap: Ja
a175=URI f\u00fcr Abmeldungseintrag
a175.help=Eine anwendungsspezifische Zuordnung, die eine nach der erfolgreichen Abmeldung und der darauf folgenden erfolgreichen Authentifizierung gegebenenfalls als Eintrittspunkt zu verwendende URI angibt. (Eigenschaftsname: com.sun.identity.agents.config.logout.entry.uri) <br>G\u00fcltiger Schl\u00fcssel: Name der Webanwendung.  <br>G\u00fcltiger Wert: URI f\u00fcr Abmeldungseintrag. <br>F\u00fcr diese Eigenschaft kann ein globaler Wert festgelegt werden, der bei allen Anwendungen angewendet wird, die keinen eigenen URI f\u00fcr den Abmeldungseintrag aufweisen. <br>Hot-Swap: Ja <br> Beispiele: <br>So legen Sie einen globalen URI f\u00fcr den Abmeldungseintrag f\u00fcr eine Anwendung fest: Lassen Sie das Feld "Zuordnungsschl\u00fcssel" leer und geben Sie den globalen URI f\u00fcr den Abmeldungseintrag f\u00fcr eine Anwendung (/welcome.html) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein. <br>So legen Sie den URI f\u00fcr den Abmeldungseintrag f\u00fcr die Anwendung BankApp fest: Geben Sie im Feld "Zuordnungsschl\u00fcssel" BankApp und den URI f\u00fcr den Abmeldungseintrag (/BankApp/welcome.html) im Feld "Dazugeh\u00f6riger Zuordnungswert" ein.
a176=FQDN-Pr\u00fcfung
a176.help=Aktiviert die Pr\u00fcfung des fqdn-Standardwerts und der fqdn-Zuordnungswerte. (Eigenschaftsname: com.sun.identity.agents.config.fqdn.check.enable) <br>Hot-swap: Ja
a177=FQDN-Standard
a177.help=Voll qualifizierter Hostname, den die Benutzer zum Zugriff auf die Ressourcen verwenden m\u00fcssen. (Eigenschaftsname: com.sun.identity.agents.config.fqdn.default) <br>Hot-swap: Ja
a178=Virtuelle FQDN-Host-Zuordnung
a178.help=Erm\u00f6glicht den Zugriff auf gesch\u00fctzte Ressourcen \u00fcber virtuelle Hosts, partielle Hostnamen und IP-Adressen. Ordnet ung\u00fcltigen Schl\u00fcssel einem g\u00fcltigen Wert zu. (Eigenschaftsname: com.sun.identity.agents.config.fqdn.mapping) <br>Hot-swap: Ja <br> Beispiel: <br>So ordnen Sie myserver zu myserver.mydomain.com zu: Geben Sie myserver in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und dmyserver.mydomain.com in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a179=Aktivierung der Unterst\u00fctzung f\u00fcr Legacy-Benutzeragent
a179.help=Aktiviert Unterst\u00fctzung f\u00fcr Legacy-Benutzeragenten (Browser). (Eigenschaftsname: com.sun.identity.agents.config.legacy.support.enable) <br>Hot-swap: Ja
a181=Legacy-Benutzeragenten-Liste
a181.help=Liste von Benutzeragenten-Kopfzeilenwerten, die Legacy-Browser identifizieren. In dieser Liste k\u00f6nnen Platzhalter '*' verwendet werden. (Eigenschaftsname: com.sun.identity.agents.config.legacy.user.agent) <br>Hot-swap: Ja
a182=Umleitungs-URI f\u00fcr Legacy-Benutzeragent
a182.help=Eine zeitweise URI, die vom Agent zur Umleitung von Anforderungen durch Legacy-Benutzeragenten verwendet wird. (Eigenschaftsname: com.sun.identity.agents.config.legacy.redirect.uri) <br>Hot-swap: Ja
a183=Benutzerdefinierte Reaktionskopfzeile
a183.help=Zuordnung gibt die benutzerdefinierten Kopfzeilen an, die vom Agent auf dem Client-Browser gesetzt werden. Der Schl\u00fcssel ist der Kopfzeilenname, und der Wert repr\u00e4sentiert den Kopfzeilenwert. (Eigenschaftsname: com.sun.identity.agents.config.response.header) <br>Hot-swap: Ja <br> Beispiel: <br>  So setzen Sie den benutzerdefinierten Header Cache-Control auf den Wert no-cache: Geben Sie Cache-Control in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und no-cache in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a184=Grenze f\u00fcr Umleitungsversuche
a184.help=Anzahl der aufeinander folgenden Einzelpunkt-Umleitungen, die ein Benutzer in einer einzelnen Browsersitzung unternehmen kann, nach der die Benutzeranforderung blockiert wird. Ein Wert von 0 deaktiviert diese Funktion. (Eigenschaftsname: com.sun.identity.agents.config.redirect.attempt.limit) <br>Hot-swap: Ja
a185=Anschlusspr\u00fcfung aktivieren
a185.help=Gibt an, ob die Anschlusspr\u00fcfungsfunktionalit\u00e4t aktiviert oder deaktiviert ist. (Eigenschaftsname: com.sun.identity.agents.config.port.check.enable) <br>Hot-swap: Ja
a186=Anschlusspr\u00fcfungsdatei
a186.help=Name oder vollst\u00e4ndiger Pfad einer Datei, die den erforderlichen Inhalt zur Verarbeitung von Anforderungen enth\u00e4lt, die eine Korrektur des Anschlusses erfordern. (Eigenschaftsname: com.sun.identity.agents.config.port.check.file) <br>Hot-swap: Ja
a187=Anschlusspr\u00fcfungseinstellung
a187.help=Anschluss-Protokoll-Zuordnungen, bei denen der Schl\u00fcssel die Nummer des empfangenden Anschlusses und der Wert das vom Agent zum Identifizieren von Anforderungen mit ung\u00fcltigen Anschlussnummern verwendete Empfangsprotokoll ist. (Eigenschaftsname: com.sun.identity.agents.config.port.check.setting) <br>Hot-swap: Ja <br> Beispiel: <br> So ordnen Sie Anschluss 80 dem Protokoll http zu: Geben Sie 80 in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und http in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a188=Nicht erzwungene URIs
a188.help=Liste der URIs, f\u00fcr die der Schutz nicht vom Agent erzwungen wird. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.uri) <br>Hot-swap: Ja <br> Beispiel: <br> /BankApp/public/* <br> /BankApp/images/*
a189=Nicht erzwungene URIs umkehren
a189.help=Kehrt den Schutz der in der Liste Nicht erzwungene URIs angegebenen URIs um. Wenn auf true gesetzt, werden die angegebenen URIs vom Agent erzwungen und alle sonstigen URIs nicht erzwungen. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.uri.invert) <br>Hot-swap: Ja
a191=Cache nicht erzwungener URIs aktiviert
a191.help=Aktiviert das Zwischenspeichern der Auswertungsergebnisse der Liste der nicht erzwungenen URIs. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.uri.cache.enable) <br>Hot-swap: Ja
a192=Gr\u00f6\u00dfe des Caches f\u00fcr nicht erzwungene URIs 
a192.help=Gr\u00f6\u00dfe des zu verwendenden Caches, wenn das Zwischenspeichern der Auswertungsergebnisse der Liste der nicht erzwungenen URIs aktiviert ist. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.uri.cache.size) <br>Hot-swap: Ja
a193=IP-Liste nicht erzwungener Clients
a193.help=F\u00fcr Anforderungen von diesen Client-IP-Adressen ist keine Authentifizierung und kein Autorisierungsschutz vom Agent erforderlich. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.ip) <br>Hot-Swap: Ja <br> Beispiel: <br> 192.18.145.* <br> 192.18.146.123
a194=Umkehrungs-Liste nicht erzwungener IP
a194.help=Client-IP-Adressen zum Umkehren des Schutzes der auf der zugeh\u00f6rigen IP-Liste nicht erzwungener Clients aufgef\u00fchrten IP-Adressen. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.ip.invert) <br>Hot-swap: Ja
a195=Cache-Flag f\u00fcr nicht erzwungene IP-Adressen
a195.help=Aktiviert das Zwischenspeichern der Auswertungsergebnisse der Liste nicht erzwungener IP-Adressen. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.ip.cache.enable) <br>Hot-swap: Ja
a196=Gr\u00f6\u00dfe des Caches f\u00fcr nicht erzwungene IP-Adressen
a196.help=Gr\u00f6\u00dfe des zu verwendenden Caches, wenn das Zwischenspeichern der Auswertungsergebnisse der Liste der nicht erzwungenen IP-Adressen aktiviert ist. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.ip.cache.size) <br>Hot-swap: Ja
a197=Cookie-Trennzeichen
a197.help=Zeichen, das zum Trennen mehrerer Werte desselben Attributs verwendet wird, wenn dieses als Cookie eingestellt ist. (Eigenschaftsname: com.sun.identity.agents.config.attribute.cookie.separator) <br>Hot-swap: Ja
a198=Datumsformat f\u00fcr Abrufattribut
a198.help=Zu verwendendes Format der Datumsattributwerte, wenn das Attribut als HTTP-Header gesetzt wird. Format ist auf der Grundlage java.text.SimpleDateFormat. (Eigenschaftsname: com.sun.identity.agents.config.attribute.date.format) <br>Hot-swap: Ja
a199=Attribut-Cookie kodieren
a199.help=Gibt an, ob der Wert des Attributs URL-kodiert werden muss, ehe dieses als Cookie gesetzt werden kann. (Eigenschaftsname: com.sun.identity.agents.config.attribute.cookie.encode) <br>Hot-swap: Ja
a200=Sitzungsleerlaufzeit aktualisieren
a200.help=Gibt an, ob die Leerlaufzeit f\u00fcr eine OpenAM-Sitzung f\u00fcr nicht erzwungene URIs aktualisiert oder zur\u00fcckgesetzt werden soll. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.refresh.session.idletime) <br>Hot-swap: Ja
a201=Abrufmodus f\u00fcr Profilattribut
a201.help=Der Modus zum Abrufen von Profilattributen. (Eigenschaftsname: com.sun.identity.agents.config.profile.attribute.fetch.mode) <br>Hot-swap: Ja
a202=Zuordnung f\u00fcr Profilattribut
a202.help=Ordnet die unter bestimmten Namen zu f\u00fcllenden Profilattribute f\u00fcr den aktuell authentifizierten Benutzer zu. (Eigenschaftsname: com.sun.identity.agents.config.profile.attribute.mapping) <br>Hot-swap: Ja <br> Beispiel: <br> So f\u00fcllen Sie den Wert des Profilattributs cn mit dem Namen CUSTOM-Common-Name aus: Geben Sie cn in das Feld f\u00fcr den Zuordnungsschl\u00fcssel  und CUSTOM-Common-Name in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. <br> So f\u00fcllen Sie den Wert des Profilattributs mail mit dem Namen CUSTOM-Email aus: Geben Sie mail in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und CUSTOM-Email in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. 
a203=Sitzungsattribut-Abrufmodus
a203.help=Der Modus zum Abrufen von Sitzungsattributen. (Eigenschaftsname: com.sun.identity.agents.config.session.attribute.fetch.mode) <br>Hot-swap: Ja
a204=Zuordnung f\u00fcr Sitzungsattribut
a204.help=Ordnet die unter bestimmten Namen zu f\u00fcllenden Sitzungsattribute f\u00fcr den aktuell authentifizierten Benutzer zu. (Eigenschaftsname: com.sun.identity.agents.config.session.attribute.mapping <br>Hot-swap: Ja <br> Beispiel: <br> So f\u00fcllen Sie den Wert des Sitzungsattributs UserToken mit dem Namen CUSTOM-userid aus: Geben Sie UserToken in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und CUSTOM-userid in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. 
a205=Reaktionsattribut-Abrufmodus
a205.help=Der Modus zum Abrufen von Reaktionsattributen. (Eigenschaftsname: com.sun.identity.agents.config.response.attribute.fetch.mode) <br>Hot-swap: Ja
a206=Zuordnung f\u00fcr Reaktionsattribut
a206.help=Ordnet die unter bestimmten Namen zu f\u00fcllenden Richtlinien-Reaktionsattribute f\u00fcr den aktuell authentifizierten Benutzer zu. (Eigenschaftsname: com.sun.identity.agents.config.response.attribute.mapping) <br>Hot-swap: Ja <br> Beispiel: <br> So f\u00fcllen Sie den Wert des Reaktionsattributs uid mit dem Namen CUSTOM-USER-NAME aus: Geben Sie uid in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und CUSTOM-USER-NAME in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. 
a207=Liste zu umgehender Principals
a207.help=Liste von Principals, die vom Agent zur Authentifizierung und Suche umgangen werden. (Eigenschaftsname: com.sun.identity.agents.config.bypass.principal) <br>Hot-Swap: Ja <br> Beispiel: <br> guest <br> testuser
a208=Standard-Privilegattribut
a208.help=Liste privilegierter Attribute f\u00fcr alle Benutzer mit g\u00fcltiger OpenAM-Sitzung. (Eigenschaftsname: com.sun.identity.agents.config.default.privileged.attribute) <br>Hot-Swap: Ja <br> Beispiel: <br> AUTHENTICATED_USERS
a209=Privilegattributtyp
a209.help=Liste privilegierter Attributtypen, die f\u00fcr jeden Benutzer abgerufen werden. (Eigenschaftsname: com.sun.identity.agents.config.privileged.attribute.type) <br>Hot-Swap: Ja <br> Beispiel: <br> Group
a211=Privilegierte Attribute in Kleinbuchstaben
a211.help=Weist den privilegierten Attributtypen zu, ob diese in Kleinbuchstaben konvertiert werden sollen. (Eigenschaftsname: com.sun.identity.agents.config.privileged.attribute.tolowercase) <br> G\u00fcltige Schl\u00fcssel: Privilegattributtypen, wie Group (Gruppe), Role (Rolle). <br>G\u00fcltiger Wert: true (wahr), false (falsch). <br>Hot-swap: Ja  <br> Beispiel: <br> Geben Sie Group in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und false in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. 
a212=Privilegiertes Sitzungsattribut
a212.help=Liste von Sitzungseigenschaftsnamen, die privilegierte Attribute f\u00fcr den authentifizierten Benutzer enthalten. (Eigenschaftsname: com.sun.identity.agents.config.privileged.session.attribute) <br>Hot-Swap: Ja <br> Beispiel: <br> UserToken 
a213=Privilegattributzuordnung aktivieren
a213.help=Erm\u00f6glicht eine Zuordnung vom Originalwert eines Attributs zu einem anderen Wert. Erm\u00f6glicht die Verwendung containerspezifischer Beschr\u00e4nkungen des verwendeten Zeichensatzes bei bestimmten Konfigurationsdateien. (Eigenschaftsname: com.sun.identity.agents.config.privileged.attribute.mapping.enable) <br>Hot-swap: Ja
a214=Privilegierte Attributzuordnung
a214.help=Verwendete Privilegattributzuordnung. (Eigenschaftsname: com.sun.identity.agents.config.privileged.attribute.mapping) <br>Hot-swap: Ja <br> Beispiel: <br> So ordnen Sie UUID id=manager,ou=group,dc=openam,dc=openidentityplatform,dc=org dem Prinzipalnamen am_manager_role zu, der im Bereitstellungsdeskriptor der Webanwendung angegeben wurde: Geben Sie id=manager,ou=group,dc=openam,dc=openidentityplatform,dc=org in das Feld f\u00fcr den Zuordnungsschl\u00fcssel  und am_manager_role in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. <br> So ordnen Sie UUID id=employee,ou=group,dc=openam,dc=openidentityplatform,dc=org dem Prinzipalnamen am_employee_role zu, der im Bereitstellungsdeskriptor der Webanwendung angegeben wurde: Geben Sie id=employee,ou=group,dc=openam,dc=openidentityplatform,dc=org in das Feld f\u00fcr den Zuordnungsschl\u00fcssel  und am_employee_role in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a215=Agent-Debug-Ebene
a215.help=Gibt den Typ der zu protokollierenden Agent-Debug-Nachrichten an. (Eigenschaftsname: com.iplanet.services.debug.level) <br>Hot-swap: Ja
a216=Cookie-Name
a216.help=Name des zwischen OpenAM-Server und Agent verwendeten SSO-Token-Cookies. (Eigenschaftsname: com.iplanet.am.cookie.name) <br>Hot-swap: Nein
a218=Client-Polling aktivieren
a218.help=Gibt an, ob der Sitzungsclient die Sitzungsinformationen durch Polling aktualisieren muss und nicht auf Server-Benachrichtigungen angewiesen sein darf. (Eigenschaftsname: com.iplanet.am.session.client.polling.enable) <br>Hot-swap: Nein
a219=Client-Polling-Periode
a219.help=Zeitdauer in Sekunden, nach der der Sitzungsclient eine Aktualisierung der zwischengespeicherten Sitzungsinformationen vom Server anfordert. (Eigenschaftsname: com.iplanet.am.session.client.polling.period) <br>Hot-swap: Nein
a221=Verschl\u00fcsselungsanbieter
a221.help=Gibt die vom Agent zu verwendende Verschl\u00fcsselungsanbieter-Implementierung an. (Eigenschaftsname: com.iplanet.security.encryptor) <br>Hot-swap: Nein
a222=Benachrichtigung von Benutzerdaten-Caches aktivieren
a222.help=Benachrichtigungen f\u00fcr amsdk und IdRepo-Caches aktivieren. (Eigenschaftsname: com.sun.identity.idm.remote.notification.enabled) <br>Hot-swap: Nein
a223=Polling-Zeit f\u00fcr Benutzerdaten-Cache
a223.help=Cache-Aktualisierungszeit in Minuten f\u00fcr Benutzermanagement-Daten. Wenn dieser Wert auf '0' gesetzt ist, erfolgt keine Aktualisierung. (Eigenschaftsname: com.iplanet.am.sdk.remote.pollingTime) <br>Hot-swap: Nein
a224=Benachrichtigung von Dienstdaten-Caches aktivieren
a224.help=Aktiviert die Benachrichtigungen f\u00fcr Dienstmanagement-Caches. (Eigenschaftsname: com.sun.identity.sm.notification.enabled) <br>Hot-swap: Nein
a225=Zeit f\u00fcr Dienstdaten-Cache 
a225.help=Cache-Aktualisierungszeit in Minuten f\u00fcr Dienstkonfigurationsdaten. Wenn dieser Wert auf '0' gesetzt ist, erfolgt keine Aktualisierung. (Eigenschaftsname: com.sun.identity.sm.cacheTime) <br>Hot-swap: Nein
a229=Protokoll f\u00fcr OpenAM-Authentifizierungsdienst
a229.help=Vom OpenAM-Authentifizierungsdienst zu verwendendes Protokoll. (Eigenschaftsname: com.iplanet.am.server.protocol) <br>Hot-swap: Nein
a231=Hostname f\u00fcr OpenAM-Authentifizierungsdienst
a231.help=Vom OpenAM-Authentifizierungsdienst zu verwendender Hostname. (Eigenschaftsname: com.iplanet.am.server.host) <br>Hot-swap: Nein
a232=Anschluss f\u00fcr OpenAM-Authentifizierungsdienst
a232.help=Vom OpenAM-Authentifizierungsdienst zu verwendender Anschluss. (Eigenschaftsname: com.iplanet.am.server.port) <br>Hot-swap: Nein
a235=Richtlinienbenachrichtigungen aktivieren 
a235.help=Aktiviert Benachrichtigungen f\u00fcr Remote-Richtlinienclient. (Eigenschaftsname: com.sun.identity.agents.notification.enabled) <br>Hot-swap: Nein
a237=Richtlinienclient-Polling-Intervall
a237.help=Dauer in Minuten, nach der die zwischengespeicherten Eintr\u00e4ge vom Remote-Richtlinienclient aktualisiert werden. (Eigenschaftsname: com.sun.identity.agents.polling.interval) <br>Hot-swap: Nein
a238=Richtlinienclient-Cachemodus
a238.help=Vom Remote-Richtlinienclient zu verwendender Cachemodus. (Eigenschaftsname: com.sun.identity.policy.client.cacheMode) <br>Hot-swap: Nein
a239=Boolesche Aktionswerte f\u00fcr Richtlinienclient
a239.help=Boolesche Aktionswerte f\u00fcr Richtlinien-Aktionsnamen. (Eigenschaftsname: com.sun.identity.policy.client.booleanActionValues) <br>Hot-swap: Nein
a241=Ressourcen-Vergleichsoperatoren f\u00fcr Richtlinienclient
a241.help=F\u00fcr unterschiedliche Dienstnamen zu verwendende Ressourcen-Vergleichsoperatoren. (Eigenschaftsname: com.sun.identity.policy.client.resourceComparators) <br>Hot-swap: Nein
a242=Zeitdifferenz f\u00fcr Richtlinienclient
a242.help=Zul\u00e4ssige Zeitdifferenz in Sekunden zwischen OpenAM-Server und Remote-Richtlinienclient.  (Eigenschaftsname: com.sun.identity.policy.client.clockSkew) <br>Hot-swap: Nein
a243=Env GET-Parameter f\u00fcr URL-Richtlinie 
a243.help=Liste von HTTP GET-Anforderungsparametern, deren Namen und Werte in der Umgebungszuordnung f\u00fcr die URL-Richtlinienauswertung auf dem OpenAM-Server gesetzt werden.(Eigenschaftsname: com.sun.identity.agents.config.policy.env.get.param) <br>Hot-Swap: Ja <br> Beispiele: <br> name <br> phonenumber
a244=Env POST-Parameter f\u00fcr URL-Richtlinie
a244.help=Liste von HTTP POST-Anforderungsparametern, deren Namen und Werte in die Umgebungszuordnung f\u00fcr die URL-Richtlinienauswertung auf dem OpenAM-Server gesetzt werden.(Eigenschaftsname: com.sun.identity.agents.config.policy.env.post.param) <br>Hot-Swap: Ja <br> Beispiele: <br> name <br> phonenumber
a245=Env jsession-Parameter f\u00fcr URL-Richtlinie
a245.help=Liste von HTTP SESSION-Attributen, deren Namen und Werte in die Umgebungszuordnung f\u00fcr die URL-Richtlinienauswertung auf dem OpenAM-Server gesetzt werden. (Eigenschaftsname: com.sun.identity.agents.config.policy.env.jsession.param) <br>Hot-Swap: Ja <br> Beispiele: <br> name <br> phonenumber
a246=Benachrichtigung \u00fcber \u00c4nderungen an der Agentenkonfiguration
a246.help=Erm\u00f6glicht dem Agenten, Benachrichtigungsnachrichten vom OpenAM-Server f\u00fcr Konfigurations\u00e4nderungen zu empfangen. (Eigenschaftsname: com.sun.identity.agents.config.change.notification.enable) <br>Hot-swap: Ja
a247=Benutzerdefinierte Eigenschaften
a247.help=Zus\u00e4tzliche Eigenschaften, die es den Benutzern erm\u00f6glichen, den vom Agenten unterst\u00fctzten Eigenschaftensatz zu vergr\u00f6\u00dfern. (Eigenschaftsname: com.sun.identity.agents.config.freeformproperties) <br>Hot-swap: Ja <br> Beispiele: <br> customproperty=custom-value1 <br> customlist[0]=customlist-value-0 <br> customlist[1]=customlist-value-1 <br> custommap[key1]=custommap-value-1 <br> custommap[key2]=custommap-value-2
a248=WebAuthentication verf\u00fcgbar 
a248.help=Erm\u00f6glicht dem Agenten, die Programmier-Authentifizierung beim JBoss-Webcontainer mittels der Funktion WebAuthentication durchzuf\u00fchren. (Eigenschaftsname: com.sun.identity.agents.config.jboss.webauth.available) <br>Hot-Swap: Ja
a250=Deaktiviert
a251=Fehler
a252=Warnung
a253=Nachricht
a254=OpenAM-Abmeldungs-URL
a254.help=URL der OpenAM-Abmeldungsseite. (Eigenschaftsname: com.sun.identity.agents.config.logout.url) <br>Hot-Swap: Ja <br> Beispiel: <br> http://host:port/opensso/UI/Logout
a255=Abmeldungs-URL priorisiert
a255.help=Gibt an, ob die Failover-Folge f\u00fcr Abmeldungs-URLs entsprechend der Liste der URLs f\u00fcr OpenAM-Anmeldung priorisiert werden soll. (Eigenschaftsname: com.sun.identity.agents.config.logout.url.prioritized) <br>Hot-Swap: Ja
a256=Abmeldungs-URL-Test
a256.help=Gibt an, ob der Agent die Verf\u00fcgbarkeit dieser URLs pr\u00fcft, bevor er eine Anfrage zu ihnen umleitet. (Eigenschaftsname: com.sun.identity.agents.config.logout.url.probe.enabled) <br>Hot-Swap: Ja
a257=Zeit\u00fcberschreitung f\u00fcr Abmeldungs-URL-Test
a257.help=Zeitdauer in Millisekunden, nach der eine Zeit\u00fcberschreitungs-Fehlermeldung ausgegeben wird (Abmeldungs-URL-Test muss auf TRUE gesetzt sein). (Eigenschaftsname: com.sun.identity.agents.config.logout.url.probe.timeout) <br>Hot-Swap: Ja


# WSS Agents properties
a301=Sicherheitsmechanismus
a302=STS-Konfiguration
a302.help=Ist erforderlich, wenn Sicherheitsmechanismus auf STSSecurity eingestellt ist
a303=Konfiguration von Erkennung
a303.help=Ist erforderlich, wenn Sicherheitsmechanismus auf LibertyDiscoverySecurity eingestellt ist
a304=Benutzerauthentifizierung erforderlich
a305=Ist Anforderung signiert aktiviert
a306=Ist Anforderungskopfzeile verschl\u00fcsselt
a307=Ist Anforderungstext verschl\u00fcsselt
a308=Ist Antwortsignatur gepr\u00fcft
a309=Ist Antwort verschl\u00fcsselt
a309.help=Nur bei verschl\u00fcsseltem Text verschl\u00fcsselt.
a310=Sicherheitskopfzeilen in Meldung beibehalten
a311=Standardschl\u00fcsselspeicher verwenden
a312=Speicherort von Schl\u00fcsselspeicher
a313=Passwort von Schl\u00fcsselspeicher
a314=Passwort von Schl\u00fcssel
a315=Alias von privatem Schl\u00fcssel
a315.help=Schl\u00fcssel zum Signieren der Webdienstanforderung.
a316=Alias von \u00f6ffentlichem Schl\u00fcssel des Webdienstanbieters
a316.help=Schl\u00fcssel f\u00fcr Verschl\u00fcsselung der Webdienstanforderung.
a317=Endpunkt des Web Service
a317.help=Dieser Endpunkt ist optional, es sei denn, der Webdienstanbieter ist f\u00fcr die Verwendung von Liberty-Tokens konfiguriert.
a318=Endpunkt des Web Service-Sicherheitsproxy
a318.help=Dieser Endpunkt ist optional, es sei denn, er ist f\u00fcr die Verwendung von Webdienstsicherheit-Proxy konfiguriert.
a319=Liberty Service-Typ URN
a319.help=Ist optional, solange der Sicherheitsmechanismus nicht LibertyDiscoverySecurity ist.


a320=Berechtigungsnachweis f\u00fcr Benutzer-Token
a321=Authentifizierungsverkettung
a322=Ist Anforderungssignatur gepr\u00fcft
a323.title=Ist Anforderungsverschl\u00fcsselung aktiviert
a323=Ist Anforderungskopfzeile entschl\u00fcsselt
a323.header=Header
a324=Ist Anforderungstext entschl\u00fcsselt
a324.body=Text
a325=Ist Antwort signiert aktiviert
a326=Ist Antwort verschl\u00fcsselt
a326.help=Nur bei verschl\u00fcsseltem Text verschl\u00fcsselt.
a327=Typ privater Schl\u00fcssel
a328=Alias von \u00f6ffentlichem Schl\u00fcssel des Webdienst-Client
a328.help=Schl\u00fcssel f\u00fcr Verschl\u00fcsselung der Webdienstantwort
a329=Alias von \u00f6ffentlichem Schl\u00fcssel des Security Token Service
a330=Endpunkt des Security Token Service
a331=Endpunkt von Security Token Service MEX
a332=Endpunkt des Discovery Service
a333=Endpunkt des Authentication Web Service
a334=SAML-Attributzuordnung
a335=Mapper-Plugin f\u00fcr SAML-NameID 
a336=Namespace f\u00fcr SAML-Attribute 
a337=Mitgliedschaften einschlie\u00dfen 
a338=Kerberos-Domain-Server
a339=Kerberos-Domain
a340=Kerberos-Dienstprincipal
a341=Kerberos-Schl\u00fcssel-Tabdatei
a342=Kerberos-Signatur verifizieren
a342.help=Dies ist optional und darf nur bei Verwendung von JDK6 aktiviert werden.
a343=Token-Konvertierungstyp
a344=SSOToken
a345=SAML11Token
a346=SAML2Token

a350= Kerberos-Domain-Server
a351= Kerberos-Domain
a352= Kerberos-Dienstprincipal
a353= Cache-Verzeichnis f\u00fcr Kerberos-Ticket
a354= Pass-Through-Sicherheitstoken verwenden
a354.help=G\u00fcltig f\u00fcr Proxy-Webdienst-Client und nur verwendet, wenn die SAML-Sicherheitsmechanismen aktiviert sind.
a355= Referenztyp wird signiert.
a355.help=Dies gilt nur f\u00fcr den Sicherheitsmechanismus des X509-Token.
a356=Direkte Referenz
a357=KeyIdentifier-Referenz
a358=Serielle Referenz des X509-Ausstellers
a359=Verschl\u00fcsselungsalgorithmus
a360=Verschl\u00fcsselungsst\u00e4rke
a360.help=F\u00fcr 3DES sollte die Verschl\u00fcsselungsst\u00e4rke 0, 112 oder 168 und f\u00fcr AES 128, 192 oder 256 verwendet werden.
a361=WS-Trust-Version
a362=Wiederholung des Benutzertokens erkennen
a363=Wiederholung der Nachricht erkennen
a364=Angeforderter Schl\u00fcsseltyp
a365=\u00d6ffentlicher Schl\u00fcssel
a366=Symmetrischer Schl\u00fcssel
a367=Angeforderte Anforderungen
a367.help=Dies sind die vom STS f\u00fcr einen WSP angeforderten Attribute.
a368=DNS-Anforderung
a368.help=DNS-Name, der die Entity eindeutig identifizieren kann.
a369=Signierte Elemente

# Web Agent Properties
a400=Cookie-Name
a400.help=Name des zwischen OpenAM-Server und Agent verwendeten SSO-Token-Cookies. (Eigenschaftsname: com.sun.identity.agents.config.cookie.name)<br>Hot-swap: Nein
a401=Cookie-Sicherheit
a401.help=Agent sendet sichere Cookies, wenn Kommunikation sicher ist. (Eigenschaftsname: com.sun.identity.agents.config.cookie.secure) <br>Hot-swap: Nein
a405=Benachrichtigungen aktivieren
a405.help=Die Benachrichtigungen helfen bei der Wartung von sso-, Richtlinien- und Konfigurationscaches des Agenten. (Eigenschaftsname: com.sun.identity.agents.config.notification.enable) <br>Hot-swap: Nein
a406=Agent-Benachrichtigungs-URL
a406.help=Vom Agent zum Registrieren von Benachrichtigungsempf\u00e4ngern verwendete URL. (Eigenschaftsname: com.sun.identity.client.notification.url) <br>Hot-swap: Nein
a407=Ber\u00fccksichtigung der Gro\u00df-/Kleinschreibung bei URL-Vergleich
a407.help=Erzwingt Gro\u00df-/Kleinschreibung bei Auswertung von Richtlinien und nicht erzwungenen URLs. (Eigenschaftsname: com.sun.identity.agents.config.url.comparison.case.ignore) <br>Hot-swap: Ja
a408=Polling-Periode f\u00fcr Richtliniencache
a408.help=Polling-Intervall in Minuten, in dem der Richtliniencache des Agenten aktualisiert wird. (Eigenschaftsname: com.sun.identity.agents.config.policy.cache.polling.interval) <br>Hot-swap: Nein
a409=Polling-Periode f\u00fcr SSO-Cache 
a409.help=Polling-Intervall in Minuten, in dem der SSO-Cache des Agenten aktualisiert wird. (Eigenschaftsname: com.sun.identity.agents.config.sso.cache.polling.interval) <br>Hot-swap: Nein
a410=Benutzerkennungsparameter
a410.help=Agent setzt den Wert der Benutzer-ID auf die Servervariable REMOTE_USER. (Eigenschaftsname: com.sun.identity.agents.config.userid.param) <br>Hot-swap: Ja
a411=Benutzerkennungsparametertyp
a411.help=Benutzer-ID kann aus Sitzungs- und LDAP-Attribut abgerufen werden. (Eigenschaftsname: com.sun.identity.agents.config.userid.param.type) <br>Hot-swap: Ja
a412=Abrufmodus f\u00fcr Profilattribut
a412.help= (Eigenschaftsname: com.sun.identity.agents.config.profile.attribute.fetch.mode) <br>Hot-swap: Ja
a413=Zuordnung der Profilattribute
a413.help=Ordnet die unter bestimmten Namen zu f\u00fcllenden Profilattribute f\u00fcr den aktuell authentifizierten Benutzer zu. (Eigenschaftsname: com.sun.identity.agents.config.profile.attribute.mapping) <br>Hot-swap: Ja <br> Beispiel: <br> So f\u00fcllen Sie den Wert des Profilattributs cn mit dem Namen CUSTOM-Common-Name aus: Geben Sie cn in das Feld f\u00fcr den Zuordnungsschl\u00fcssel  und CUSTOM-Common-Name in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. <br> So f\u00fcllen Sie den Wert des Profilattributs mail mit dem Namen CUSTOM-Email aus: Geben Sie mail in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und CUSTOM-Email in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. 
a414=Sitzungsattribut-Abrufmodus
a414.help= (Eigenschaftsname: com.sun.identity.agents.config.session.attribute.fetch.mode) <br>Hot-swap: Ja
a415=Zuordnung der Sitzungsattribute
a415.help=Ordnet die unter bestimmten Namen zu f\u00fcllenden Sitzungsattribute f\u00fcr den aktuell authentifizierten Benutzer zu. (Eigenschaftsname: com.sun.identity.agents.config.session.attribute.mapping) <br>Hot-swap: Ja <br> Beispiel: <br> So f\u00fcllen Sie den Wert des Sitzungsattributs UserToken mit dem Namen CUSTOM-userid aus: Geben Sie UserToken in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und CUSTOM-userid in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. 
a416=Reaktionsattribut-Abrufmodus
a416.help= (Eigenschaftsname: com.sun.identity.agents.config.response.attribute.fetch.mode) <br>Hot-swap: Ja
a417=Zuordnung der Reaktionsattribute
a417.help=Ordnet die unter bestimmten Namen zu f\u00fcllenden Richtlinien-Reaktionsattribute f\u00fcr den aktuell authentifizierten Benutzer zu. (Eigenschaftsname: com.sun.identity.agents.config.response.attribute.mapping) <br>Hot-swap: Ja <br> Beispiel: <br> So f\u00fcllen Sie den Wert des Reaktionsattributs uid mit dem Namen CUSTOM-USER-NAME aus: Geben Sie uid in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und CUSTOM-USER-NAME in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein. 
a418=Trennzeichen f\u00fcr Attributwerte
a418.help=Von Profil, Sitzung und Reaktionsattributzuordnungen verwendetes Trennzeichen. (Eigenschaftsname: com.sun.identity.agents.config.attribute.multi_value_separator) <br>Hot-swap: Ja
a419=Lastverteilungs-Konfiguration
a419.help=Auf true setzen, wenn f\u00fcr die OpenAM-Dienste eine Lastverteilung verwendet wird. (Eigenschaftsname: com.sun.identity.agents.config.load.balancer.enable) <br>Hot-swap: Nein
a420=Serverpr\u00fcfung ignorieren 
a420.help=Anhand dieses Wertes pr\u00fcft der Agent vor einer 302 Umleitung, ob OpenAM erreichbar ist. (Eigenschaftsname: com.sun.identity.agents.config.ignore.server.check) <br>Hot-swap: Ja
a421=Bevorzugte Benennungs-URL in Benennungsanforderung
a421.help=Mit diesem Wert sendet der Agent die bevorzugte Benennungs-URL in der Benennungsanforderung. (Eigenschaftsname: com.sun.identity.agents.config.ignore.preferred.naming.url) <br>Hot-swap: Ja
a422=Abrufperiode f\u00fcr prim\u00e4ren Server
a422.help=Intervall in Minuten in dem der Agent den prim\u00e4ren Server abfragt, um dessen Verf\u00fcgbarkeit zu pr\u00fcfen. (Eigenschaftsname: com.sun.identity.agents.config.poll.primary.server) <br>Hot-swap: Nein
a423=URL f\u00fcr OpenAM-Anmeldung
a423.help=URL der OpenAM-Anmeldeseite. (Eigenschaftsname: com.sun.identity.agents.config.login.url) <br>Hot-Swap: Ja <br> Beispiel: <br> http://host:port/opensso/UI/Login
a426=URI-Pr\u00e4fix f\u00fcr Agent-Bereitstellung
a426.help=(Eigenschaftsname: com.sun.identity.agents.config.agenturi.prefix)<br>Hot-swap: Ja
a427=Agent-Gebietsschema
a427.help=Standardgebietsschema f\u00fcr das Produkt. (Eigenschaftsname: com.sun.identity.agents.config.locale) <br>Hot-swap: Nein
a428=Modus Nur SSO
a428.help=Agent erzwingt Authentifizierung (SSO), aber keine Autorisierung f\u00fcr Richtlinien. (Eigenschaftsname: com.sun.identity.agents.config.sso.only) <br>Hot-swap: Ja
a429=URL f\u00fcr verweigerten Ressourcenzugriff
a429.help=URL der benutzerdefinierten Seite bei verweigertem Zugriff. (Eigenschaftsname: com.sun.identity.agents.config.access.denied.url) <br>Hot-swap: Ja
a430=FQDN-Pr\u00fcfung
a430.help=Aktiviert die Pr\u00fcfung des fqdn-Standardwerts und der fqdn-Zuordnungswerte. (Eigenschaftsname: com.sun.identity.agents.config.fqdn.check.enable) <br>Hot-swap: Ja
a431=FQDN-Standard
a431.help=Voll qualifizierter Hostname, den die Benutzer zum Zugriff auf die Ressourcen verwenden m\u00fcssen. (Eigenschaftsname: com.sun.identity.agents.config.fqdn.default) <br>Hot-swap: Ja
a432=Virtuelle FQDN-Host-Zuordnung
a432.help=Erm\u00f6glicht den Zugriff auf gesch\u00fctzte Ressourcen \u00fcber virtuelle Hosts, partielle Hostnamen und IP-Adressen. Ordnet ung\u00fcltigen Schl\u00fcssel einem g\u00fcltigen Wert zu. (Eigenschaftsname: com.sun.identity.agents.config.fqdn.mapping) <br>Hot-swap: Ja <br> Beispiel: <br>So ordnen Sie myserver zu myserver.mydomain.com zu: Geben Sie myserver in das Feld f\u00fcr den Zuordnungsschl\u00fcssel und dmyserver.mydomain.com in das Feld f\u00fcr den zugeh\u00f6rigen Zuordnungswert ein.
a433=Cookie zur\u00fccksetzen
a433.help=Agent setzt Cookies in der Reaktion zur\u00fcck, ehe die Anfrage zur Authentifizierung umgeleitet wird. (Eigenschaftsname: com.sun.identity.agents.config.cookie.reset.enable) <br>Hot-swap: Ja
a434=Namensliste der zur\u00fcckzusetzenden Cookies
a434.help=Liste von Cookies im Format: Name[=Wert][;Dom\u00e4ne=Wert]. (Eigenschaftsname: com.sun.identity.agents.config.cookie.reset) <br>Hot-Swap: Ja\u00b7<br> Beispiele: <br> Cookie1 <br> Cookie2=Wert;Dom\u00e4ne=Unterdom\u00e4ne.Dom\u00e4ne.com
a435=Dom\u00e4nen\u00fcbergreifendes SSO
a435.help=Aktiviert dom\u00e4nen\u00fcbergreifendes Single Sign On. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.enable) <br>Hot-swap: Ja
a436=Standardwert f\u00fcr anonyme Benutzer 
a436.help=Benutzer-ID nicht autentifizierter Benutzer. (Eigenschaftsname: com.sun.identity.agents.config.anonymous.user.id) <br>Hot-swap: Ja
a437=Anonymer Benutzer
a437.help=Aktiviert/Deaktiviert REMOTE_USER-Verarbeitung f\u00fcr anonyme Benutzer. (Eigenschaftsname: com.sun.identity.agents.config.anonymous.user.enable) <br>Hot-swap: Ja
a438=Nicht erzwungene URLs
a438.help=Liste von URLs, f\u00fcr die keine Authentifizierung erforderlich ist. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.url) <br>Hot-Swap: Ja <br> Beispiel: <br> http://EigenerAgent.EigeneDom\u00e4ne.com/*.gif 
a439=Nicht erzwungene URLs umkehren
a439.help=Nur die URLs auf der Liste nicht erzwungener URLs werden erzwungen. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.url.invert) <br>Hot-swap: Ja
a440=IP-Liste nicht erzwungener Clients
a440.help=F\u00fcr Anforderungen von diesen Client-IP-Adressen ist keine Authentifizierung erforderlich. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.ip) <br>Hot-Swap: Ja <br> Beispiel: <br> 192.18.145.* <br> 192.18.146.123
a441=POST-Daten-Bewahrung
a441.help=Aktiviert die POST-Daten-Bewahrung.(Eigenschaftsname: com.sun.identity.agents.config.postdata.preserve.enable) <br> Beachten Sie, dass diese Funktion nicht von allen Web-Agenten unterst\u00fctzt wird. N\u00e4heres finden Sie in der Dokumentation zu dem jeweiligen Agenten. <br>Hotswap: Ja
a442=Cache-Periode f\u00fcr POST-Dateneintr\u00e4ge 
a442.help=Lebensdauer der Eintr\u00e4ge im POST-Cache in Minuten. (Eigenschaftsname: com.sun.identity.agents.config.postcache.entry.lifetime) <br>Hot-swap: Ja
a443=CDSSO-Servlet-URL
a443.help=Liste von URLs der verf\u00fcgbaren CDSSO-Controller, die vom Agent f\u00fcr die CDSSO-Verarbeitung verwendet werden k\u00f6nnen. (Eigenschaftsname: com.sun.identity.agents.config.cdsso.cdcservlet.url) <br>Hot-Swap: Ja <br> Beispiel: <br> http://host:port/opensso/cdcservlet
a444=Cookies-Dom\u00e4nenliste
a444.help=Dom\u00e4nen, f\u00fcr die in einem CDSSO-Szenario Cookies gesetzt werden m\u00fcssen.(Eigenschaftsname: com.sun.identity.agents.config.cdsso.cookie.domain) <br>Hot-Swap: Ja <br> Beispiel: <br> .sun.com
a445=Client-IP-Validierung
a445.help=\u00dcberpr\u00fcft, ob die folgenden Browseranforderungen von derselben IP-Adresse stammen, f\u00fcr die das SSO-Token urspr\u00fcnglich ausgegeben wurde. (Eigenschaftsname: com.sun.identity.agents.config.client.ip.validation.enable) <br>Hot-swap: Ja
a446=Pr\u00e4fix f\u00fcr Profilattribut-Cookies
a446.help=Setzt das Cookiepr\u00e4fix in den Kopfzeilen der Attribute. (Eigenschaftsname: com.sun.identity.agents.config.profile.attribute.cookie.prefix) <br>Hot-swap: Ja
a447=Maximales Alter f\u00fcr Profilattribut-Cookies
a447.help=Maximales Alter der Kopfzeilen der Attribut-Cookies. (Eigenschaftsname: com.sun.identity.agents.config.profile.attribute.cookie.maxage) <br>Hot-swap: Ja
a448=Abmeldungs-URL-Liste
a448.help=Liste der Abmeldungs-URLs der Anwendung. Benutzer wird von der OpenAM-Sitzung abgemeldet, wenn auf diese URLs zugegriffen wird. (Eigenschaftsname: com.sun.identity.agents.config.agent.logout.url). Wird diese Eigenschaft verwendet, muss der Benutzer einen Wert f\u00fcr die nachfolgende Eigenschaft f\u00fcr Abmeldungsumleitungs-URL angeben.<br>Hotswap: Ja <br> Beispiel: <br> http://meinagent.meinedom\u00e4ne.com/logout.html
a449=Abmeldungscookies-Liste zum Zur\u00fccksetzen
a449.help=Alle bei der Abmeldung zur\u00fcckzusetzenden Cookies im selben Format wie die Liste zur\u00fcckzusetzender Cookies. (Eigenschaftsname: com.sun.identity.agents.config.logout.cookie.reset) <br>Hot-Swap: Ja\u00b7<br> Cookie1 <br> Cookie2=Wert;Dom\u00e4ne=Unterdom\u00e4ne.Dom\u00e4ne.com
a450=Abruf Richtlinien von Root-Ressource
a450.help=Agent speichert Richtlinienentscheidungen der Ressource und aller Ressourcen vom Root der Ressource abw\u00e4rts zwischen. (Eigenschaftsname: com.sun.identity.agents.config.fetch.from.root.resource) <br>Hot-swap: Nein
a451=Client-Hostnamen abrufen
a451.help=Ruft \u00fcber DNS-Reverse-Lookup den Client-Hostnamen f\u00fcr die Richtlinienauswertung ab. (Eigenschaftsname: com.sun.identity.agents.config.get.client.host.name) <br>Hot-swap: Ja
a452=Native Kodierung von Profilattributen
a452.help=Agent kodiert die LDAP-Kopfzeilenwerte in der Standardkodierung des Gebietsschemas des Betriebssystems. Wenn false, wird UTF-8 verwendet. (Eigenschaftsname: com.sun.identity.agents.config.convert.mbyte.enable) <br>Hot-swap: Ja
a453=Sonderzeichen der URL kodieren
a453.help=Kodiert URL mit Sonderzeichen vor der Richtlinienauswertung. (Eigenschaftsname: com.sun.identity.agents.config.encode.url.special.chars.enable) <br>Hot-swap: Ja
a454=Pfad-Info in Anforderungs-URL ignorieren 
a454.help=Aus der Pfadinformation wird beim \u00dcberpr\u00fcfen der Liste nicht erzwungener Elemente und der URL-Richtlinienbewertung der Anforderungs-URL entfernt, wenn der Wert mit true festgelegt ist. (Eigenschaftsname: com.sun.identity.agents.config.ignore.path.info) <br>Hot-swap: Ja
a455=Protokoll f\u00fcr Anforderungs-URL \u00fcbergehen
a455.help=Auf true setzen, wenn sich der Agent hinter einem SSL-Offloader, einer Lastverteilung oder Proxy befindet. (Eigenschaftsname: com.sun.identity.agents.config.override.protocol) <br>Hot-swap: Ja
a456=Host f\u00fcr Anforderungs-URL \u00fcbergehen
a456.help=Auf true setzen, wenn sich der Agent hinter einem SSL-Offloader, einer Lastverteilung oder Proxy befindet. (Eigenschaftsname: com.sun.identity.agents.config.override.host) <br>Hot-swap: Ja
a457=Anschluss f\u00fcr Anforderungs-URL \u00fcbergehen
a457.help=Auf true setzen, wenn sich der Agent hinter einem SSL-Offloader, einer Lastverteilung oder Proxy befindet. (Eigenschaftsname: com.sun.identity.agents.config.override.port) <br>Hot-swap: Ja
a458=Benachrichtigungs-URL \u00fcbergehen
a458.help=Auf true setzen, wenn sich der Agent hinter einem SSL-Offloader, einer Lastverteilung oder Proxy befindet. (Eigenschaftsname: com.sun.identity.agents.config.override.notification.url) <br>Hot-swap: Ja
a459=Agent-Verbindungs-Timeout
a459.help=Zeit\u00fcberschreitungsdauer in Sekunden f\u00fcr Agent-Verbindungen mit OpenAM-auth-Server. (Eigenschaftsname: com.sun.identity.agents.config.auth.connection.timeout) <br>Hot-swap: Ja
a460=Abrufperiode f\u00fcr prim\u00e4ren Server
a460.help=Intervall in Minuten in dem der Agent den prim\u00e4ren Server abfragt, um dessen Verf\u00fcgbarkeit zu pr\u00fcfen. (Eigenschaftsname: com.sun.identity.agents.config.poll.primary.server) <br>Hot-swap: Nein
a461=Agent-Gebietsschema
a461.help=Standardgebietsschema f\u00fcr das Produkt. (Eigenschaftsname: com.sun.identity.agents.config.locale) <br>Hot-swap: Nein
a462=Host und Anschluss des Proxyservers \u00fcbergehen
a462.help=(Eigenschaftsname: com.sun.identity.agents.config.proxy.override.host.port) <br>Hot-swap: Nein
a463=Neulade-Intervall f\u00fcr Konfiguration
a463.help=Intervall in Minuten, in dem die Agent-Konfiguration vom OpenAM abgerufen wird. (Eigenschaftsname: com.sun.identity.agents.config.polling.interval) <br>Hot-swap: Nein
a464=Intervall f\u00fcr Konfigurations-Bereinigung
a464.help=Intervall in Minuten zur Bereinigung alter Agentenkonfigurationseintr\u00e4ge. (Eigenschaftsname: com.sun.identity.agents.config.cleanup.interval) <br>Hot-swap: Nein
a465=Benutzerdefinierte Eigenschaften
a465.help=Zus\u00e4tzliche Eigenschaften, die es den Benutzern erm\u00f6glichen, den vom Agenten unterst\u00fctzten Eigenschaftensatz zu vergr\u00f6\u00dfern. (Eigenschaftsname: com.sun.identity.agents.config.freeformproperties) <br>Hot-swap: Ja <br> Beispiele: <br> customproperty=custom-value1 <br> customlist[0]=customlist-value-0 <br> customlist[1]=customlist-value-1 <br> custommap[key1]=custommap-value-1 <br> custommap[key2]=custommap-value-2
a467=Attribute f\u00fcr nicht erzwungene URLs abrufen
a467.help=Agent ruft Profilattribute f\u00fcr nicht erzwungene URLs per Richtlinienauswertung ab. (Eigenschaftsname: com.sun.identity.agents.config.notenforced.url.attributes.enable) <br>Hot-swap: Ja
a468=Fehler
a469=Warnung
a470=Info
a471=Nachricht
a472=Alle
a473=HOCH
a474=NIEDRIG
a475=MITTEL
a476=STANDARD
a477=Authentifizierungstyp 
a477.help=(Eigenschaftsname: com.sun.identity.agents.config.iis.auth.type) 
a478=Wiedergabe-Passwortschl\u00fcssel 
a478.help=DES-Schl\u00fcssel zur Entschl\u00fcsselung des grundlegenden Authentifizierungspassworts der Sitzung. (Eigenschaftsname: com.sun.identity.agents.config.replaypasswd.key) 
a479=Filterpriorit\u00e4t 
a479.help=Die Ladepriorit\u00e4t des Filters.(Eigenschaftsname: com.sun.identity.agents.config.iis.filter.priority)
a480=Filter konfiguriert mit OWA 
a480.help=Auf true setzen, wenn der IIS-Agentfilter f\u00fcr OWA konfiguriert ist.(Eigenschaftsname: com.sun.identity.agents.config.iis.owa.enable)
a481=URL-Protokoll zu https \u00e4ndern 
a481.help=Verhindert Sicherheitswarnungen in IE6, wenn true. (Eigenschaftsname: com.sun.identity.agents.config.iis.owa.enable.change.protocol)
a482=URL der Timeout-Seite f\u00fcr passive Sitzungen
a482.help=URL der benutzerdefinierten Seite bei Timeout wegen passiver Sitzung. (Eigenschaftsname: com.sun.identity.agents.config.iis.owa.enable.session.timeout.url) 
a483=Benutzer in Domino-Datenbank pr\u00fcfen
a483.help=Wenn true, pr\u00fcft der Agent die Existenz des Benutzers in der Domino-Namensdatenbank. (Eigenschaftsname: com.sun.identity.agents.config.domino.check.name.database) 
a484=LTPA-Token verwenden
a484.help=Auf true setzen, wenn Agent LTPA-Token verwenden muss. (Eigenschaftsname: com.sun.identity.agents.config.domino.ltpa.enable)
a485=Cookie-Name f\u00fcr LTPA-Token 
a485.help=Name des Cookies, das das LTPA-Token enth\u00e4lt. (Eigenschaftsname: com.sun.identity.agents.config.domino.ltpa.cookie.name) 
a486=Konfigurationsname f\u00fcr LTPA-Token
a486.help=Konfigurationsname, der vom Agent zur Anwendung des LTPA-Token-Mechanismus verwendet wird. (Eigenschaftsname: com.sun.identity.agents.config.domino.ltpa.config.name) 
a487=Organisationsname f\u00fcr LTPA-Token
a487.help=Der Organisationsname, zu dem das LTPA-Token geh\u00f6rt. (Eigenschaftsname: com.sun.identity.agents.config.domino.ltpa.org.name)
a488=Zeitdifferenz f\u00fcr Richtlinie
a488.help=Zeit in Sekunden, mit der die Zeitdifferenz zwischen Agent und OpenAM korrigiert wird. Zeitdifferenz in Sekunden = AgentTime - OpenAMServerTime. (Eigenschaftsname: com.sun.identity.agents.config.policy.clock.skew) <br>Hot-swap: Nein
a489=\u00dcberwachungszugriffstypen
a489.help=Typen von zu protokollierenden Nachrichten auf der Grundlage der URL-Zugriffsversuche der Benutzer. (Eigenschaftsname: com.sun.identity.agents.config.audit.accesstype) <br>Hot-swap: Ja
a490=\u00dcberwachungsprotokoll-Speicherort
a490.help=Gibt an wo \u00dcberwachungsnachrichten protokolliert werden. (Eigenschaftsname: com.sun.identity.agents.config.log.disposition) <br>Hot-swap: Ja
a491=Name der Remote-Protokolldatei 
a491.help=Name der auf dem OpenAM-Server gespeicherten Datei mit den \u00dcberwachungsnachrichten des Agenten.  (Eigenschaftsname: com.sun.identity.agents.config.remote.logfile) <br>Hot-swap: Nein
a492=Intervall f\u00fcr Remote-\u00dcberwachungsprotokoll
a492.help=Regelm\u00e4\u00dfiges Intervall in Minuten, in dem \u00dcberwachungsprotokollnachrichten an die Remote-Protokolldatei gesendet werden. (Eigenschaftsname: com.sun.identity.agents.config.remote.log.interval) <br>Hot-swap: Nein
a493=Lokales \u00dcberwachungsprotokoll rotieren 
a493.help=Flag, das anzeigt, dass die \u00dcberwachungsprotokolldateien zu rotieren sind, sobald eine bestimmte Gr\u00f6\u00dfe erreicht wird. (Eigenschaftsname: com.sun.identity.agents.config.local.log.rotate) <br>Hot-swap: Ja
a494=Rotationsgr\u00f6\u00dfe f\u00fcr lokales \u00dcberwachungsprotokoll
a494.help=Gr\u00f6\u00dfe in Byte, bei der eine neue lokale \u00dcberwachungsprotokolldatei f\u00fcr die Rotation angelegt wird. (Eigenschaftsname: com.sun.identity.agents.config.local.log.size) <br>Hot-swap: Ja
a495=Agent-Debug-Ebene
a495.help=Agent-Debug-Ebene.  (Eigenschaftsname: com.sun.identity.agents.config..debug.level) <br>Hot-swap: Ja
a496=Dateirotation bei Agent-Debug-Datei
a496.help=Debug-Datei wird auf der Grundlage der angegebenen Gr\u00f6\u00dfe rotiert. (Eigenschaftsname: com.sun.identity.agents.config.debug.file.rotate) <br>Hot-Swap: Ja
a497=Gr\u00f6\u00dfe der Agent-Debug-Datei
a497.help=Gr\u00f6\u00dfe der Agent-Debug-Datei in Byte. (Eigenschaftsname: com.sun.identity.agents.config.debug.file.size) <br>Hot-Swap: Ja
a498=Trennzeichen bei mehreren Attributwerten 
a498.help=Gibt einen Separator f\u00fcr mehrere Werte an. Gilt f\u00fcr alle Attributtypen, also Profil-, Sitzungs- und Reaktionsattribute. (Eigenschaftsname: com.sun.identity.agents.config.attribute.multi.value.separator) <br>Hot-swap: Ja
a499=Abmeldungsumleitungs-URL
a499.help= Benutzer wird nach dem Abmelden an diese URL umgeleitet.(Name der Eigenschaft: com.sun.identity.agents.config.logout.redirect.url). Diese Eigenschaft muss zusammen mit der oben angegebenen Abmeldungs-URL-Liste angegeben werden.<br>Hotswap: Ja


# 2.2 Policy Agent properties
a500=Beschreibung
a501=Agent-Schl\u00fcsselwert(e)
a501.help=Legen Sie die Agenteneigenschaften mit einem Schl\u00fcssel-/Wert-Paar fest. Diese Eigenschaft wird von OpenAM dazu verwendet, Agentenanforderungen f\u00fcr Anmeldeangaben-Assertionen \u00fcber\u00b7Benutzer zu empfangen. Derzeit ist nur eine einzige Eigenschaft g\u00fcltig, und alle sonstigen Eigenschaften werden ignoriert. Verwenden Sie das folgende Format: <br> agentRootURL=protocol://hostname:port/ <br> Der Eintrag muss pr\u00e4zise sein, und bei agentRootURL wird nach Gro\u00df- und Kleinschreibung unterschieden.

# Agent Authenticator properties
a600=Agentenprofile, die gelesen werden k\u00f6nnen.
a601=Agenten-Root-URL f\u00fcr CDSSO
a601.help=Agenten-Root-URL f\u00fcr CDSSO. Die g\u00fcltige Wert hat folgendes Format: <br>protokoll://hostname:anschluss/<br> Protokoll steht f\u00fcr das verwendete Protokoll wie zum Beispiel http oder https. Hostname steht f\u00fcr den Hostnamen des Computers, auf dem der Agent installiert ist. Anschluss steht f\u00fcr die Anschlussnummer, unter der der Agent installiert ist. Der Schr\u00e4gstrich nach der Anschlussnummer ist erforderlich. 

# UI properties
wss.header.general=Allgemein
wss.header.security=Sicherheit
wss.header.signencrypt=Signierung und Verschl\u00fcsselung
wss.header.signing=Signieren
wss.header.signing.Body=Text
wss.header.signing.SecurityToken=SecurityToken
wss.header.signing.Timestamp=Zeitstempel
wss.header.signing.To=Bis
wss.header.signing.From=Von
wss.header.signing.ReplyTo=ReplyTo
wss.header.signing.Action=Vorgang
wss.header.signing.MessageID=MessageID
wss.header.encryption=Verschl\u00fcsselung
wss.header.keystore=Schl\u00fcsselspeicher
wss.header.endpoints=Endpunkte
wss.header.saml.configuration=SAML-Konfiguration
wss.header.kerberos=Kerberos-Konfiguration
blank.header=
label.Yes=Ja
web.services.profile.username-token-header=Berechtigungsnachweis f\u00fcr Benutzer-Token
label.agentgroup=Gruppe
keystore.usage=Schl\u00fcsselspeicherauslastung
keystore.usage.default=Standard
keystore.usage.custom=Benutzerdefiniert
keystore.information=Speicherort von Schl\u00fcsselspeicher (obligatorisch, wenn 'Standard verwenden' f\u00fcr Schl\u00fcsselspeicher nicht aktiviert ist).
entity.attribute.label.uuid=Universelle Kennung
entity.attribute.label.identityType=Typ
web.services.profile.usernametokenname=Name
web.services.profile.usernametokenpassword=Passwort
