#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2012 Open Source Solution Technology Corporation. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# http://forgerock.org/license/CDDLv1.0.html
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at http://forgerock.org/license/CDDLv1.0.html
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#

# Portions Copyrighted 2013-2014 ForgeRock AS
# Portions Copyrighted 2014 Nomura Research Institute, Ltd
# Portions Copyrighted 2014 Open Source Solution Technology Corporation

# module descriptor (shows up on OpenAM Console)
description = OAuth 2.0

# localization for module configuration
a101=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ID
a101.help=OAuth client_id \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3002
a101.help.txt=OAuth client_id \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u3064\u3044\u3066\u306e\u8a73\u7d30\u306f\u3001\
<a href="http://tools.ietf.org/pdf/draft-ietf-oauth-v2-12.pdf" target="_blank">OAuth IETF draft</a> \u3001chapter 2.1\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
a102=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30b7\u30fc\u30af\u30ec\u30c3\u30c8
a102.help=OAuth client_secret \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3002
a102.help.txt=OAuth client_secret\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u3064\u3044\u3066\u306e\u8a73\u7d30\u306f\u3001\
<a href="http://tools.ietf.org/pdf/draft-ietf-oauth-v2-12.pdf" target="_blank">OAuth IETF draft</a> \u3001chapter 2.1\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
a103=\u8a8d\u8a3c\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8 URL
a103.help=OAuth \u8a8d\u8a3c\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8 URL \u3002
a103.help.txt=OAuth \u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306b\u3088\u3063\u3066\u63d0\u4f9b\u3055\u308c\u308b OAuth \u8a8d\u8a3c\u7528\u306e URL \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3067\u3059\u3002
a104=\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8 URL
a104.help=OAuth \u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8 URL \u3002
a104.help.txt=OAuth \u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306b\u3088\u3063\u3066\u63d0\u4f9b\u3055\u308c\u308b\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u53d6\u5f97\u7528\u306e URL \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3067\u3059\u3002 \
<a href="http://tools.ietf.org/pdf/draft-ietf-oauth-v2-12.pdf" target="_blank">OAuth IETF draft</a> \u3001 chapter 3.2\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
a105=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30b5\u30fc\u30d3\u30b9 URL
a105.help=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u60c5\u5831 URL \u3002
a105.help.txt=\u3053\u306e URL \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306f\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u60c5\u5831\u3092\u63d0\u4f9b\u3057\u3001 OAuth \u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306b\u3088\u3063\u3066\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u3053\u306e URL \u306f\u3001\u5fdc\u7b54\u3067 JSON \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u8fd4\u3057\u307e\u3059\u3002
a106=\u30b9\u30b3\u30fc\u30d7
a106.help=OAuth \u30b9\u30b3\u30fc\u30d7; \u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u30ea\u30b9\u30c8
a106.help.txt=OAuth \u30b9\u30b3\u30fc\u30d7\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30b5\u30fc\u30d3\u30b9\u304b\u3089\u691c\u7d22\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u60c5\u5831\u306e\u30bf\u30a4\u30d7\u3092\u5b9a\u7fa9\u3059\u308b\u5024\u3092\u30ab\u30f3\u30de\u3067\u5206\u96e2\u3055\u308c\u305f\u30ea\u30b9\u30c8\u3067\u3059\u3002\
\u5024\u306f\u3001OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u4e2d\u306e\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30e6\u30fc\u30b6\u30fc\u304c\u4e0e\u3048\u305f\u8a31\u53ef\u306e\u30bf\u30a4\u30d7\u306b\u4f9d\u5b58\u3057\u307e\u3059\u3002\
<br/><br/>\u4f8b: <code>email, read_stream</code>
a107=OAuth2 \u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30b5\u30fc\u30d3\u30b9\u30d1\u30e9\u30e1\u30fc\u30bf\u540d
a107.help=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30b5\u30fc\u30d3\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u969b\u306b\u3001\u30a2\u30af\u30bb\u30b9\u30c8\u30fc\u30af\u30f3\u306e\u5024\u3092\u542b\u3081\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u540d\u524d\u3002
a108=\u30d7\u30ed\u30ad\u30b7\u30fcURL
a108.help=OpenAM OAuth \u30d7\u30ed\u30ad\u30b7\u30fc JSP \u3078\u306e URL \u3002
a108.help.txt=\u5916\u90e8\u30b5\u30fc\u30d0\u30fc\u304c GET \u304b\u3089 POST \u3078\u306e\u30d7\u30ed\u30ad\u30b7\u30fc\u3068\u3057\u3066\u52d5\u4f5c\u3057\u3066\u3044\u308c\u3070\u3001\u3053\u306e URL \u3060\u3051\u304c\u30c7\u30d5\u30a9\u30eb\u30c8\u304b\u3089\u5909\u66f4\u3055\u308c\u308b\u3079\u304d\u3067\u3059\u3002\
\u30c7\u30d5\u30a9\u30eb\u30c8\u306f <code>/openam/oauth2c/OAuthProxy.jsp</code> \u3067\u3059\u3002
a109=\u30a2\u30ab\u30a6\u30f3\u30c8\u30de\u30c3\u30d1\u30fc
a109.help=\u30a2\u30ab\u30a6\u30f3\u30c8\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u5b9f\u88c5\u3059\u308b\u30af\u30e9\u30b9\u306e\u540d\u524d\u3002
a109.help.txt=\u3053\u306e\u30af\u30e9\u30b9\u306f\u3001 OAuth \u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304b\u3089 OpenAM \u306b\u53d7\u4fe1\u3057\u305f\u30a2\u30ab\u30a6\u30f3\u30c8\u60c5\u5831\u3092\u30de\u30c3\u30d7\u3059\u308b\u305f\u3081\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u3088\u3063\u3066\u3001\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\
<br/><br/>\u3053\u306e\u30af\u30e9\u30b9\u306f <code>org.forgerock.openam.authentication.modules.oauth2.AccountMapper</code>\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
a110=\u30a2\u30ab\u30a6\u30f3\u30c8\u30de\u30c3\u30d1\u30fc\u8a2d\u5b9a
a110.help=\u30ed\u30fc\u30ab\u30eb\u306e OpenAM \u30a2\u30ab\u30a6\u30f3\u30c8\u3078\u306e OAuth \u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u3002
a110.help.txt=OpenAM \u306e\u30ed\u30fc\u30ab\u30eb\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u3078 OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u3067\u8a8d\u8a3c\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30de\u30c3\u30d7\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u8a2d\u5b9a\u3067\u3059\u3002\
\u4f8b: <code>OAuth2.0_attribute=local_attribute</code>
a111=\u5c5e\u6027\u30de\u30c3\u30d1\u30fc
a111.help=\u5c5e\u6027\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u5b9f\u88c5\u3059\u308b\u30af\u30e9\u30b9\u306e\u540d\u524d\u3002
a111.help.txt=\u3053\u306e\u30af\u30e9\u30b9\u306f OAuth \u30d7\u30ed\u30d1\u30c6\u30a3\u3092 OpenAM \u30d7\u30ed\u30d1\u30c6\u30a3\u3078\u30de\u30c3\u30d7\u3057\u307e\u3059\u3002\u30ab\u30b9\u30bf\u30e0\u5c5e\u6027\u30de\u30c3\u30d1\u30fc\u3092\u63d0\u4f9b\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002<br/><br/>\
\u30ab\u30b9\u30bf\u30e0\u5c5e\u6027\u30de\u30c3\u30d1\u30fc\u306f <code>org.forgerock.openam.authentication.modules.oauth2.AttributeMapper</code> \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
a112=\u5c5e\u6027\u30de\u30c3\u30d1\u30fc\u8a2d\u5b9a
a112.help=\u30ed\u30fc\u30ab\u30eb\u306e OpenAM \u5c5e\u6027\u3078\u306e OAuth \u5c5e\u6027\u30de\u30c3\u30d4\u30f3\u30b0\u3002
a112.help.txt=OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304b\u3089\u5f97\u3089\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u60c5\u5831\u3092 OpenAM \u306e\u30ed\u30fc\u30ab\u30eb\u30e6\u30fc\u30b6\u30fc\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u3078\u30de\u30c3\u30d7\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u8a2d\u5b9a\u3067\u3059\u3002<br/><br/>\
\u4f8b: <code>OAuth2.0_attribute=local_attribute</code>
a115=\u30bb\u30c3\u30b7\u30e7\u30f3\u5185\u306b\u5c5e\u6027\u3092\u4fdd\u5b58\u3059\u308b
a115.help=\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u6709\u52b9\u306e\u5834\u5408\u3001\u5c5e\u6027\u30de\u30c3\u30d1\u30fc\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u5c5e\u6027\u306f OpenAM \u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3078\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002
a118=OAuth2 \u5fdc\u7b54\u5185\u306e\u30e1\u30fc\u30eb\u5c5e\u6027
a118.help=\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u4ed8\u304d\u306e\u30e1\u30fc\u30eb\u3092\u9001\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b OAuth2 \u5fdc\u7b54\u306e\u5c5e\u6027\u3002
a118.help.txt=\u8a8d\u8a3c\u6e08\u307f\u30e6\u30fc\u30b6\u30fc\u306e\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u3092\u542b\u3093\u3067\u3044\u308b OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u5185\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30b5\u30fc\u30d3\u30b9\u304b\u3089\u8fd4\u3055\u308c\u308b\u5fdc\u7b54\u5185\u306e\u5c5e\u6027\u3067\u3059\u3002\
\u3053\u306e\u30a2\u30c9\u30ec\u30b9\u306f\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u52d5\u7684\u306b\u4f5c\u6210\u3055\u308c\u308b\u3053\u3068\u304c\u8a31\u3055\u308c\u308b\u5834\u5408\u306b\u3001\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u3092\u8a18\u8ff0\u3057\u305f\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u9001\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a120=\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u4f5c\u6210\u3059\u308b
a120.help=OAuth2 \u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ed\u30fc\u30ab\u30eb\u306e OpenAM \u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u5b58\u5728\u3057\u306a\u3051\u308c\u3070\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u52d5\u7684\u306b\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002
a120.help.txt=\u6709\u52b9\u306b\u3057\u305f\u5834\u5408\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30de\u30c3\u30d7\u3055\u308c\u3066\u3044\u306a\u3051\u308c\u3070\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u30de\u30c3\u30d1\u30fc\u306f\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u52d5\u7684\u306b\u4f5c\u6210\u3057\u307e\u3059\u3002\
\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u300c\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u8a2d\u5b9a\u3068\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u306e\u5165\u529b\u3092\u8981\u6c42\u3059\u308b\u300d\u3092\u6709\u52b9\u306b\u3057\u305f\u5834\u5408\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u4f5c\u6210\u3059\u308b\u524d\u306b\u3001\
\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u5165\u529b\u3068\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u3092\u8981\u6c42\u3059\u308b\u30c0\u30a4\u30a2\u30ed\u30b0\u306f\u8868\u793a\u3055\u305b\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
<br /><br />\u3053\u306e\u30d5\u30e9\u30b0\u304c\u6709\u52b9\u306a\u5834\u5408\u30013\u3064\u306e\u9078\u629e\u80a2\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u3059:<br/><br/>\
<ol><li>\u30a2\u30ab\u30a6\u30f3\u30c8\u306f OpenAM \u30e6\u30fc\u30b6\u30fc\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u6301\u3064\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002</li>\
<li>\u30e6\u30fc\u30b6\u30fc\u306f\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u6301\u3061\u307e\u305b\u3093\u3002\u307e\u305f\u3001\u300c\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u7121\u8996\u3059\u308b\u300d\u3053\u3068\u3092\u30ec\u30eb\u30e0\u306e\u8a8d\u8a3c\u30b5\u30fc\u30d3\u30b9\u3067\u8a2d\u5b9a\u3057\u307e\u3059\u3002</li>\
<li>\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u533f\u540d\u30a2\u30ab\u30a6\u30f3\u30c8\u306b\u30de\u30c3\u30d7\u3055\u308c\u307e\u3059(\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3001\u300c\u533f\u540d\u30e6\u30fc\u30b6\u30fc\u3078\u306e\u30de\u30c3\u30d7\u300d\u304a\u3088\u3073\u300c\u533f\u540d\u30e6\u30fc\u30b6\u30fc\u300d\u3092\u53c2\u7167)\u3002</li></ol>
a122=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u8a2d\u5b9a\u3068\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u306e\u5165\u529b\u3092\u8981\u6c42\u3059\u308b
a122.help=\u30e6\u30fc\u30b6\u30fc\u306f\u52d5\u7684\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u4f5c\u6210\u6642\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8a2d\u5b9a\u3057\u3001\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30d5\u30ed\u30fc\u3092\u5b8c\u4e86\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a122.help.txt=\u6709\u52b9\u306a\u5834\u5408\u3001\u30b7\u30b9\u30c6\u30e0\u304c\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u52d5\u7684\u306b\u4f5c\u6210\u3057\u3001\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u304c\u30e6\u30fc\u30b6\u30fc\u306e\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u3078\u9001\u3089\u308c\u308b\u524d\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8a2d\u5b9a\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002\
\u30d1\u30b9\u30ef\u30fc\u30c9\u304a\u3088\u3073\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u304c\u9069\u5207\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u3001\u305d\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002\
<br/ >\u7121\u52b9\u306a\u5834\u5408\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u30d7\u30ed\u30f3\u30d7\u30c8\u3092\u8868\u793a\u305b\u305a\u306b\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002
a124=\u533f\u540d\u30e6\u30fc\u30b6\u30fc\u3078\u306e\u30de\u30c3\u30d7
a124.help=OAuth \u8a8d\u8a3c\u6e08\u307f\u30e6\u30fc\u30b6\u30fc\u306b\u5bfe\u3057\u3066 OpenAM \u3078\u306e\u533f\u540d\u30e6\u30fc\u30b6\u30fc\u3067\u306e\u30a2\u30af\u30bb\u30b9\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a124.help.txt=\u9078\u629e\u3057\u305f\u5834\u5408\u3001 OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u3067\u8a8d\u8a3c\u6e08\u307f\u30e6\u30fc\u30b6\u30fc\u306f\u6b21\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u4e2d\u3067\u8a2d\u5b9a\u3055\u308c\u305f\u533f\u540d\u30e6\u30fc\u30b6\u30fc\u306b\u30de\u30c3\u30d7\u3055\u308c\u307e\u3059\u3002\
<br/>\u8a8d\u8a3c\u6e08\u307f\u30e6\u30fc\u30b6\u30fc\u3092\u9078\u629e\u3057\u306a\u3044\u5834\u5408\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u30de\u30c3\u30d1\u30fc\u3067\u8a2d\u5b9a\u3055\u308c\u305f\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306b\u3088\u3063\u3066\u30de\u30c3\u30d7\u3055\u308c\u307e\u3059\u3002\
<br/><br/><i>\u6ce8\u610f </i><i>\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u4f5c\u6210\u3059\u308b</i>\u304c\u6709\u52b9\u306a\u5834\u5408\u3001\u305d\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u512a\u5148\u3055\u308c\u307e\u3059\u3002
a126=\u533f\u540d\u30e6\u30fc\u30b6\u30fc
a126.help=OpenAM \u533f\u540d\u30e6\u30fc\u30b6\u30fc\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3002
a126.help.txt=\u533f\u540d\u30e6\u30fc\u30b6\u30fc\u3092\u8868\u3059\u30e6\u30fc\u30b6\u30fc\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3002\u3053\u306e\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u3001\u65e2\u306b\u30ec\u30eb\u30e0\u306b\u5b58\u5728\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a128=OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30ed\u30b0\u30a2\u30a6\u30c8\u30b5\u30fc\u30d3\u30b9
a128.help=OAuth \u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u30ed\u30b0\u30a2\u30a6\u30c8\u30b5\u30fc\u30d3\u30b9\u306e URL\u3002
a128.help.txt=OAuth 2.0 \u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306f\u30ed\u30b0\u30a2\u30a6\u30c8\u30b5\u30fc\u30d3\u30b9\u3092\u6301\u3064\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
\u3053\u306e\u30ed\u30b0\u30a2\u30a6\u30c8\u6a5f\u80fd\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001\u3053\u3053\u3067\u30ed\u30b0\u30a2\u30a6\u30c8\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8 URL\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a130=\u30ed\u30b0\u30a2\u30a6\u30c8\u30aa\u30d7\u30b7\u30e7\u30f3
a130.help=\u30ed\u30b0\u30a2\u30a6\u30c8\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u30e6\u30fc\u30b6\u30fc\u306b\u3069\u306e\u3088\u3046\u306b\u63d0\u4f9b\u3055\u308c\u308b\u304b\u5236\u5fa1\u3057\u307e\u3059\u3002
a130.help.txt=OAuth \u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u5bfe\u3059\u308b\u6b21\u306e\u30ed\u30b0\u30a2\u30a6\u30c8\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u3059:<br/><br/>\
<ul><li>\u30d7\u30ed\u30f3\u30d7\u30c8: OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304b\u3089\u30ed\u30b0\u30a2\u30a6\u30c8\u3092\u3059\u308b\u305f\u3081\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u306b\u30c0\u30a4\u30a2\u30ed\u30b0\u3092\u8868\u793a\u3057\u307e\u3059\u3002</li>\
<li>\u30ed\u30b0\u30a2\u30a6\u30c8: OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304b\u3089\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u3001\u30c0\u30a4\u30a2\u30ed\u30b0\u3092\u8868\u793a\u3057\u307e\u305b\u3093\u3002</li>\
<li>\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u306a\u3044: OAuth 2.0 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304b\u3089\u30ed\u30b0\u30a2\u30a6\u30c8\u305b\u305a\u3001\u30c0\u30a4\u30a2\u30ed\u30b0\u3082\u8868\u793a\u3057\u307e\u305b\u3093\u3002</li></ul>
a132=\u30e1\u30fc\u30eb\u30b5\u30fc\u30d0\u30fc\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u306e\u5b9f\u88c5\u30af\u30e9\u30b9
a132.help=\u30e1\u30fc\u30eb\u3092\u9001\u308b\u305f\u3081\u306b\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u30af\u30e9\u30b9\u3002
a132.help.txt=\u3053\u306e\u30af\u30e9\u30b9\u306f\u96fb\u5b50\u30e1\u30fc\u30eb\u3092\u9001\u4fe1\u3059\u308b\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u30ab\u30b9\u30bf\u30e0\u5b9f\u88c5\u3092\u63d0\u4f9b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002<br/><br/>\
\u30ab\u30b9\u30bf\u30e0\u5b9f\u88c5\u3067\u306f\u3001 <code>org.forgerock.openam.authentication.modules.oauth2.EmailGateway</code> \u3092\u5b9f\u88c5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a134=SMTP \u30db\u30b9\u30c8
a134.help=\u30e1\u30fc\u30eb\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u306e\u5b9f\u88c5\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u30e1\u30fc\u30eb\u30db\u30b9\u30c8\u3002
a136=SMTP \u30dd\u30fc\u30c8
a136.help=SMTP \u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u3067\u4f7f\u7528\u3055\u308c\u308b TCP \u30dd\u30fc\u30c8\u3002
a138=SMTP \u30e6\u30fc\u30b6\u30fc\u540d
a138.help=SMTP \u30b5\u30fc\u30d3\u30b9\u304c\u8a8d\u8a3c\u3092\u5fc5\u8981\u3068\u3059\u308b\u5834\u5408\u306f\u3001\u3053\u3053\u3067\u30e6\u30fc\u30b6\u30fc\u540d\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a140=SMTP \u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9
a140.help=SMTP \u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
a142=SMTP SSL \u3092\u6709\u52b9\u306b\u3059\u308b
a142.help=SMTP \u30b5\u30fc\u30d0\u30fc\u304c SSL \u3092\u63d0\u4f9b\u3059\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002
a144=SMTP From \u30a2\u30c9\u30ec\u30b9
a144.help=\u30e1\u30c3\u30bb\u30fc\u30b8\u9001\u4fe1\u8005\u306e\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u3002
a500 = \u8a8d\u8a3c\u30ec\u30d9\u30eb
a500.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a500.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0\uff08\u30c7\u30d5\u30a9\u30eb\u30c8\uff09\u304c\u6700\u4f4e\u3067\u3059\u3002
#
# error messages
#
authFailed = \u4f55\u3089\u304b\u306e\u7406\u7531\u3068\u3068\u3082\u306b\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
json = JSON \u4f8b\u5916\u3068\u3068\u3082\u306b\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
ssoe = \u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u4f8b\u5916\u3068\u3068\u3082\u306b\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
ire = \u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u4f8b\u5916\u3068\u3068\u3082\u306b\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
unknownState = \u72b6\u614b\u304c\u6709\u52b9\u3067\u306f\u306a\u304b\u3063\u305f\u306e\u3067\u3001\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
ioe = \u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u53d6\u5f97\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u5165\u529b/\u51fa\u529b\u306e\u4f8b\u5916\u3067\u8a8d\u8a3c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
httpErrorCode = \u30ea\u30e2\u30fc\u30c8\u30b5\u30fc\u30d0\u30fc\u304c HTTP \u30a8\u30e9\u30fc\u30b3\u30fc\u30c9 {0} \u3067\u5fdc\u7b54\u3057\u305f\u305f\u3081\u3001\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
malformedURL = \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u30b5\u30fc\u30d3\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3092\u8a66\u307f\u305f\u969b\u306e URL \u304c\u4e0d\u6b63\u306a\u5f62\u5f0f\u3067\u3059\u3002
invalidField = \u5165\u529b\u30d5\u30a3\u30fc\u30eb\u30c9 {0} \u306b\u7121\u52b9\u306a\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\uff1a {1}
#
# Mail parameters
#
messageSubject = \u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9
messageBody = \u767b\u9332\u3042\u308a\u304c\u3068\u3046\u3054\u3056\u3044\u307e\u3057\u305f\u3002\n\n\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u3092\u63d0\u4f9b\u3059\u308b\u3068\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u304c\u81ea\u52d5\u7684\u306b\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002\n\n\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u4f5c\u6210\u3057\u3066\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u3059\u308b\u306b\u306f\u3001\u6b21\u306e\u30ea\u30f3\u30af\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044:\n\n#ACTIVATION_LINK#\n\n\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u8868\u793a\u3055\u308c\u305f\u5834\u5408\u3001\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u3092\u30b3\u30d4\u30fc\u3057\u3001\u305d\u308c\u3092\u8981\u6c42\u3059\u308b\u753b\u9762\u306b\u8cbc\u308a\u4ed8\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\n\u3042\u306a\u305f\u306e\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u306f: #ACTIVATION_CODE#\n\n\u3088\u308d\u3057\u304f\u304a\u9858\u3044\u81f4\u3057\u307e\u3059\n\nForgeRock
#
# Buttons in the Authentication Srevice Configuration
#
donotlogout = \u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u306a\u3044
logout = \u30ed\u30b0\u30a2\u30a6\u30c8
prompt = \u30d7\u30ed\u30f3\u30d7\u30c8
i18nTrue=\u6709\u52b9
i18nFalse=\u7121\u52b9
#
# JSP messages
#
# Activation page
activationTitle = \u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u30da\u30fc\u30b8
activationLabel = \u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9
activationCodeMsg = \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u306b\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f\u3002\u30e1\u30fc\u30eb\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3001\u63d0\u4f9b\u3055\u308c\u305f\u30ea\u30f3\u30af\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30ea\u30f3\u30af\u3092\u30af\u30ea\u30c3\u30af\u3057\u305f\u969b\u306b\u554f\u984c\u304c\u3042\u308b\u5834\u5408\u306f\u3001\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u3092\u3053\u3053\u306b\u30b3\u30d4\u30fc\u30da\u30fc\u30b9\u30c8\u3057\u3066\u3001Enter\u3092\u62bc\u3057\u307e\u3059\u3002\u3042\u308a\u304c\u3068\u3046\u3054\u3056\u3044\u307e\u3059\u3002
emptyCode = \u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u3092\u7a7a\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
errInvalidCode = \u30b3\u30fc\u30c9\u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
submit = \u9001\u4fe1
cancel = \u30ad\u30e3\u30f3\u30bb\u30eb
#
# Password setting page
newPassLabel = \u65b0\u898f\u30d1\u30b9\u30ef\u30fc\u30c9
confirmPassLabel = \u30d1\u30b9\u30ef\u30fc\u30c9(\u518d\u5165\u529b)
termsAndCondsLabel = \u30b5\u30fc\u30d3\u30b9\u306e\u6761\u4ef6
passwordSetMsg = \u30a2\u30ab\u30a6\u30f3\u30c8\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
passwordRules = \u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5c11\u306a\u304f\u3068\u30828\u6587\u5b57\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002<br/>\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u5927\u6587\u5b57\u304a\u3088\u30731\u5c0f\u6587\u5b57<br/>\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u6570\u5b57<br/>\u6587\u5b57 + = _ \u3082\u542b\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
errLength = \u30a8\u30e9\u30fc\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5c11\u306a\u304f\u3068\u30828\u6587\u5b57\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
errNumbers = \u30a8\u30e9\u30fc\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u6570\u5b57\u3092\u542b\u3093\u3067\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 0-9
errLowercase = \u30a8\u30e9\u30fc\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u5c0f\u6587\u5b57\u3092\u542b\u3093\u3067\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 a-z
errUppercase = \u30a8\u30e9\u30fc\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5c11\u306a\u304f\u3068\u30821\u3064\u306e\u5927\u6587\u5b57\u3092\u542b\u3093\u3067\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 A-Z
errNoMatch = \u30a8\u30e9\u30fc\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u30d1\u30b9\u30ef\u30fc\u30c9(\u518d\u5165\u529b)\u306f\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
errEmptyPass = \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u3001\u305d\u308c\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
errTandC = \u6761\u4ef6\u306b\u540c\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002
errInvalidPass = \u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u4e0d\u5f53\u6587\u5b57\u3092\u542b\u3093\u3067\u3044\u307e\u3059\u3002
#
# Logout Page
# #IDP# will be replaced by the name of the IdP during the presentation of the page
doYouWantToLogout = #IDP# \u304b\u3089\u3082\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u307e\u3059\u304b?
loggingYouOut = IdP \u304b\u3089\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u3066\u3044\u307e\u3059\u3002
youVeBeenLogedOut = OAuth 2.0 IdP \u304b\u3089\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u307e\u3057\u305f\u3002
noSupportIFrames = \u30d6\u30e9\u30a6\u30b6\u304c\u30a4\u30f3\u30e9\u30a4\u30f3\u30d5\u30ec\u30fc\u30e0\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
logmeout=\u306f\u3044
donot=\u3044\u3044\u3048
enableScripts=\u30d6\u30e9\u30a6\u30b6\u306e JavaScript \u306e\u8a2d\u5b9a\u3092\u6709\u52b9\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
