#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amtune_fr.properties,v 1.6 2009/12/26 03:53:27 cbasha Exp $ 
#
#

pt-tuning=R\u00e9glage 
pt-file=Fichier                 :   
pt-param-tuning=R\u00e9glage de param\u00e8tre     : 
pt-db-home-dir=1.   R\u00e9pertoire d\u2019accueil DB dans le disque RAM
pt-cur-val=Valeur actuelle        : 
pt-rec-val=Valeur recommand\u00e9e    : 
pt-rec-none=Aucun.
pt-cannot-backup-db=Impossible de sauvegarder la base de donn\u00e9es. Le r\u00e9glage ne sera pas appliqu\u00e9. 
pt-tuning-ds=R\u00e9glage de Directory Server 
pt-fail-ds-conf=\u00c9chec d\u2019obtention d\u2019une configuration de r\u00e9pertoire pour 
pt-inval-config=Configuration non valide. Impossible de poursuivre. 
pt-inval-val-msg=Valeur non valide. 
pt-cannot-proceed=Impossible de poursuivre. 
pt-not-valid-dir=R\u00e9pertoire non valide 
pt-cannot-compute-rec-val=Impossibilit\u00e9 de calculer recommand\u00e9e
pt-modify=Modification 
pt-enough=Il y en a assez 
pt-modify-access-log-status=Modification du statut du journal d\u2019acc\u00e8s
pt-access-log-on=Le journal d\u2019acc\u00e8s est d\u00e9j\u00e0 activ\u00e9
pt-already-enough=est d\u00e9j\u00e0 volumineux 
pt-done=Termin\u00e9.
pt-future-tuning-msg1=Recommandations suppl\u00e9mentaires concernant le r\u00e9glage de DS :
pt-future-tuning-msg2=Une description d\u00e9taill\u00e9e de ces param\u00e8tres se trouve dans Directory Server
pt-future-tuning-msg3=Guide de r\u00e9glage des performances de FAM. 
pt-future-tuning-msg4=R\u00e9glez les \u00e9l\u00e9ments suivants pour 
pt-a=a.
pt-b=b.
pt-c=c.
pt-d=d.
pt-split-comp-msg=4. Envisagez de r\u00e9partir les composants suivants du serveur sur plusieurs syst\u00e8mes de fichiers. 
pt-database-trans-logs-msg=  Les journaux de base de donn\u00e9es, de transactions et d\u2019acc\u00e8s g\u00e9n\u00e8rent un nombre important d\u2019activit\u00e9s E/S.
pt-isolate-msg=      La r\u00e9partition de ces composants sur diff\u00e9rents disques physiques va permettre d\u2019am\u00e9liorer les performances. 
pt-delegated-admin-msg1=5. Si vous n\u2019utilisez pas les fonctions d\u2019administrateur d\u00e9l\u00e9gu\u00e9 de OpenAM, supprimez les r\u00f4les inutilis\u00e9s de la console OpenAM. 
pt-delegated-admin-msg2=   Des ACI peuvent \u00eatre associ\u00e9s aux r\u00f4les, ce qui peut affecter les performances.
pt-invalid-conf=Configuration non valide. 
pt-failed-to-obtain-conf=\u00c9chec d\u2019obtention d\u2019une configuration de r\u00e9pertoire\u00a0:  
pt-access-log-status=Statut du journal d\u2019acc\u00e8s 
pt-backend-db=Arri\u00e8re pour le DB 
pt-db-home-location=Emplacement d\u2019accueil DB
pt-db-directory=R\u00e9pertoire DB
pt-init=Initialisation...
pt-no-cpu=Nombre de serveurs de base dans le syst\u00e8me\u00a0:  
pt-unable-hw-pt=Impossible d\u2019obtenir la plate-forme mat\u00e9rielle.
pt-unable-no-cpu=Impossible d\u2019obtenir des CPU disponibles. 
pt-unable-avmem=Impossible d\u2019obtenir une m\u00e9moire disponible. 
pt-unable-hostname=Impossible d\u2019obtenir le nom d\u2019h\u00f4te. 
pt-unable-domainname=Impossible d\u2019obtenir le nom de domaine. 
pt-calc-ds-mem=Calcul des besoins en m\u00e9moire pour la mise en cache DS... 
pt-error-loc-db-dir=Erreur lors de la recherche des r\u00e9pertoires DB. 
pt-error-compute-db-size=Impossible de calculer la taille de cache DB recommand\u00e9e. 
pt-cannot-compute-rec-db-size=Impossible de calculer la taille de cache DB recommand\u00e9e pour {0}
pt-unable-mem-req=Impossible de calculer la configuration m\u00e9moire requise. 
pt-avail-mem-size=M\u00e9moire disponible (octets)             : 
pt-mem-need-ds-cache=M\u00e9moire requise pour la mise en cache DS (octets)\u00a0: 
pt-enough-mem=M\u00e9moire insuffisante.
pt-no-enough-mem=La m\u00e9moire est insuffisante.
pt-cannot-new-db-home=Impossible de calculer un nouvel accueil DB. 
pt-cannot-new-ds-threads=Impossible de calculer le nombre optimal de threads de travail DS. 
pt-error-ds-pass-file=ERREUR : fichier de mots de passe Directory Server introuvable.
pt-check-dbg-logs-msg=Veuillez consulter les journaux de d\u00e9bogage pour plus de pr\u00e9cisions. 
pt-del-jvm-error-msg=Erreur lors de la suppression des options JVM existantes. 
pt-create-jvm-opts-error-msg=Erreur lors de la d\u00e9finition des options JVM. 
pt-set-param-error-msg=Erreur lors de la configuration des propri\u00e9t\u00e9s du conteneur Web. 
pt-fam-ds-tuning=OpenAM - R\u00e9glage de Directory Server 5.2
pt-fam-ds6-tuning=OpenAM - R\u00e9glage de Directory Server 6.x
pt-fam-tuning-msg=R\u00e9glage de OpenAM.....
pt-fam-rec-parm-tune-msg=Les param\u00e8tres de r\u00e9glage du serveur OpenAM recommand\u00e9s sont...
pt-fam-default-value=Valeur par d\u00e9faut        :  
pt-fam-cur-rec-val-same=La configuration du serveur OpenAM correspond \u00e0 la configuration recommand\u00e9e. 
pt-fam-tuning-server-config=R\u00e9glage des configurations du serveur OpenAM
pt-fam-tuning-ldap-con-pool=R\u00e9glage du pool de connexions LDAP ServerConfig (gestion de services) 
pt-fam-refer-guide-msg=Pour plus d\u2019informations sur ces param\u00e8tres, consultez le guide de r\u00e9glage des performances et de d\u00e9pannage de OpenAM.
pt-fam-tuning-global-auth-svc=R\u00e9glage du pool de connexions LDAP dans iPlanetAMAuthService global
pt-fam-tuning-ldap-search-criteria=R\u00e9glage des crit\u00e8res de recherche LDAP dans iPlanetAMAuthLDAPService pour Default Org
pt-fam-tuning-logging-buffer-size=R\u00e9glage de la taille du tampon de journalisation dans iPlanetAMLoggingService
pt-fam-tool-not-found=L\u2019outil ssoadm du serveur OpenAM est introuvable.
pt-fam-server-url-not-found=URL du serveur OpenAM introuvable.
pt-fam-admin-user-not-found=Utilisateur d\u2019administration du serveur OpenAM introuvable. 
pt-fam-realm-ldapconn-tuning=Taille minimum/maximum du pool de connexions LDAP et taille maximum du cache pour les domaines existants.
pt-fam-server-unreachable-error-msg=Le serveur OpenAM ne peut \u00eatre atteint.  Veuillez vous assurer que l\u2019URL d\u2019OpenAM server est valide et peut \u00eatre atteint. 
pt-fam-server-down-msg=Il se peut que le serveur OpenAM soit hors service.  V\u00e9rifiez que le serveur fonctionne. 
pt-fam-server-ssl-error-msg=V\u00e9rifiez si SSL est activ\u00e9 pour OpenAM server et si le certificat CA root pour OpenAM server a \u00e9t\u00e9 import\u00e9 correctement dans le keystore amtune/ssoadm de JRE. Sinon, importez le certificat CA root dans le JRE et retournez amtune (se reporter aux journaux de d\u00e9bogage amtune et le journal de d\u00e9bogage du journal de d\u00e9bogage CoreSystem du serveur pour plus de d\u00e9tails).
pt-fam-config-dir-req=Indiquez l\u2019emplacement du r\u00e9pertoire de configuration du serveur OpenAM permettant d\u2019inclure \u00e0 amtune.zip les fichiers ldif requis pour le r\u00e9glage d\u2019un serveur Directory Server distant.
pt-ds-create-tar=Cr\u00e9ation du fichier zip de l\u2019outil de r\u00e9glage de Directory Server (amtune.zip) destin\u00e9 au r\u00e9glage d\u2019une instance Sun DS distante... 
pt-ds-tar-file-location=Fichier zip de l\u2019outil de r\u00e9glage de Directory Server (amtune.zip)\u00a0: 
pt-ds-steps=\u00c9tapes du r\u00e9glage de Directory Server\u00a0:
pt-ds-copy-tar-file=1. Copiez le fichier zip de l\u2019outil de r\u00e9glage de DS (amtune.zip) sur le syst\u00e8me o\u00f9 est install\u00e9 Directory Server.
pt-ds-untar-file=2. D\u00e9compressez le fichier de l\u2019outil de r\u00e9glage DS (amtune.zip) dans un emplacement temporaire. 
pt-ds-set-values=3. D\u00e9finissez JAVA_HOME et TOOLS_HOME dans les scripts amtune/amtune.bat.
pt-ds-set-env-values=4. \u00c9ditez le fichier amtune-env.properties pour ins\u00e9rer les informations relatives \u00e0 Directory Server.
pt-ds-execute-review-mode=5. Ex\u00e9cutez amtune en mode REVIEW.
pt-ds-review=6. Examinez attentivement les r\u00e9glages recommand\u00e9s pour DS
pt-ds-change-mode=7. Si vous souhaitez vraiment appliquer ces modifications dans DS, ex\u00e9cutez le script amtune en mode CHANGE.
pt-ds-um-mutliple-msg=Remarque\u00a0: pour r\u00e9gler plusieurs magasins de donn\u00e9es, il faut ex\u00e9cuter amtune/amtune.bat plusieurs fois en indiquant les diff\u00e9rentes valeurs des param\u00e8tres DS_* dans amtune-env.properties et DIRMGR_PASSWORD dans un fichier de mots de passe. 
#pt-ds-rec-msg=It's highly recommended to run db2bak before running amtune in case of Sun DS 5.x or dsadm backup in case of Sun DS 6.x.
#config Info msgs
pt-conf-info=informations...
pt-conf-detecting=D\u00e9tection de l\u2019environnement du syst\u00e8me...
pt-conf-calc-tune-params=Calcul des param\u00e8tres de r\u00e9glage...
pt-conf-parm-cust-msg=Il vous faudra peut-\u00eatre personnaliser le param\u00e8tre suivant dans le fichier amtune-env.properties\u00a0: 
pt-not-configured=Valeur de la propri\u00e9t\u00e9 non d\u00e9finie.  
pt-curent-setting=Param\u00e8tre actuel de 
pt-tool-not-found=outil introuvable. 
pt-conf-file-missing=ERREUR\u00a0: fichier de configuration manquant\u00a0: 
pt-bk-file=Fichier de sauvegarde 
pt-error-tuning-msg=Une erreur s\u2019est produite durant le r\u00e9glage\u00a0: 
pt-unable-find-lnx-ver=Impossible de trouver la version de Red Hat Linux.
pt-error-sysctl-cmd=Erreur lors de l\u2019ex\u00e9cution de la commande sysctl.
## web Server related
pt-web-tuning-msg=OpenAM - R\u00e9glage de Web Server 
pt-web-inst-dir-not-found=R\u00e9pertoire d\u2019instance de conteneur Web introuvable.  
pt-web-cur-wadm-settings=Param\u00e8tre WSADMIN_CONFIG actuel\u00a0:   
pt-web-cur-configs=Configuration(s) actuelle(s) du serveur Web\u00a0:  
pt-web-cur-http-listener-msg=Param\u00e8tre WSADMIN_HTTPLISTENER actuel\u00a0 :   
pt-web-cur-listeners=Listener(s) Http actuels du serveur Web\u00a0:  
pt-web-wadm-conf-error=Configuration de Web Server incorrecte.
pt-web-wadm-httplistener-error=ERREUR\u00a0: impossible de valider le listener Http du serveur Web. Veuillez consulter le message d\u2019erreur wadm ci-dessous\u00a0:
pt-web-check-jvmbits=V\u00e9rification du mode JVM de Web Server (32 bits ou 64 bits) pour Web Server 7...
pt-app-check-jvmbits=Contr\u00f4le du mode JVM (32 bits ou 64 bits) du serveur d\u2019applications pour AS 9/Glassfish v2
pt-web-del-jvm-options=Suppression de l\u2019option JVM\u00a0: 
pt-web-add-jvm-options=Insertion de l\u2019option JVM\u00a0: 
pt-web-server-inst=R\u00e9glage de l\u2019instance de Web Server... 
pt-web-64bit-jvm-rec-msg1=Valeur recommand\u00e9e : le JVM du conteneur Web sur votre syst\u00e8me prend en charge le mod\u00e8le de donn\u00e9es 64 bits avec 
pt-web-64bit-jvm-rec-msg2=Mo de m\u00e9moire disponible \u00e0 l\u2019utilisation.
pt-web-64bit-jvm-rec-msg3=Nous vous recommandons de modifier un param\u00e8tre 
pt-web-64bit-jvm-rec-msg4=utilis\u00e9 pour calculer les tailles du tas maximal et du tas minimal  .
pt-web-64bit-jvm-rec-msg5=Veuillez v\u00e9rifier que ce taux n\u2019est pas trop \u00e9lev\u00e9 si la quantit\u00e9 de m\u00e9moire physique disponible 
pt-web-64bit-jvm-rec-msg6=est tr\u00e8s importante, en d\u2019autres termes si la m\u00e9moire physique disponible est un multiple important de 32 bits
pt-web-64bit-jvm-rec-msg7=Limite de la m\u00e9moire JVM, 4 Go.
pt-web-64bit-jvm-cur-msg1=Le param\u00e8tre actuel pour le taux de la taille du tas maximal est\u00a0: 
pt-web-64bit-jvm-cur-msg2=Les tailles actuelles des tas maximal et tas minimal calcul\u00e9es \u00e0 partir du taux ci-dessus sont\u00a0:
pt-ds-unsupported-msg=Version de Directory Server non prise en charge. 
pt-ds-version-fail-msg=R\u00e9cup\u00e9ration de la version de Directory Server impossible.
pt-manual-msg=Veuillez ex\u00e9cuter amtune en mode REVIEW et appliquer manuellement les recommandations.
pt-web-conf-same-rec-msg=La configuration du conteneur Web correspond \u00e0 la configuration recommand\u00e9e. 
pt-web-not-running-msg=V\u00e9rifiez que le conteneur Web fonctionne et que l\u2019h\u00f4te et le num\u00e9ro de port fournis sont corrects.
## Appserver tuning
pt-app-tuning-msg=OpenAM - R\u00e9glage du Serveur d\u2019application 
pt-app-srv-tuning-inst=Instance de r\u00e9glage du serveur d\u2019applications... 
pt-app-stack-size-tuning=R\u00e9glage de la taille de la pile pour AS\u00a09
pt-unsupported-sol=Version de Solaris non prise en charge
pt-unsupported-lnx=Version de Linux non prise en charge
pt-unsupported-arch=Architecture non prise en charge
pt-unsupported-os=Syst\u00e8me d\u2019exploitation non pris en charge
pt-unsupported-os-tuning=Syst\u00e8me d\u2019exploitation non pris en charge pour le r\u00e9glage.
pt-unsupported-wc-tuning=Conteneur Web non pris en charge pour le r\u00e9glage.
pt-checking-system-env=V\u00e9rification de l\u2019environnement du syst\u00e8me...
pt-check-user=V\u00e9rification de l\u2019utilisateur...
pt-should-be-root-user=Seul l\u2019utilisateur root peut ex\u00e9cuter un programme
pt-root-user-error=Utilisateur non root.
pt-web-tuning-error-msg=Erreur lors du r\u00e9glage du conteneur Web.  
pt-as-restart-msg=Red\u00e9marrage du serveur d\u2019application pour appliquer les modifications...
##Tune-os
pt-sol-kernel-tuning=R\u00e9glage du noyau Solaris...
pt-sol-error-tuning=Erreur lors du r\u00e9glage du syst\u00e8me d\u2019exploitation Solaris.
pt-sol-tuning-msg=R\u00e9glage de Solaris... 
pt-non-global-zone-msg=AVERTISSEMENT\u00a0: le r\u00e9glage de Solaris a \u00e9chou\u00e9 car la zone syst\u00e8me n\u2019est pas globale
pt-tcp-tuning=R\u00e9glage des param\u00e8tres TCP \u00e0 l\u2019aide de la commande\u00a0:
pt-lnx-tuning=R\u00e9glage de Linux 
pt-lnx-kernel-tuning-msg=R\u00e9glage du noyau Linux...
pt-lnx-kernel-tuning-error-msg=Erreur lors du r\u00e9glage du noyau Linux.
pt-lnx-boot-file-error=Erreur lors du r\u00e9glage du fichier d\u2019initialisation Linux.
pt-lnx-limits-conf-error=Erreur lors du r\u00e9glage de limits.conf.
pt-lnx-load-vals-msg=Chargement de nouvelles valeurs depuis 
pt-lnx-boot-script-tuning-msg=R\u00e9glage de script d\u2019initialisation Linux...
pt-lnx-loading-kernel-msg=5. Chargement du fichier noyau avec 
pt-lnx-open-file-msg=R\u00e9glage des descripteurs de fichier et de fichier ouvert...
pt-lnx-soft-file-msg=1.   Nombre de fichiers logiciels.
pt-lnx-hard-file-msg=2.   Nombre de fichiers mat\u00e9riels.
pt-lnx-reboot-msg=Veuillez r\u00e9initialiser le syst\u00e8me pour que les modifications deviennent effectives...
pt-os-tuning-error-msg=Erreur lors du r\u00e9glage du syst\u00e8me d\u2019exploitation.  
pt-error-password-file-not-readonly=Le fichier de mots de passe {0} doit \u00eatre en lecture seule par le propri\u00e9taire uniquement.
pt-error-password-file-not-found=Fichier de mots de passe introuvable.    
pt-password-file-keys-msg=Veuillez fournir le fichier de mots de passe \u00e0 amtune sous forme d\u2019argument de ligne de commande en indiquant une ou plusieurs cha\u00eenes parmi les suivantes, o\u00f9 les mots de passe sont plac\u00e9s apr\u00e8s la cha\u00eene\u00a0: SSOADM_PASSWORD=<mot de passe admin OpenAM>, WADM_PASSWORD=<mot de passe admin serveur admin Web Server>, ASADMIN_PASSWORD=<mot de passe admin serveur d\u2019application> et DIRMGR_PASSWORD=<mot de passe admin Directory Server>.
pt-as-password-not-found=Mot de passe admin serveur d\u2019application/Glassfish introuvable.
pt-as-password-null=Le mot de passe administrateur du serveur d\u2019application/Glassfish est null.
pt-as-password-not-found-msg=Veuillez fournir ASADMIN_PASSWORD=<mot de passe admin serveur d\u2019application> dans le fichier de mots de passe.
pt-ws-password-not-found=Mot de passe administrateur de Web Server introuvable.
pt-ws-password-null=Le mot de passe administrateur de Web Server est null.
pt-ws-password-not-found-msg=Veuillez fournir WADM_PASSWORD=<mot de passe admin Web Server> dans le fichier de mots de passe.
pt-ds-password-not-found=Mot de passe administrateur de Directory Server introuvable.
pt-ds-password-null=Le mot de passe administrateur de Directory Server est null.
pt-ds-password-not-found-msg=Veuillez fournir DIRMGR_PASSWORD=<mot de passe admin Directory Server> dans le fichier de mots de passe.
pt-opensso-password-not-found=Mot de passe administrateur du serveur OpenAM introuvable.
pt-opensso-password-null=Le mot de passe administrateur du serveur OpenAM est null.
pt-opensso-password-not-found-msg=Veuillez fournir SSOADM_PASSWORD=<mot de passe admin serveur OpenAM> dans le fichier de mots de passe.
pt-error-null-worker-threads=Theads de travail DS null.
pt-error-null-access-log-status=Le statut du journal d\u2019acc\u00e8s est null.
pt-error-null-db-cache-size=La taille de cache DB est null.
pt-error-updating-opensso-config=Erreur lors de la mise \u00e0 jour de la configuration des services OpenAM.
pt-error-datastore-list=Erreur lors de la recherche de magasins de donn\u00e9es pour le domaine.
pt-error-invalid-opensso-admin-tools=Emplacement des outils d\u2019administration du serveur OpenAM null ou incorrect.
pt-error-null-realm-name=Le nom du domaine est null.
pt-error-not-valid-int=Nombre entier non valide.
pt-error-key-not-found=Cl\u00e9 requise introuvable dans amtune-env.properties.
pt-error-ldap-insufficient-access-rights=L\u2019utilisateur ne dispose pas des privil\u00e8ges d\u2019acc\u00e8s.
pt-error-check-ds-dn-and-password=V\u00e9rifiez les valeurs de DIRMGR_BIND_DN dans le fichier amtune-env.properties et de DIRMGR_PASSWORD dans le fichier de mots de passe. 
pt-error-cannot-connect-to-ds=Directory Server n\u2019est pas disponible.
pt-error-check-ds-params-msg=V\u00e9rifiez que le serveur d\u2019annuaire fonctionne et que l\u2019h\u00f4te et le num\u00e9ro de port indiqu\u00e9s dans amtune-env.properties sont corrects.
pt-error-invalid-ds-vals=Mot de passe d\u2019administration ou DN de liaison du serveur d\u2019annuaire non valide.
pt-error-invalid-bind-dn=Syntaxe incorrecte du DN de liaison du serveur d\u2019annuaire.
pt-error-as-admin-user-null=L\u2019utilisateur admin du serveur d\u2019application est null.
pt-error-null-as-admin-host=Le nom d\u2019h\u00f4te du serveur d\u2019application est null.
pt-error-null-as-admin-port=Le port d\u2019administration du serveur d\u2019application est null.
pt-error-invalid-as-admin-dir=R\u00e9pertoire asadmin non valide.
pt-error-null-as-admin-dir=R\u00e9pertoire asadmin null.
pt-error-as-admin-tool-not-found=Outil asadmin introuvable.
pt-error-unable-to-connect-to-asadmin-srv=Connexion \u00e0 admin-server impossible.
pt-error-unknow-host=H\u00f4te inconnu.
pt-error-as-invalid-user-password=Utilisateur admin ou mot de passe du serveur d\u2019application non valide.
pt-error-ws-invalid-user-password=Utilisateur admin ou mot de passe du serveur Web non valide.
pt-error-as-check-user-password-msg=V\u00e9rifiez le nom d\u2019utilisateur admin du serveur d\u2019application dans amtune-env.properties et le mot de passe dans le fichier de mots de passe.
pt-error-ws-check-user-password-msg=V\u00e9rifiez le nom d\u2019utilisateur admin du serveur Web dans amtune-env.properties et le mot de passe dans le fichier de mots de passe.
pt-error-opensso-check-user-password-msg=V\u00e9rifiez le nom d\u2019utilisateur admin du serveur OpenAM dans amtune-env.properties et le mot de passe dans le fichier de mots de passe.
pt-error-login-failed=\u00c9chec de la connexion.
pt-error-invalid-as-target=Cible du serveur d\u2019application non valide.
pt-error-invalid-as-http-listener=Listener http du serveur d\u2019application non valide.
pt-error-get-as-thread-queue-size=Impossible d\u2019obtenir les param\u00e8tres du serveur d\u2019application concernant les threads et la taille de la file d\u2019attente.
pt-error-invalid-wadm-tool-dir=R\u00e9pertoire de l\u2019outil wadm non valide.
pt-error-null-ws-host-name=Le nom d\u2019h\u00f4te administrateur de Web Server est null.
pt-error-null-ws-admin-secure=La valeur de la propri\u00e9t\u00e9 de s\u00e9curisation de l\u2019administration de Web Server est null.
pt-error-null-ws-config-name=Le nom de la configuration de Web Server est null.
pt-error-null-ws-http-listener=Le Listener http de Web Server est null.
pt-error-invalid-ws-config-name=Nom de configuration de Web Server incorrect.
pt-error-invalid-ws-http-listener=Http-Listener de serveur Web non valide.
pt-error-null-ws-admin-port=Le port d\u2019administration du serveur Web est null.
pt-error-null-ws-admin-user=L\u2019utilisateur admin de Web Server est null.
pt-error-null-ds-host=Le nom d\u2019h\u00f4te de Directory Server est null.
pt-error-null-ds-port=Le port de Directory Server est null.
pt-error-null-ds-root-suffix=Le suffixe racine de l\u2019organisation est null.
pt-error-null-ds-bind-dn=Le DN de liaison BIND DN du gestionnaire d\u2019annuaire est null.
pt-error-null-ds-version=La version de Directory Server est null.
pt-error-null-ds-tools-dir=Le r\u00e9pertoire des outils de Directory Server est null.
pt-error-ds-db-backup-failed=\u00c9chec de la sauvegarde de la base de donn\u00e9es de Directory Server.
pt-error-ds-stop=Impossible d\u2019arr\u00eater Directory Server.
pt-error-ds-start=Impossible de d\u00e9marrer Directory Server.
pt-error-get-server-cfgfile=Erreur lors de l\u2019obtention du fichier serverconfig.xml
pt-error-set-server-cfgfile=Erreur lors du param\u00e9trage du fichier serverconfig.xml
pt-error-get-ldapconnpool-size=Erreur lors de l\u2019obtention de la taille ladpconnpool.
pt-error-set-ldapconnpool-size=Erreur lors du param\u00e9trage de la taille ladpconnpool.
pt-error-get-ldapsearch-scope=Erreur lors de l\u2019obtention de l\u2019\u00e9tendue de la recherche ldap.
pt-error-set-ldapsearch-scope=Erreur lors du param\u00e9trage de l\u2019\u00e9tendue de la recherche ldap.
pt-error-get-logging-buffer-size=Erreur lors de l\u2019obtention de la taille du tampon de journalisation.
pt-error-set-logging-bugger-size=Erreur lors du param\u00e9trage de la taille du tampon de journalisation.
pt-error-null-domain-name=Le nom du domaine est null.
pt-error-null-host-name=Le nom d\u2019h\u00f4te est null.
pt-error-finding-sys-info=Erreur durant la recherche des informations syst\u00e8me.
pt-error-zip-file=Erreur lors de la cr\u00e9ation du fichier zip.
pt-error-ds-tool-not-found=Outils d\u2019administration de Directory Server introuvables.
pt-error-invalid-ds-instance-dir=R\u00e9pertoire d\u2019instance de Directory Server non valide.
pt-error-invalid-db-directory=R\u00e9pertoire DB non valide.
pt-error-null-db-dn=La valeur DBDN est null.
pt-error-null-back-end=Le syst\u00e8me d\u2019arri\u00e8re-plan est null.
pt-error-null-db-db-msg=DBDN null pour {0}
pt-error-null-db-entry-cache-size=La taille du cache d\u2019entr\u00e9e DB est null pour le syst\u00e8me d\u2019arri\u00e8re-plan {0}
pt-error-null-suffix-back-end=Suffixe null pour le syst\u00e8me d\u2019arri\u00e8re-plan {0}
pt-error-null-db-home-location=L\u2019emplacement de base DB est null.
pt-error-fqdn-ds-host-name=Le nom d\u2019h\u00f4te du serveur d\u2019annuaire n\u2019est pas un nom de domaine complet valide.
pt-error-ws-conf-file-not-found=Le fichier de configuration de Web Server est introuvable.
pt-error-ws-invalid-instance-dir=R\u00e9pertoire d\u2019instance de Web Server non valide.
pt-error-as-conf-file-not-found=Le fichier de configuration du serveur d\u2019application est introuvable.
pt-error-as-invalid-instance-dir=R\u00e9pertoire d\u2019instance du serveur d\u2019application non valide.
pt-error-null-db-name=Le nom DB est null.
pt-error-null-amtune-mode=AMTUNE_MODE est null.
pt-error-invalid-amtune-mode=Valeur AMTUNE_MODE non valide.
pt-error-null-config-log-type=AMTUNE_LOG_LEVEL est null.
pt-error-invalid-log-level=Valeur AMTUNE_LOG_LEVEL non valide.
pt-error-null-tune-os=Valeur bool\u00e9enne null pour AMTUNE_TUNE_OS
pt-error-null-tune-ws=Valeur bool\u00e9enne null pour AMTUNE_TUNE_WEB_CONTAINER
pt-error-null-tune-ds=Valeur bool\u00e9enne null pour AMTUNE_TUNE_DS
pt-error-null-tune-opensso=Valeur bool\u00e9enne null pour AMTUNE_TUNE_IDENTITY
pt-error-null-wc=Le nom du conteneur Web est null.
pt-error-null-dont-touch-session-params=La propri\u00e9t\u00e9 de protection des param\u00e8tres de session est null.
pt-error-null-max-session-time-mts=La propri\u00e9t\u00e9 de dur\u00e9e maximale de session en minutes est null.
pt-error-null-max-session-idle-time-mts=La propri\u00e9t\u00e9 de dur\u00e9e maximale de session inactive en minutes est null.
pt-error-null-max-caching-time-in-mts=La propri\u00e9t\u00e9 de temps maximal de mise en cache de session en minutes est null.
pt-error-not-valid-exp=Expression (a/b) non valide.
pt-error-null-operands=Op\u00e9randes null.
pt-error-key-not-found=Cl\u00e9 requise introuvable dans amtune-env.properties.
pt-error-getting-jvm-options=Erreur lors de l\u2019obtention des options JVM en cours.
pt-error-getting-thread-pool-prop=Erreur lors de l\u2019obtention de la propri\u00e9t\u00e9 du pool de threads.
pt-error-getting-http-list-prop=Erreur lors de l\u2019obtention de la propri\u00e9t\u00e9 du listener http.
pt-error-getting-stats-prop=Erreur lors de l\u2019obtention de la propri\u00e9t\u00e9 de statistiques.
pt-error-invalid-db-entry-cache-size=La taille d\u2019une entr\u00e9e de cache DB ne peut pas \u00eatre \u00e9gale \u00e0 0.
pt-error-invalid-new-db-entry-cache-size=La taille d\u2019une nouvelle entr\u00e9e de cache DB ne peut pas \u00eatre \u00e9gale \u00e0 0.
pt-error-zonadm=Erreur lors de l\u2019ex\u00e9cution de la commande zoneadm.
pt-error-cmd-error=Erreur lors de l\u2019ex\u00e9cution de la commande. 
pt-error-invalid-root-suffix=Suffixe racine de l\u2019organisation non valide.
pt-error-ds-conf-file-backup=Impossible d\u2019obtenir la sauvegarde du fichier de configuration de Directory Server.
pt-error-opensso-srv-config=Erreur durant le r\u00e9glage de la configuration du serveur OpenAM.
pt-error-invalid-as-secure-prop=Valeur ASADMIN_SECURE non valide.
pt-error-null-as-target=La cible du serveur d\u2019application est null.
pt-error-invalid-port-no=Num\u00e9ro de port non valide.
pt-error-invalid-ws-secure-prop=Valeur WSADMIN_SECURE non valide.
pt-error-ws-deployment-failed=\u00c9chec du d\u00e9ploiement de Web Server. Essayez de red\u00e9marrer le conteneur manuellement.
pt-error-invalid-ws-ssl=Valeur ssl non valide.
pt-error-ws-port-ssl-msg=WSADMIM_PORT est un port s\u00e9curis\u00e9, attribuez la valeur --ssl=true \u00e0 la propri\u00e9t\u00e9 WSADMIN_SECURE.
pt-error-as-port-ssl-msg=ASADMIN_PORT n\u2019est pas s\u00e9curis\u00e9, laissez ASADMIN_SECURE vide.
pt-usage=Utilisation\u00a0:     amtune [<chemin absolu du fichier de mots de passe> | --help | -?]

#####################################################################
# Do not localize below message
#####################################################################
pt-as-acceptor-threads-msg=1.   Threads d\u2019accepteur
pt-as-pending-count-threads-msg=2.   Threads de nombre en attente maximal 
pt-as-queue-size-msg=3.   Taille de file d\u2019attente
pt-as-heap-size-msg=4.   Tailles maximale et minimale de tas
pt-as-loggc-output-msg=5.   Sortie LogGC
pt-as-server-mode-msg=6.   JVM en mode serveur
pt-as-stack-size-msg=7.   Taille de pile
pt-as-new-size-msg=8.   Nouvelle taille
pt-as-max-new-size-msg=9.  Nouvelle taille maximale
pt-as-diable-gc-msg=10. D\u00e9sactiver GC explicite
pt-as-use-parallel-gc-msg=11.  Utiliser un nouveau GC parall\u00e8le
pt-as-histo-msg=12.  Imprimer un histogramme de classe
pt-as-gc-time-stamp-msg=13.  Imprimer des horodatages GC
pt-as-sweep-mark-gc-msg=14.  Activer le GC de balayage de marque concurrente
pt-as-server-sec-policy-check-msg=15.  D\u00e9sactiver les v\u00e9rifications de strat\u00e9gie de s\u00e9curit\u00e9 de serveur
pt-as-parallel-gc-threads-msg=16.  Threads GC parall\u00e8les
pt-as-rqst-proc-init-threads-msg=17.  Requ\u00eate de traitement du d\u00e9compte de threads initiaux
pt-as-rqst-proc-thread-count-msg=18.  Requ\u00eate de traitement du d\u00e9compte de threads
pt-review-msg=Mode amtune       : REVIEW
pt-change-msg=Mode amtune       : CHANGE
pt-os-msg=OS                : 
pt-fam-msg=OpenAM          : 
pt-ds-msg=R\u00e9pertoire         : 
pt-web-msg=Conteneur Web     : 
pt-ws-64-msg=Mode du conteneur Web           : 64 bits
pt-ws-32-msg=Mode du conteneur Web           : 32 bits
pt-ws-acceptor-msg=Threads d\u2019accepteur : 
pt-mem-avail-msg=M\u00e9moire disponible (Mo)\u00a0: 
pt-mem-to-use-msg=M\u00e9moire utilisable (Mo)\u00a0: 
pt-max-heap-size-msg=Taille max de tas (Mo)\u00a0: 
pt-min-heap-size-msg=Taille min de tas (Mo)\u00a0: 
pt-max-new-size-msg=Nouvelle taille max (Mo)\u00a0: 
pt-max-perm-size-msg=Taille max autoris\u00e9e (Mo)\u00a0: 
pt-cache-size-msg=Taille du cache (Mo)\u00a0: 
pt-sdk-cache-size-msg=Taille du cache SDK (Mo)\u00a0: 
pt-no-sdk-cache-ent-msg=Nombre d\u2019entr\u00e9es de cache SDK\u00a0: 
pt-session-cache-size-msg=Taille du cache de session (Mo)\u00a0: 
pt-no-session-cache-ent-msg=Nombre d\u2019entr\u00e9es de cache de session\u00a0: 
pt-max-java-threads-msg=Nombre maximum de threads Java\u00a0: 
pt-rq-thro-msg=RQThrottle\u00a0: 
pt-max-thread-pool-msg=Nombre maximum de pools de threads\u00a0: 
pt-ldap-auth-threads-msg=Threads d\u2019authentification LDAP\u00a0: 
pt-sm-ldap-threads-msg=Threads LDAP de gestion de services\u00a0: 
pt-notification-threads-msg=Threads de notification\u00a0: 
pt-notification-queue-size-msg=Taille de la file d\u2019attente de notification\u00a0: 
pt-no-worker-threads-msg=Nombre de threads de travail 
pt-db-dn-msg=Valeur DB DN 
pt-entry-size-msg=Taille du cache d\u2019entr\u00e9e DB pour le syst\u00e8me d\u2019arri\u00e8re-plan 
pt-back-end-suffix-msg=Suffixe pour le syst\u00e8me d\u2019arri\u00e8re-plan 
pt-db-size-msg=Taille du cache DB.  
pt-db-name-msg=Nom DB 
pt-root-suffix-msg=Suffixe racine                               :   
pt-db-db-suffix-msg=DB DN pour le suffixe                          : 
pt-db-dir-suffix-msg=R\u00e9pertoire DB pour suffixe racine              : 
pt-ds-worker-threads-msg=1.   Threads de travail DS
pt-access-log-msg=2.   Journal d\u2019acc\u00e8s \u00e0 DS
pt-db-cache-size-msg=3.   Taille du cache DB
pt-db-entry-size-msg=4.   Taille de cache d\u2019entr\u00e9e DB
pt-aci-msg=5.   ACI
pt-dn-msg=DN                    : 
pt-attribute-msg=Attribut            :   
pt-suffix-msg=Suffixe                : 
pt-ds-worker-msg=Threads de travail DS 
pt-minconpool-msg=1.   minConnPool
pt-maxconpool-msg=2.   maxConnPool
pt-minthreads-msg=1.   Threads minimaux
pt-maxthreads-msg=2.   Threads max
pt-queuesize-msg=3.   Taille de file d\u2019attente
pt-nativestacksize-msg=4.   Taille de pile native
pt-acceptorthreads-msg=5.   Threads d\u2019accepteur
pt-stats-msg=6.   Statistiques
pt-maxminheap-msg=7.   Tailles maximale et minimale de tas
pt-loggcoutput-msg=8.   Sortie LogGC
pt-jvmserver-msg=9.   JVM en mode serveur
pt-jvmstacksize-msg=10.   Taille de pile JVM
pt-newsize-msg=11.   Nouvelle taille
pt-maxnewsize-msg=12.   Nouvelle taille maximale
pt-disableexp-gc-mg=13.   D\u00e9sactiver GC explicite
pt-newpar-gc-msg=14.   Utiliser un nouveau GC parall\u00e8le
pt-prnclasshistogc-msg=15.   Imprimer un histogramme de classe
pt-prngctimestamp-msg=16.   Imprimer des horodatages GC
pt-concmskgc-msg=17.  Activer le GC de balayage de marque concurrente
pt-parallel-gc-threads-msg=20.  Threads GC parall\u00e8les
pt-sol-fd-msg=1.   rlim_fd_max 
pt-sol-fd-cur-msg=2.   rlim_fd_cur 
pt-sol-tcp-hash-size-msg=3.   tcp:tcp_conn_hash_size=
pt-tcp-wait-2-flush-interval=1.   /dev/tcp tcp_fin_wait_2_flush_interval
pt-tcp-conn-req-maz-q=2.   /dev/tcp tcp_conn_req_max_q
pt-tcp-conn-req-max-q0=3.   /dev/tcp tcp_conn_req_max_q0"
pt-tcp-keepalive-interval=4.   /dev/tcp tcp_keepalive_interval
pt-tcp-smallest-anon-port=5.  /dev/tcp tcp_smallest_anon_port
pt-tcp-slow-start-initial=6.  /dev/tcp tcp_slow_start_initial
pt-tcp-xmit-hiwat=7.  /dev/tcp tcp_xmit_hiwat
pt-tcp-recv-hiwat=8.  /dev/tcp tcp_recv_hiwat
pt-tcp-ip-abort-cinterval=9.  /dev/tcp tcp_ip_abort_cinterval
pt-tcp-deferred-ack-interval=10.  /dev/tcp tcp_deferred_ack_interval
pt-tcp-strong-iss=11.  /dev/tcp tcp_strong_iss
pt-stack-size-msg=1.   Taille de pile 
pt-lnx-file-max=1.   fs.file-max
pt-lnx-ip-local-port-range=2.   net.ipv4.ip_local_port_range
pt-lnx-core-rmem-max-msg=3.   net.core.rmem_max
pt-lnx-tcp-rmem-msg=4.   net.ipv4.tcp_rmem
pt-lnx-tcp-wmem-msg=5.   net.ipv4.tcp_wmem
pt-lnx-tcp-sack-msg=6.   net.ipv4.tcp_sack
pt-lnx-tcp-timestamps-msg=7.   net.ipv4.tcp_timestamps
pt-lnx-tcp-window-scaling-msg=8.   net.ipv4.tcp_window_scaling
pt-lnx-tcp-keepalive-time-msg=9.  net.ipv4.tcp_keepalive_time
pt-lnx-tcp-keepalive-intvl-msg=10.  net.ipv4.tcp_keepalive_intvl
pt-lnx-tcp-fin-timeout-msg=11.  net.ipv4.tcp_fin_timeout
pt-min-max-ldap-conn-pool=1.    Taille minimale/maximale du pool de connexion LDAP
pt-max-cache-size-msg=2.    Taille maximum du cache
