#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amLDAPv3Repo_de.properties,v 1.11 2009/12/26 03:54:18 cbasha Exp $
#
#

0=LDAP-Fehler 0: Der Vorgang wurde erfolgreich abgeschlossen.
1=LDAP-Fehler 1: Es ist ein interner LDAP-Server-Fehler aufgetreten.
2=LDAP-Fehler 2: Der LDAP-Server konnte die von Ihrem Client gesendeten Anforderungen nicht richtig interpretieren, da die Anforderung dem LDAP-Protokoll nicht exakt entspricht.
3=LDAP-Fehler 3: Der Suchvorgang konnte nicht innerhalb des maximal vorgegebenen Zeitraums abgeschlossen werden. 
4=LDAP-Fehler 4: Aus der Suche sind mehr Ergebnisse als maximal zul\u00e4ssig hervorgegangen. 
5=LDAP-Fehler 5: Wert, der vom LDAP-Vergleichsvorgang zur\u00fcckgegeben wird, wenn das angegebene Attribut bzw. der Wert im Eintrag nicht gefunden werden (kein \u00fcbereinstimmender Wert gefunden). 
6=LDAP-Fehler 6: Wert, der vom LDAP-Vergleichsvorgang zur\u00fcckgegeben wird, wenn das angegebene Attribut bzw. der Wert im Eintrag gefunden werden (\u00fcbereinstimmender Wert gefunden). 
7=LDAP-Fehler 7: Die angegebene Authentifizierungsmethode wird vom LDAP-Server, mit dem Sie eine Verbindung herstellen, nicht unterst\u00fctzt. 
8=LDAP-Fehler 8: Eine strengere Authentifizierungsmethode (h\u00f6her als LDAP_AUTH_SIMPLE) wird vom LDAP-Server, mit dem Sie eine Verbindung herstellen, gefordert.
9=LDAP-Fehler 9: Der LDAP-Server verweist Ihren Client per Bezug auf einen anderen LDAP-Server und w\u00e4hrend des Bezugsvorgangs tritt ein Fehler auf.  
10=LDAP-Fehler 10: Der angeforderte Eintrag ist auf dem Server nicht verf\u00fcgbar. 
11=LDAP-Fehler 11: Das Verwaltungslimit f\u00fcr die maximale Anzahl zur\u00fcckzugebender Eintr\u00e4ge wurde \u00fcberschritten. 
12=LDAP-Fehler 12: Der Server hat eine LDAP v3-Steuerung empfangen, die als kritisch gekennzeichnet ist und entweder (1) vom Server nicht erkannt oder unterst\u00fctzt wird, oder (2) f\u00fcr den angeforderten Vorgang ungeeignet ist. 
13=LDAP-Fehler 13: F\u00fcr diesen Vorgang ist eine sichere Verbindung erforderlich.
14=LDAP-Fehler 14: SASL-Bind aktiv.
15=LDAP-Fehler 15: 
16=LDAP-Fehler 16: Das angegebene Attribut wurde nicht gefunden.
17=LDAP-Fehler 17: Das angegebene Attribut wurde nicht definiert.
18=LDAP-Fehler 18: Es wurde ein ungeeigneter \u00dcbereinstimmungstyp verwendet.
19=LDAP-Fehler 19: Es ist ein interner LDAP-Server-Fehler aufgetreten.
20=LDAP-Fehler 20: Der Wert, den Sie zum Attribut hinzuf\u00fcgen, ist in diesem Attribut bereits enthalten.
21=LDAP-Fehler 21: Die Anforderung weist eine ung\u00fcltige Syntax auf.
22=LDAP-Fehler: 22
23=LDAP-Fehler: 23
24=LDAP-Fehler: 24
25=LDAP-Fehler: 25
26=LDAP-Fehler: 26
27=LDAP-Fehler: 27
28=LDAP-Fehler: 28
29=LDAP-Fehler: 29
30=LDAP-Fehler: 30
31=LDAP-Fehler: 31
32=LDAP-Fehler 32: Der in der Anforderung angegebene Eintrag ist nicht vorhanden.
33=LDAP-Fehler 33: Es ist ein Problem mit einem Alias aufgetreten.
34=LDAP-Fehler 34: Der angegebene Distinguished Name (DN) verwendet eine ung\u00fcltige Syntax.
35=LDAP-Fehler 35: Bei dem angegebenen Eintrag handelt es sich um einen "Leaf"-Eintrag.
36=LDAP-Fehler 36: Beim L\u00f6sen des Verweises auf einen Alias ist ein Fehler aufgetreten.
37=LDAP-Fehler: 37
38=LDAP-Fehler: 38
39=LDAP-Fehler: 39
40=LDAP-Fehler: 40
41=LDAP-Fehler: 41
42=LDAP-Fehler: 42
43=LDAP-Fehler: 43
44=LDAP-Fehler: 44
45=LDAP-Fehler: 45
46=LDAP-Fehler: 46
47=LDAP-Fehler: 47
48=LDAP-Fehler 48: Die dem Server vorgelegte Authentifizierung ist unzul\u00e4ssig.
49=LDAP-Fehler 49: Die dem Server vorgelegten Anmeldeinformationen f\u00fcr die Authentifizierung sind ung\u00fcltig.
50=LDAP-Fehler 50: Der Client wird als Benutzer authentifiziert, der nicht \u00fcber die Berechtigungen zum Durchf\u00fchren dieses Vorgangs verf\u00fcgt.
51=LDAP-Fehler 51: Der LDAP-Server ist besch\u00e4ftigt.
52=LDAP-Fehler 52: Der LDAP-Server ist nicht verf\u00fcgbar.
53=LDAP-Fehler 53: Der LDAP-Server kann den angegebenen Vorgang nicht durchf\u00fchren.
54=LDAP-Fehler 54: Es wurde eine Schleife gefunden.
56=LDAP-Fehler: 56
57=LDAP-Fehler: 57
58=LDAP-Fehler: 58
59=LDAP-Fehler: 59
60=LDAP-Fehler 60: Die "server-side sorting"-Steuerung war nicht in der "virtual list view"-Steuerung der Suchanforderung eingeschlossen.
61=LDAP-Fehler 61: Es ist ein Indexbereich-Fehler aufgetreten.
62=LDAP-Fehler: 62
63=LDAP-Fehler: 63
64=LDAP-Fehler 64: Es ist eine Namensverletzung aufgetreten.
65=LDAP-Fehler 65: Durch den angeforderten Vorgang werden Daten hinzugef\u00fcgt oder ge\u00e4ndert. Somit stimmen die Daten nicht mehr mit dem Schema \u00fcberein.
66=LDAP-Fehler 66: Der angeforderte Vorgang kann nur auf einen Eintrag durchgef\u00fchrt werden, der \u00fcber keine untergeordneten Eintr\u00e4ge im Verzeichnisbaum verf\u00fcgt (ein "Leaf"-Eintrag).
67=LDAP-Fehler 67: Der angegebene Vorgang kann nicht f\u00fcr einen Relative Distinguished Name (RDN) durchgef\u00fchrt werden.
68=LDAP-Fehler 68: Der angegebene Eintrag ist bereits vorhanden.
69=LDAP-Fehler 69: Sie k\u00f6nnen die angegebene Objektklasse nicht \u00e4ndern.
70=LDAP-Fehler: 70
71=LDAP-Fehler 71: Der Client hat versucht, einen Eintrag von einem LDAP-Server auf einen anderen zu verschieben, indem er einen Vorgang zum \u00c4ndern eines DN angefordert hat.
72=LDAP-Fehler: 72
73=LDAP-Fehler: 73
74=LDAP-Fehler: 74
75=LDAP-Fehler: 75
76=LDAP-Fehler: 76
77=LDAP-Fehler: 77
78=LDAP-Fehler: 78
79=LDAP-Fehler: 79
80=LDAP-Fehler 80: Allgemeiner Ergebniscode f\u00fcr andere Arten von Fehlern, die auftreten k\u00f6nnen.
81=LDAP-Fehler 81: Der LDAP-Server kann nicht kontaktiert werden.
82=LDAP-Fehler: 82
83=LDAP-Fehler: 83
84=LDAP-Fehler: 84
85=LDAP-Fehler 85: Der Vorgang konnte nicht innerhalb des maximal vorgegebenen Zeitraums abgeschlossen werden.
86=LDAP-Fehler: 86
87=LDAP-Fehler: 87
88=LDAP-Fehler: 88
89=LDAP-Fehler 89: Beim Aufrufen eines Erstellers oder einer Methode von Ihrem Client wurden ein oder mehrere Parameter falsch angegeben.
90=LDAP-Fehler: 90
91=LDAP-Fehler 91: Ihr LDAP-Client konnte keine Verbindung zum LDAP-Server herstellen.
92=LDAP-Fehler 92: Die Anforderung wird von dieser Version des LDAP-Protokolls nicht unterst\u00fctzt.
93=LDAP-Fehler 93: Die angeforderte Steuerung wurde nicht gefunden. 
94=LDAP-Fehler 94: Der Server hat keine Ergebnisse zur\u00fcckgegeben.
95=LDAP-Fehler 95: Es werden mehrere Ergebnisse vom Server zur\u00fcckgegeben.
96=LDAP-Fehler 96: Der LDAP-Client hat eine Schleife im Bezug gefunden.
97=LDAP-Fehler 97: Die Anzahl aufeinander folgender Bez\u00fcge (z. B. wird der Client m\u00f6glicherweise zun\u00e4chst vom LDAP-Server A auf LDAP-Server B verwiesen, anschlie\u00dfend von LDAP-Server B auf LDAP-Server C usw.) hat die maximal zul\u00e4ssige Anzahl an Bez\u00fcgen \u00fcberschritten.
