<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>ID-FF-Dienstanbieter-Anpassung - Online-Hilfe zur Sun OpenSSO 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.idffsp"></a><h4>ID-FF-Dienstanbieter-Anpassung</h4>
<p>Die ID-FF-Dienstanbieter-Attribute werden in die folgenden Abschnitte gruppiert:</p>
<ul><li><p><a href="#ggwvs">Allgemeine Attribute</a></p></li>
<li><p><a href="#ggwvp">Kommunikations-URLs</a></p></li>
<li><p><a href="#ggwrw">Kommunikationsprofile</a></p></li>
<li><p><a href="#ggwud">Dienstanbieter-Konfiguration </a></p></li>
<li><p><a href="#ggwyd">Dienst-URL</a></p></li>
<li><p><a href="#ggwsf">Plugins</a></p></li>
<li><p><a href="#ggwtb">Dienstanbieter-Attributzuordnungsfunktion</a></p></li>
<li><p><a href="#ggwtp">Automatische Verbindung </a></p></li>
<li><p><a href="#ggwrv">Authentifizierungskontext</a></p></li>
<li><p><a href="#ggwub">Proxy-Authentifizierungskonfiguration</a></p></li></ul>


<a name="ggwvs"></a><h5>Allgemeine Attribute</h5>

<ul><li><p><a href="#ggwwh">Anbietertyp</a></p></li>
<li><p><a href="#ggwrt">Beschreibung</a></p></li>
<li><p><a href="#ggwuu">Protokollunterst&#252;tzungsaufz&#228;hlung</a></p></li>
<li><p><a href="#ggwwn">Signaturschl&#252;ssel</a></p></li>
<li><p><a href="#ggwuj">Versch&#252;sselungsschl&#252;ssel</a></p></li>
<li><p><a href="#ggwsc">Verschl&#252;sselung des Namensbezeichners</a></p></li>
<li><p><a href="#ggwwa">Authentifizierungsanforderung signieren</a></p></li></ul>


<a name="ggwwh"></a><h5>Anbietertyp</h5>
<p>Der statische Wert dieses Attributs ist der zu konfigurierende Anbietertyp: gehostet oder
remote</p>

<a name="ggwrt"></a><h5>Beschreibung</h5>
<p>Beim Wert dieses Attributs handelt es sich um eine Beschreibung des Dienstanbieters.</p>

<a name="ggwuu"></a><h5>Protokollunterst&#252;tzungsaufz&#228;hlung</h5>
<p>W&#228;hlen Sie die Liberty ID-FF-Ver&#246;ffentlichung, die von diesem Anbieter unterst&#252;tzt wird.</p>
<ul><li><p><tt>urn:liberty:iff:2003-08</tt> verweist auf Liberty Identity Federation Framework Version 1.2.</p></li>
<li><p><tt>urn:liberty:iff:2002-12</tt> verweist auf Liberty Identity Federation Framework Version 1.1.</p></li></ul>


<a name="ggwwn"></a><h5>Signaturschl&#252;ssel</h5>
<p>Definiert den Schl&#252;ssel-Alisas, der f&#252;r das Signieren von Anforderungen und Antworten verwendet
wird. Zertifikate werden in einer Java-Keystore-Datei gespeichert. Jedes einzelne Zertifikat wird einem
Alias zugeordnet, der f&#252;r das Abrufen des Zertifikats verwendet wird.</p>

<a name="ggwuj"></a><h5>Versch&#252;sselungsschl&#252;ssel</h5>
<p>Definiert den Sicherheitszertifikatsalias, der f&#252;r die Verschl&#252;sselung verwendet wird. Zertifikate werden in
einer Java-Keystore-Datei gespeichert. Jedes einzelne Zertifikat wird einem Alias zugeordnet, der f&#252;r
das Abrufen des Zertifikats verwendet wird.</p>

<a name="ggwsc"></a><h5>Verschl&#252;sselung des Namensbezeichners</h5>
<p>Aktivieren Sie dieses Kontrollk&#228;stchen, um die Verschl&#252;sselung des Namensbezeichners zu aktivieren.</p>

<a name="ggwwa"></a><h5>Authentifizierungsanforderung signieren</h5>
<p>Wenn aktiviert, signiert der Dienstanbieter alle Authentifizierungsanforderungen.</p>

<a name="ggwvp"></a><h5>Kommunikations-URLs</h5>

<ul><li><p><a href="#ggwrz">SOAP-Endpunkt</a></p></li>
<li><p><a href="#ggwun">Einzelabmeldungsdienst </a></p></li>
<li><p><a href="#ggwrn">Umleitungs-URL f&#252;r Einzelabmeldung</a></p></li>
<li><p><a href="#ggwvg">Verbindungstrennungsdienst</a></p></li>
<li><p><a href="#ggwup">Umleitungs-URL f&#252;r Verbindungstrennung</a></p></li>
<li><p><a href="#ggwry">Namensregistrierungsdienst</a></p></li>
<li><p><a href="#ggwvd">Umleitungs-URL f&#252;r Namensregistrierung</a></p></li>
<li><p><a href="#ggwtq">Assertion Consumer-URL</a></p></li>
<li><p><a href="#ggwrh">URL-ID des Assertion Consumer-Dienstes</a></p></li>
<li><p><a href="#ggwvi">URL des Assertion Consumer-Dienstes als Standard festlegen</a></p></li></ul>


<a name="ggwrz"></a><h5>SOAP-Endpunkt</h5>
<p>Defniert einen URI f&#252;r den SOAP-Nachrichtenempf&#228;nger des Dienstanbieters.  Dieser Wert legt
die Adresse des SOAP-Empf&#228;ngers f&#252;r Kommunikationen fest, die nicht &#252;ber einen Browser
erfolgen.</p>

<a name="ggwun"></a><h5>Einzelabmeldungsdienst </h5>
<p>Geben Sie einen URL ein, an den Identity-Anbieter Abmeldeanforderungen senden k&#246;nnen. 
Die Einzelabmeldung synchronisiert die Abmeldefunktion &#252;ber alle von diesem Identity-Anbieter authentifizierten Sitzungen.</p>

<a name="ggwrn"></a><h5>Umleitungs-URL f&#252;r Einzelabmeldung</h5>
<p>Definiert einen URL, an den Identity-Anbieter Einzelabmeldungsantworten senden k&#246;nnen.</p>

<a name="ggwvg"></a><h5>Verbindungstrennungsdienst</h5>
<p>Definiert einen URL, an den Identity-Anbieter Verbindungstrennungsanforderungen senden k&#246;nnen.</p>

<a name="ggwup"></a><h5>Umleitungs-URL f&#252;r Verbindungstrennung</h5>
<p>Definiert einen URL, an den Identity-Anbieter Verbindungstrennungsantworten senden k&#246;nnen.</p>

<a name="ggwry"></a><h5>Namensregistrierungsdienst</h5>
<p>Definiert URLs, die f&#252;r die Kommunikation mit dem Identity-Anbieter verwendet werden, um
einen neuen Namensbezeichner f&#252;r den Principal anzugeben. (Die Registrierung kann erst stattfinden,
nachdem eine Verbindungssitzung eingerichtet wurde.)</p>

<a name="ggwvd"></a><h5>Umleitungs-URL f&#252;r Namensregistrierung</h5>
<p>Definiert einen URL, an den Identity-Anbieter Namensregistrierungsantworten senden k&#246;nnen. (Die Registrierung kann
erst stattfinden, nachdem eine Verbindungssitzung eingerichtet wurde.)</p>

<a name="ggwtq"></a><h5>Assertion Consumer-URL</h5>
<p>Definiert den URL, an den Identity-Anbieter SAML-Assertions senden k&#246;nnen. </p>

<a name="ggwrh"></a><h5>URL-ID des Assertion Consumer-Dienstes</h5>
<p>Wenn der Wert des allgemeinen Attributs der Protokollunterst&#252;tzung <tt>urn:liberty:iff:2003-08</tt> lautet, geben Sie
die erforderliche ID ein.</p>

<a name="ggwvi"></a><h5>URL des Assertion Consumer-Dienstes als Standard festlegen</h5>
<p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn Sie den URL des Assertion Consumer-Dienstes als
Standardwert verwenden m&#246;chten, falls eine Anforderung keinen Bezeichner enth&#228;lt.</p>

<a name="ggwrw"></a><h5>Kommunikationsprofile</h5>

<ul><li><p><a href="#ggwwg">Verbindungstrennung</a></p></li>
<li><p><a href="#ggwuc">Einzelabmeldung</a></p></li>
<li><p><a href="#ggwsy">Namensregistrierung</a></p></li>
<li><p><a href="#ggwuk">Unterst&#252;tztes SSO-Profil</a></p></li></ul>


<a name="ggwwg"></a><h5>Verbindungstrennung</h5>
<p>W&#228;hlen Sie ein Profil aus, um andere Anbieter &#252;ber die Verbindungstrennung eines
Principals zu benachrichtigen:</p>
<ul><li><p>HTTP Redirect</p></li>
<li><p>SOAP</p></li></ul>


<a name="ggwuc"></a><h5>Einzelabmeldung</h5>
<p>W&#228;hlen Sie ein Profil aus, um andere Anbieter &#252;ber die Abmeldung eines
Principals zu benachrichtigen:</p>
<ul><li><p>HTTP Redirect</p></li>
<li><p>HTTP Get</p></li>
<li><p>SOAP</p></li></ul>


<a name="ggwsy"></a><h5>Namensregistrierung</h5>
<p>W&#228;hlen Sie ein Profil aus, um andere Anbieter &#252;ber die Namensregistrierung eines
Principals zu benachrichtigen:</p>
<ul><li><p>HTTP Redirect</p></li>
<li><p>SOAP</p></li></ul>


<a name="ggwuk"></a><h5>Unterst&#252;tztes SSO-Profil</h5>
<p>W&#228;hlen Sie ein Profil f&#252;r das Senden von Authentifizierungsanforderungen aus:</p>
<ul><li><p>Browser-Ver&#246;ffentlichung (Browser-basiertes HTTP POST-Protokoll)</p></li>
<li><p>Browser-Produkt (nicht Browser-basiertes SOAP-Protokoll)</p></li>
<li><p>WML (bezeichnet das Wireless Markup Language-Protokoll)</p></li>
<li><p>LECP (Liberty-f&#228;higer Client-Proxy)</p>
<hr><p><b>Hinweis &#8211; </b>OpenSSO kann Anforderungen verarbeiten, die von einem Liberty-aktivierten Client-Proxy-Profil stammen. Es erfordert jedoch eine weitere Konfiguration, die &#252;ber den Umfang dieses Handbuchs hinausgeht.</p>
<hr>
</li></ul>


<a name="ggwud"></a><h5>Dienstanbieter-Konfiguration </h5>

<ul><li><p><a href="#ggwtx">Anbieter-Alias</a></p></li>
<li><p><a href="#ggwuf">Authentifizierungstyp</a></p></li>
<li><p><a href="#ggwvl">Identity-Anbieter hat Authentifizierung erzwungen.</a></p></li>
<li><p><a href="#ggwrk">Anforderung an Identity-Anbieter, passiven Status einzunehmen</a></p></li>
<li><p><a href="#ggwwi">Namensregistrierung nach Verbindung</a></p></li>
<li><p><a href="#ggwsq">Namens-ID-Richtlinie</a></p></li>
<li><p><a href="#ggwvr">Affiliation Federation (Partnerverbindung)</a></p></li>
<li><p><a href="#ggwwp">Anbieterstatus</a></p></li>
<li><p><a href="#ggwti">Antwortet mit</a></p></li></ul>


<a name="ggwtx"></a><h5>Anbieter-Alias</h5>
<p>Definiert den Aliasnamen f&#252;r den lokalen Dienstanbieter.</p>

<a name="ggwuf"></a><h5>Authentifizierungstyp</h5>
<p>W&#228;hlen Sie den Anbieter aus, der f&#252;r Authentifizierungsanforderungen eines lokal gehosteten Anbieters
verwendet werden soll.</p>
<ul><li><p><b>Remote</b> legt fest, dass der lokale Host-Anbieter bei Empfang einer Authentifizierungsanforderung einen Remote-Identity-Anbieter kontaktiert.</p></li>
<li><p><b>Lokal</b> legt fest, dass der lokale Host-Anbieter bei Empfang einer Authentifizierungsanforderung einen lokalen Identity-Anbieter (im Prinzip sich selbst) kontaktiert.</p></li></ul>


<a name="ggwvl"></a><h5>Identity-Anbieter hat Authentifizierung erzwungen.</h5>
<p>Aktivieren Sie dieses Kontrollk&#228;stchen, um anzugeben, dass der Identity-Anbieter eine erneute Authentifizierung
durchf&#252;hren muss (auch wenn er sich in einer aktiven Sitzung befindet), wenn
er eine neue Authentifizierungsanforderung erh&#228;lt.  Dieses Attribut ist standardm&#228;&#223;ig aktiviert.</p>

<a name="ggwrk"></a><h5>Anforderung an Identity-Anbieter, passiven Status einzunehmen</h5>
<p>W&#228;hlen Sie dieses Kontrollk&#228;stchen aus, um anzugeben, dass der Identity-Anbieter nicht mit
dem Principal interagieren darf und mit dem Benutzer interagieren muss.</p>

<a name="ggwwi"></a><h5>Namensregistrierung nach Verbindung</h5>
<p>Wenn diese Option aktiviert ist, wird dem Dienstanbieter die Teilnahme an der
Namensregistrierung erm&#246;glicht, nachdem der Zusammenschluss erfolgt ist.</p>

<a name="ggwsq"></a><h5>Namens-ID-Richtlinie</h5>
<p>Eine Aufz&#228;hlung, mit der der anfordernde Benutzer Einfluss auf die Namens-ID-Richtlinie beim
Identity-Anbieter hat. </p>

<a name="ggwvr"></a><h5>Affiliation Federation (Partnerverbindung)</h5>
<p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn Sie die Zuordnungsf&#246;derierung aktivieren m&#246;chten.</p>

<a name="ggwwp"></a><h5>Anbieterstatus</h5>
<p>Definiert, ob der Dienstanbieter aktiv oder inaktiv ist. Der Standard, aktiv, bedeutet,
dass der Dienstanbieter Anforderungen verarbeiten und Antworten erzeugen kann. </p>

<a name="ggwti"></a><h5>Antwortet mit</h5>
<p>Gibt den Typ von Anweisungen an, die der Dienstanbieter erzeugen kann. Zum
Beispiel: <tt>lib:AuthenticationStatement</tt></p>

<a name="ggwyd"></a><h5>Dienst-URL</h5>

<ul><li><p><a href="#ggwro">URL der Seite mit COTs</a></p></li>
<li><p><a href="#ggwri">URL der verbundenen Seite</a></p></li>
<li><p><a href="#ggwtf">Homepage-URL</a></p></li>
<li><p><a href="#ggwsa">Umleitungs-URL bei Fehler bei Single Sign-On</a></p></li>
<li><p><a href="#ggwta">URL f&#252;r Trennung fertig</a></p></li>
<li><p><a href="#ggwrd">Fehlerseiten-URL</a></p></li>
<li><p><a href="#ggwth">URL f&#252;r Abmeldung fertig</a></p></li></ul>


<a name="ggwro"></a><h5>URL der Seite mit COTs</h5>
<p>Definiert den URL, den alle Circles of Trust auflistet, zu denen der
Anbieter geh&#246;rt.</p>

<a name="ggwri"></a><h5>URL der verbundenen Seite</h5>
<p>Gibt den URL an, der den Verbindungsvorgang durchf&#252;hrt. </p>

<a name="ggwtf"></a><h5>Homepage-URL</h5>
<p>Definiert den URL der Homepage des Identity-Anbieters.</p>

<a name="ggwsa"></a><h5>Umleitungs-URL bei Fehler bei Single Sign-On</h5>
<p>Definiert den URL, an den ein Principal umgeleitet wird, wenn das Single
Sign-On fehlschl&#228;gt.</p>

<a name="ggwta"></a><h5>URL f&#252;r Trennung fertig</h5>
<p>Definiert den URL, zu dem ein Principal nach Abschluss der Verbindungstrennung weitergeleitet
wird.</p>

<a name="ggwrd"></a><h5>Fehlerseiten-URL</h5>
<p>Definiert den URL, zu dem ein Principal bei einem Fehler weitergeleitet wird.
</p>

<a name="ggwth"></a><h5>URL f&#252;r Abmeldung fertig</h5>
<p>Definiert den URL, zu dem ein Principal nach dem Abmelden weitergeleitet wird.</p>

<a name="ggwsf"></a><h5>Plugins</h5>

<ul><li><p><a href="#ggwuh">Dienstanbieter-Adapter</a></p></li>
<li><p><a href="#ggwtd">Verbindungs-SP-Adapter-Umschlag</a></p></li>
<li><p><a href="#ggwuv">Benutzeranbieterklasse</a></p></li>
<li><p><a href="#ggwsu">Implementierung des Namensbezeichners</a></p></li></ul>


<a name="ggwuh"></a><h5>Dienstanbieter-Adapter</h5>
<p>Definiert die Implementierungsklasse f&#252;r die <tt>com.sun.identity.federation.plugins.FSSPAdapter</tt>-Schnittstelle. Der Standardwert ist: </p><p><tt>com.sun.identity.federation.plugins.FSDefaultSPAdapter</tt> </p>

<a name="ggwtd"></a><h5>Verbindungs-SP-Adapter-Umschlag</h5>
<p>Definiert eine Liste mit Umgebungseigenschaften, die von der SPI-Implementierungsklasse des Dienstanbieteradapters verwendet
werden.</p>

<a name="ggwuv"></a><h5>Benutzeranbieterklasse</h5>
<p>Gibt eine plugf&#228;hige Klasse an, die verwendet wird, um Benutzervorg&#228;nge zur Verf&#252;gung
zu stellen, wie die Suche nach einem Benutzer, das Abrufen von Benutzerattributen
usw. Der Standardwert ist: </p><p><tt>com.sun.identity.federation.accountmgmt.DefaultFSUserProvider </tt> </p>

<a name="ggwsu"></a><h5>Implementierung des Namensbezeichners</h5>
<p>Dieses Feld legt die Klasse fest, die ein Dienstanbieter f&#252;r die Teilnahme
an der Namensregistrierung verwendet. Die Namensregistrierung ist ein Profil, anhand dessen die
Dienstanbieter den Namensbezeichner eines Principals angeben, den ein Identity-Anbieter f&#252;r die Kommunikation
mit dem Dienstanbieter verwendet.  The value is <tt>com.sun.identity.federation.services.util.FSNameIdentifierImpl </tt>.</p>

<a name="ggwtb"></a><h5>Dienstanbieter-Attributzuordnungsfunktion</h5>

<ul><li><p><a href="#ggwvz">Klasse der Attributzuordnungsfunktion</a></p></li>
<li><p><a href="#ggwsh">Dienstanbieter-Attributzuordnung</a></p></li></ul>


<a name="ggwvz"></a><h5>Klasse der Attributzuordnungsfunktion</h5>
<p>Die Klasse, die f&#252;r die Zuordnung von lokal definierten Benutzerattributen zu Attributen
in der SAML-Assertion verwendet wird. Es gibt keine Standardklasse. </p>

<a name="ggwsh"></a><h5>Dienstanbieter-Attributzuordnung</h5>
<p>Gibt die Werte an, die die Zuordnungen definieren, die vom standardm&#228;&#223;igen Attribut-Mapper-Plugin
verwendet werden.  Zuordnungen sollen in folgendem Format konfiguriert werden:</p><p><i>SAML-attribute</i>=<i>local-attribute </i></p><p>Beispiel: <tt>Email=emailaddress</tt> or <tt>Address=postaladdress </tt>.. Geben Sie die Zuordnung als neuen Wert ein
und klicken Sie auf "Hinzuf&#252;gen".</p>

<a name="ggwtp"></a><h5>Automatische Verbindung </h5>

<ul><li><p><a href="#ggwrl">Automatische Verbindung</a></p></li>
<li><p><a href="#ggwsd">Allgemeiner Attributname f&#252;r Auto-Verbindung</a></p></li></ul>


<a name="ggwrl"></a><h5>Automatische Verbindung</h5>
<p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn Sie die automatische Verbindung aktivieren m&#246;chten.</p>

<a name="ggwsd"></a><h5>Allgemeiner Attributname f&#252;r Auto-Verbindung</h5>
<p>Der allgemeine Name des LDAP-Attributs des Benutzers, wie beispielweise eine <tt>Telefonnummer</tt>. 
Zum Erstellen einer Attributsanweisung f&#252;r Auto-Verbindung. Wenn Sie eine Attributanweisung f&#252;r die
automatische Verbindung erstellen, wird der Wert dieses Attributs verwendet. Die Anweisung enth&#228;lt
das Attributelement und dieses h&#228;ufig verwendete Attribut als Wert. </p>

<a name="ggwrv"></a><h5>Authentifizierungskontext</h5>
<p>Dieses Attribut definiert die standardm&#228;&#223;ige Authentifizierungskontext-Klasse des Dienstanbieters (Authentifizierungsmethode). Diese Methode wird
immer verwendet, wenn der Service Anbieter eine Authentifizierungsanforderung sendet. Au&#223;erdem wird dieser
Authentifizierungskontext vom Dienstanbieter verwendet, wenn ein unbekannter Benutzer versucht, auf eine gesch&#252;tzte
Ressource zuzugreifen. Es stehen folgende Optionen zur Verf&#252;gung:</p><dl><dt>Unterst&#252;tzt</dt>
<dd><p>W&#228;hlen Sie das Kontrollk&#228;stchen neben der Authentifizierungskontext-Klasse aus, wenn diese vom Dienstanbieter unterst&#252;tzt wird.</p></dd>
<a name="indexterm-74"></a><a name="indexterm-75"></a><a name="indexterm-76"></a><dt>Kontextreferenz</dt>
<dd><p>Die Liberty-definierten Authentifizierungskontext-Klassen sind:</p>
<ul><li><p>Mobilvertrag</p></li>
<li><p>Mobile Digital-ID</p></li>
<li><p>MobileUnregistered</p></li>
<li><p>Password</p></li>
<li><p>Passwort-ProtectedTransport</p></li>
<li><p>Zur&#252;ck-Sitzung</p></li>
<li><p>Smartcard</p></li>
<li><p>Smartcard-PKI</p></li>
<li><p>Software-PKI</p></li>
<li><p>Time-Sync-Token</p></li></ul>
</dd>
<dt>Ebene</dt>
<dd><p>W&#228;hlen Sie eine Priorit&#228;tsebene f&#252;r F&#228;lle mit mehreren Kontexten aus.</p></dd>
</dl>


<a name="ggwub"></a><h5>Proxy-Authentifizierungskonfiguration</h5>

<ul><li><p><a href="#ggwur">Proxy-Authentifizierung</a></p></li>
<li><p><a href="#ggwrs">Liste der Proxy-Identity-Anbieter</a></p></li>
<li><p><a href="#ggwsr">Maximale Anzahl an Proxies</a></p></li>
<li><p><a href="#ggwtu">Einf&#252;hrungs-Cookie f&#252;r Proxyvorgang verwenden</a></p></li></ul>
<p>Proxy-Authentifizierungskonfigurationsattribute definieren Werte f&#252;r das dynamische Anbieter-Proxying.</p>

<a name="ggwur"></a><h5>Proxy-Authentifizierung</h5>
<p>W&#228;hlen Sie das Kontrollk&#228;stchen aus, um die Proxy-Authentifizierung f&#252;r einen Dienstanbieter zu
aktivieren.</p>

<a name="ggwrs"></a><h5>Liste der Proxy-Identity-Anbieter</h5>
<p>Geben Sie unter "Neuer Wert" einen Bezeichner f&#252;r (einen) Identity-Anbieter an, der
f&#252;r die Proxy-Authentifizierung verwendet werden kann, und klicken Sie auf "Hinzuf&#252;gen". Der
Wert ist ein URI, der als Bezeichner des Anbieters definiert ist.</p>

<a name="ggwsr"></a><h5>Maximale Anzahl an Proxies</h5>
<p>Geben Sie die maximale Anzahl an Identity-Anbietern ein, die f&#252;r die Proxy-Authentifizierung
verwendet werden k&#246;nnen.</p>

<a name="ggwtu"></a><h5>Einf&#252;hrungs-Cookie f&#252;r Proxyvorgang verwenden</h5>
<p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn zum Auffinden des Proxy-Identity-Anbieters Einf&#252;hrungs-Cookies verwendet werden
sollen.</p>
<br/>

</body>
</html>
