#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2012 Open Source Solution Technology Corporation. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# http://forgerock.org/license/CDDLv1.0.html
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at http://forgerock.org/license/CDDLv1.0.html
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# Portions Copyrighted 2013 Nomura Research Institute, Ltd

onlinehelp.doc=authnadaptive.html
authentication=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb
iplanet-am-auth-adaptive-service-description=\u30a2\u30c0\u30d7\u30c6\u30a3\u30d6\u30ea\u30b9\u30af

noInternalSession=\u7121\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3
noIdentity=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u5185\u306b\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u3092\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002

a500=\u8a8d\u8a3c\u30ec\u30d9\u30eb
a500.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a500.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0\uff08\u30c7\u30d5\u30a9\u30eb\u30c8\uff09\u304c\u6700\u4f4e\u3067\u3059\u3002
a502=\u30ea\u30b9\u30af\u3057\u304d\u3044\u5024
a502.help=\u6709\u52b9\u306b\u3057\u305f\u5168\u3066\u306e\u30c1\u30a7\u30c3\u30af\u51e6\u7406\u5b8c\u4e86\u5f8c\u3001\u30b9\u30b3\u30a2\u306e\u5408\u8a08\u304c\u30ea\u30b9\u30af\u3057\u304d\u3044\u5024\u306b\u5230\u9054\u3057\u306a\u3044\u5834\u5408\u306f\u8a8d\u8a3c\u306f\u6210\u529f\u3057\u307e\u3059\u3002
a502.help.txt=\u5404\u30c1\u30a7\u30c3\u30af\u306e\u7d50\u679c\uff08\u30b9\u30b3\u30a2)\u304c\u30a2\u30c0\u30d7\u30c6\u30a3\u30d6\u30ea\u30b9\u30af\u30c1\u30a7\u30c3\u30af\u306b\u95a2\u4fc2\u3057\u307e\u3059\u3002\u30c1\u30a7\u30c3\u30af\u306b\u5931\u6557\u3057\u305f\u5834\u5408\u3001\u30b9\u30b3\u30a2\u306f\u73fe\u5728\u306e\u7d2f\u8a08\u306b\u52a0\u3048\u3089\u308c\u307e\u3059\u3002 \
\u5168\u3066\u306e\u30c1\u30a7\u30c3\u30af\u5b9f\u65bd\u5f8c\u306b\u30b9\u30b3\u30a2\u306e\u7d2f\u8a08\u3068<i>\u30ea\u30b9\u30af\u3057\u304d\u3044\u5024</i>\u304c\u6bd4\u8f03\u3055\u308c\u3001\u30b9\u30b3\u30a2\u306e\u7d2f\u8a08\u304c\u3057\u304d\u3044\u5024\u3088\u308a\u5c0f\u3055\u3051\u308c\u3070\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u8a8d\u8a3c\u6210\u529f\u3068\u5224\u65ad\u3057\u307e\u3059\u3002
a503=\u8a8d\u8a3c\u5931\u6557\u30c1\u30a7\u30c3\u30af
a503.help=\u30e6\u30fc\u30b6\u30fc\u304c\u904e\u53bb\u306b\u8a8d\u8a3c\u5931\u6557\u3092\u3057\u3066\u3044\u308b\u304b\u3092\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002
a503.help.txt=OpenAM \u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u30e1\u30ab\u30cb\u30ba\u30e0\u304c\u30e6\u30fc\u30b6\u30fc\u306e\u904e\u53bb\u306e\u8a8d\u8a3c\u5931\u6557\u3092\u8a18\u9332\u3057\u305f\u304b\u3069\u3046\u304b\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u3053\u306e\u30c1\u30a7\u30c3\u30af\u3092\u6a5f\u80fd\u3055\u305b\u308b\u306b\u306f\u3001\u30a2\u30ab\u30a6\u30f3\u30c8\u30ed\u30c3\u30af\u30a2\u30a6\u30c8\u3092\u6709\u52b9\u306b\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
a504=\u8a8d\u8a3c\u5931\u6557\u30ea\u30bb\u30c3\u30c8\u306e\u6709\u52b9\u5316
a504.help=\u8a8d\u8a3c\u5931\u6557\u30ea\u30bb\u30c3\u30c8\u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a505=\u30b9\u30b3\u30a2
a505.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a506=\u7d50\u679c\u306e\u53cd\u8ee2
a506.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002

a507=IP \u30ec\u30f3\u30b8\u30c1\u30a7\u30c3\u30af
a507.help=IP \u30a2\u30c9\u30ec\u30b9\u306e\u30ea\u30b9\u30c8\u306b\u5bfe\u3059\u308b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a507.help.txt=IP \u30a2\u30c9\u30ec\u30b9\u306e\u30ec\u30f3\u30b8\u30c1\u30a7\u30c3\u30af\u306f\u3001 IP \u30a2\u30c9\u30ec\u30b9\u306e\u30ea\u30b9\u30c8\u3068\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u3092\u6bd4\u8f03\u3057\u3001\
\u30ea\u30b9\u30c8\u5185\u306b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 IP \u304c\u898b\u3064\u304b\u3063\u305f\u5834\u5408\u306f\u30c1\u30a7\u30c3\u30af\u6210\u529f\u3068\u3057\u307e\u3059\u3002
a508=IP \u30ec\u30f3\u30b8
a508.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u3068\u6bd4\u8f03\u3059\u308b IP \u30a2\u30c9\u30ec\u30b9\u306e\u30ea\u30b9\u30c8\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002
a508.help.txt=IP \u30a2\u30c9\u30ec\u30b9\u306e\u5f62\u5f0f\u306f\u4ee5\u4e0b\u306e\u901a\u308a\u3067\u3059\u3002:<br/><br/>\
<ul><li>\u5358\u4e00\u306e IP \u30a2\u30c9\u30ec\u30b9: <code>172.16.90.1</code></li><li>CIDR \u8868\u8a18: <code>172.16.90.0/24</code></li>\
<li>\u30cd\u30c3\u30c8\u30de\u30b9\u30af\u306b\u3088\u308b IP \u30cd\u30c3\u30c8\u30d6\u30ed\u30c3\u30af: <code>172.16.90.0:255.255.255.0</code></li></ul>
a509=\u30b9\u30b3\u30a2
a509.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a510=\u7d50\u679c\u306e\u53cd\u8ee2
a510.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002

a511=IP \u5c65\u6b74\u30c1\u30a7\u30c3\u30af
a511.help=\u904e\u53bb\u306e IP \u30a2\u30c9\u30ec\u30b9\u306e\u30ea\u30b9\u30c8\u306b\u5bfe\u3059\u308b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 IP \u30a2\u30c9\u30ec\u30b9\u306e\u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a511.help.txt=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408;\u30a2\u30af\u30bb\u30b9\u3057\u305f\u969b\u306e IP \u30a2\u30c9\u30ec\u30b9\u304c\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u8a18\u9332\u3055\u308c\u3066\u3044\u308b IP \u30a2\u30c9\u30ec\u30b9\u306e\
\u5c65\u6b74\u30ea\u30b9\u30c8\u306b\u5b58\u5728\u3059\u308b\u304b\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002IP \u30a2\u30c9\u30ec\u30b9\u304c\u5c65\u6b74\u30ea\u30b9\u30c8\u306b\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u3001\u30c1\u30a7\u30c3\u30af\u306b\u5931\u6557\u3057\u307e\u3059\u304c\u3001\
\u305d\u306e\u5f8c\u306e\u51e6\u7406\u3067\u6700\u7d42\u7684\u306b\u8a8d\u8a3c\u306b\u6210\u529f\u3059\u308c\u3070\u5c65\u6b74\u30ea\u30b9\u30c8\u306b IP \u30a2\u30c9\u30ec\u30b9\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002\uff08\u6700\u3082\u53e4\u3044 IP \u30a2\u30c9\u30ec\u30b9\u3092\u524a\u9664\u3057\u307e\u3059\uff09
a512=\u5c65\u6b74\u306e\u30b5\u30a4\u30ba
a512.help=\u5c65\u6b74\u30ea\u30b9\u30c8\u306b\u4fdd\u5b58\u3059\u308b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u6570\u3002
a513=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u5c5e\u6027\u540d
a513.help=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b IP \u5c65\u6b74\u30ea\u30b9\u30c8\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u5c5e\u6027\u306e\u540d\u524d\u3002
a513.help.txt=IP \u5c65\u6b74\u30ea\u30b9\u30c8\u306f\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u683c\u7d0d\u3055\u308c\u307e\u3059\u3002\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u306f\u672c\u8a2d\u5b9a\u306e\u5c5e\u6027\u540d\u3092\u683c\u7d0d\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\
\u30d0\u30c3\u30af\u30a8\u30f3\u30c9\u3068\u3057\u3066\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u30b5\u30fc\u30d0\u30fc\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u306f\u3001 \
OpenAM \u304c\u5024\u3092\u683c\u7d0d\u3067\u304d\u308b\u3088\u3046\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u8a2d\u5b9a\u306b\u3066 objectclass \u3068\u5c5e\u6027\u540d\u306e\u5b9a\u7fa9\u304c\u5fc5\u8981\u3067\u3059\u3002
a514=\u6210\u529f\u3057\u305f IP \u30a2\u30c9\u30ec\u30b9\u3092\u4fdd\u5b58
a514.help=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u5185\u306e IP \u5c65\u6b74\u30ea\u30b9\u30c8\u304c\u66f4\u65b0\u3055\u308c\u307e\u3059\u3002
a514.help.txt=\u3059\u3079\u3066\u306e\u8a8d\u8a3c\u304c\u6210\u529f\u3057\u305f\u5834\u5408\u306b\u30a2\u30c0\u30d7\u30c6\u30a3\u30d6\u30ea\u30b9\u30af\u8a8d\u8a3c\u30dd\u30b9\u30c8\u30d7\u30ed\u30bb\u30b9\u30af\u30e9\u30b9\u306f IP \u5c65\u6b74\u30ea\u30b9\u30c8\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002
a515=\u30b9\u30b3\u30a2
a515.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a516=\u7d50\u679c\u306e\u53cd\u8ee2
a516.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002

a517=Cookie \u5024\u30c1\u30a7\u30c3\u30af
a517.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u65e2\u77e5\u306e Cookie \u5024\u306e\u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a517.help.txt=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u65e2\u77e5\u306e Cookie \u3092\u63a2\u3057\u307e\u3059\u3002\
Cookie \u304c\u5b58\u5728\u3057\u3001\u6b63\u3057\u3044\u5024\u3092\u6301\u3063\u3066\u3044\u308b\u5834\u5408\u3001\u30c1\u30a7\u30c3\u30af\u306f\u6210\u529f\u3057\u307e\u3059\u3002
a518=Cookie \u540d
a518.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u4e0a\u3067\u8a2d\u5b9a\u3059\u308b Cookie \u306e\u540d\u524d\u3002
a519=Cookie \u5024
a519.help=Cookie \u306b\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u308b\u5024\u3002
a520=\u30ed\u30b0\u30a4\u30f3\u6210\u529f\u5f8c\u306b Cookie \u5024\u3092\u4fdd\u5b58\u3059\u308b
a520.help=\u30ed\u30b0\u30a4\u30f3\u6210\u529f\u5f8c\u306b\u3001 Cookie \u304c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002
a520.help.txt=\u30a2\u30c0\u30d7\u30c6\u30a3\u30d6\u30ea\u30b9\u30af\u8a8d\u8a3c\u30dd\u30b9\u30c8\u30d7\u30e9\u30b0\u30a4\u30f3\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3078\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b Cookie \u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a521=\u30b9\u30b3\u30a2
a521.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a522=\u7d50\u679c\u306e\u53cd\u8ee2
a522.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002

a523=\u6700\u7d42\u30ed\u30b0\u30a4\u30f3\u304b\u3089\u306e\u7d4c\u904e\u6642\u9593\u30c1\u30a7\u30c3\u30af
a523.help=\u30e6\u30fc\u30b6\u30fc\u304c\u6700\u5f8c\u306b\u8a8d\u8a3c\u3057\u305f\u6642\u523b\u304b\u3089\u7d4c\u904e\u6642\u9593\u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a523.help.txt=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001\u4e0e\u3048\u3089\u308c\u305f\u30a4\u30f3\u30bf\u30fc\u30d0\u30eb\u5185\u3067\u30e6\u30fc\u30b6\u30fc\u306e\u8a8d\u8a3c\u304c\u6210\u529f\u3059\u308b\u304b\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002 \
\u30a4\u30f3\u30bf\u30fc\u30d0\u30eb\u3092\u8d85\u904e\u3057\u305f\u5834\u5408\u3001\u30c1\u30a7\u30c3\u30af\u306f\u5931\u6557\u3057\u307e\u3059\u3002\u30e6\u30fc\u30b6\u30fc\u306e\u6700\u5f8c\u306e\u8a8d\u8a3c\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e Cookie \u306b\u683c\u7d0d\u3055\u308c\u307e\u3059\u3002
a524=Cookie \u540d
a524.help=Cookie \u540d\u306f\u6700\u5f8c\u306b\u6210\u529f\u3057\u305f\u8a8d\u8a3c\u306e\u6642\u9593\u3092\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a525=\u6700\u7d42\u30ed\u30b0\u30a4\u30f3\u304b\u3089\u306e\u6700\u5927\u6642\u9593
a525.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u3067\u6210\u529f\u3068\u5224\u5b9a\u3059\u308b\u305f\u3081\u306e\u6700\u5927\u65e5\u6570\u3002
a526=\u30ed\u30b0\u30a4\u30f3\u6210\u529f\u306e\u6642\u9593\u3092\u4fdd\u5b58\u3059\u308b
a526.help=\u6700\u7d42\u30ed\u30b0\u30a4\u30f3\u6642\u523b\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e Cookie \u306b\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002
a526.help.txt=\u30a2\u30c0\u30d7\u30c6\u30a3\u30d6\u30ea\u30b9\u30af\u8a8d\u8a3c\u30dd\u30b9\u30c8\u30d7\u30e9\u30b0\u30a4\u30f3\u306f\u3001\u6700\u5f8c\u306e\u30ed\u30b0\u30a4\u30f3\u6642\u9593\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002
a527=\u30b9\u30b3\u30a2
a527.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a528=\u7d50\u679c\u306e\u53cd\u8ee2
a528.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002

a529=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u30ea\u30b9\u30af\u5c5e\u6027\u30c1\u30a7\u30c3\u30af
a529.help=\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u81f4\u3059\u308b\u5c5e\u6027\u3068\u5024\u306e\u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a529.help.txt=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u6307\u5b9a\u3057\u305f\u5c5e\u6027\u3068\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u304b\u30c1\u30a7\u30c3\u30af\u3057\u3001\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u308c\u3070\u6210\u529f\u3057\u307e\u3059\u3002
a530=\u5c5e\u6027\u540d
a530.help=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u5185\u306e\u30e6\u30fc\u30b6\u30fc\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u53d6\u5f97\u3059\u308b\u5c5e\u6027\u306e\u540d\u524d\u3002
a531=\u5c5e\u6027\u5024
a531.help=\u5c5e\u6027\u540d\u306b\u5bfe\u5fdc\u3057\u305f\u5024\u3002
a532=\u30b9\u30b3\u30a2
a532.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a533=\u7d50\u679c\u306e\u53cd\u8ee2
a533.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002

a534=\u30c7\u30d0\u30a4\u30b9\u767b\u9332 Cookie \u30c1\u30a7\u30c3\u30af
a534.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u30c7\u30d0\u30a4\u30b9Cookie \u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a534.help.txt=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u306b\u6307\u5b9a\u3055\u308c\u305f\u540d\u524d\u306e Cookie \u304c\u542b\u307e\u308c\u3066\u3044\u308c\u3070\u3001\u30c1\u30a7\u30c3\u30af\u306f\u30d1\u30b9\u3057\u307e\u3059\u3002
a535=Cookie \u540d
a535.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u30ea\u30af\u30a8\u30b9\u30c8\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b Cookie \u306e\u540d\u524d\u3002
a536=\u30ed\u30b0\u30a4\u30f3\u6210\u529f\u306e\u30c7\u30d0\u30a4\u30b9\u767b\u9332\u3092\u4fdd\u5b58\u3059\u308b
a536.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3078\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u30c7\u30d0\u30a4\u30b9 Cookie \u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a536.help.txt=\u30a2\u30c0\u30d7\u30c6\u30a3\u30d6\u30ea\u30b9\u30af\u8a8d\u8a3c\u30dd\u30b9\u30c8\u30d7\u30e9\u30b0\u30a4\u30f3\u306f\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3078\u306e\u30ec\u30b9\u30dd\u30f3\u30b9\u306b\u30c7\u30d0\u30a4\u30b9 Cookie \u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
a537=\u30b9\u30b3\u30a2
a537.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a538=\u7d50\u679c\u306e\u53cd\u8ee2
a538.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002

a539=\u4f4d\u7f6e\u60c5\u5831\u56fd\u30b3\u30fc\u30c9\u30c1\u30a7\u30c3\u30af
a539.help=\u4f4d\u7f6e\u60c5\u5831\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u53cd\u3059\u308b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a539.help.txt=\u4f4d\u7f6e\u60c5\u5831\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306bIP \u30a2\u30c9\u30ec\u30b9\u3092\u7167\u5408\u3059\u308b\u3068\u65e2\u77e5\u306e\u5834\u6240\u304c\u5224\u660e\u3057\u307e\u3059\u3002\
\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u308b\u56fd\u304c\u6709\u52b9\u306a\u56fd\u30b3\u30fc\u30c9\u30ea\u30b9\u30c8\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30c1\u30a7\u30c3\u30af\u306f\u6210\u529f\u3057\u307e\u3059\u3002<br/><br/>\
\u4f4d\u7f6e\u60c5\u5831\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f <a href="http://www.maxmind.com/app/country" target="_blank">MaxMind</a> \u306e\u30d0\u30a4\u30ca\u30ea\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306b\u304a\u3044\u3066\u5229\u7528\u53ef\u80fd\u3067\u3059\u3002
a540=\u4f4d\u7f6e\u60c5\u5831\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u5834\u6240
a540.help=\u4f4d\u7f6e\u60c5\u5831\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u5834\u6240\u3078\u306e\u30d1\u30b9\u3092\u5165\u529b\u3057\u307e\u3059\u3002
a540.help.txt=\u4f4d\u7f6e\u60c5\u5831\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f OpenAM \u3068\u4e00\u7dd2\u306b\u914d\u5e03\u3055\u308c\u307e\u305b\u3093\u3002 \
<a href="http://www.maxmind.com/app/country" target="_blank">MaxMind</a> \u304b\u3089\u30d0\u30a4\u30ca\u30ea\u5f62\u5f0f\u3067\u53d6\u5f97\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
a541=\u6709\u52b9\u306a\u56fd\u30b3\u30fc\u30c9
a541.help=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u6709\u52b9\u306a\u5834\u6240\u3068\u307f\u306a\u3059\u56fd\u30b3\u30fc\u30c9\u306e\u30ea\u30b9\u30c8\u3002
a541.help.txt=\u30ea\u30b9\u30c8\u306f\u3001\u6587\u5b57|\u306b\u3088\u308a\u533a\u5207\u3089\u308c\u305f\u56fd\u30b3\u30fc\u30c9\u3067\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059; \u4f8b\u3048\u3070:<br/><br/>\
<code>gb|us|no|fr</code>
a542=\u30b9\u30b3\u30a2
a542.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a543=\u7d50\u679c\u306e\u53cd\u8ee2
a543.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002

a544=\u30ea\u30af\u30a8\u30b9\u30c8\u30d8\u30c3\u30c0\u30fc\u30c1\u30a7\u30c3\u30af
a544.help=\u65e2\u77e5\u306e\u30d8\u30c3\u30c0\u30fc\u540d\u3068\u5024\u306b\u5bfe\u3059\u308b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u306e\u30c1\u30a7\u30c3\u30af\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
a544.help.txt=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u5fc5\u9808\u3067\u6307\u5b9a\u3055\u308c\u305f\u30d8\u30c3\u30c0\u30fc\u304a\u3088\u3073\u5024\u3092\u542b\u3093\u3067\u3044\u308c\u3070\u3001\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3057\u307e\u3059\u3002
a545=\u30ea\u30af\u30a8\u30b9\u30c8\u30d8\u30c3\u30c0\u30fc\u540d
a545.help=\u5fc5\u9808\u306e HTTP \u30d8\u30c3\u30c0\u30fc\u540d\u3002
a546=\u30ea\u30af\u30a8\u30b9\u30c8\u30d8\u30c3\u30c0\u30fc\u306e\u5024
a546.help=HTTP \u30d8\u30c3\u30c0\u30fc\u306b\u6307\u5b9a\u3055\u308c\u305f\u5fc5\u9808\u5024\u3002
a547=\u30b9\u30b3\u30a2
a547.help=\u3053\u306e\u30c1\u30a7\u30c3\u30af\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u3001\u30b9\u30b3\u30a2\u306b\u52a0\u7b97\u3055\u308c\u308b\u6570\u5024\u3002
a548=\u7d50\u679c\u306e\u53cd\u8ee2
a548.help=\u30c1\u30a7\u30c3\u30af\u306b\u6210\u529f\u3059\u308b\u3068\u30b9\u30b3\u30a2\u304c\u5408\u8a08\u306b\u52a0\u7b97\u3055\u308c\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\u3064\u307e\u308a\u5931\u6557\u6642\u306b\u306f\u52a0\u7b97\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3059\u3002
