#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: workflowMessages_ja.properties,v 1.5 2009/12/26 03:47:13 cbasha Exp $
#
#

ajax.user.privilege.invalid=\u30e6\u30fc\u30b6\u30fc\u306b\u306f\u3053\u306e\u30bf\u30b9\u30af\u3092\u5b9f\u884c\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
file.upload.size.limit.exceeded=\u30b5\u30a4\u30ba\u306e\u4e0a\u9650\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002\u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3066\u3001\u3082\u3046\u4e00\u5ea6\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
button.backtoLogin=\u30ed\u30b0\u30a4\u30f3\u306b\u623b\u308b
meta-data-required=\u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u304c\u5fc5\u8981\u3067\u3059\u3002
both-meta-extended-data-required=\u30e1\u30bf\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u3068\u62e1\u5f35\u30c7\u30fc\u30bf\u30d5\u30a1\u30a4\u30eb\u306e\u4e21\u65b9\u304c\u5fc5\u8981\u3067\u3059\u3002
missing-realm=\u30ec\u30eb\u30e0\u304c\u5fc5\u8981\u3067\u3059\u3002
missing-cot=\u30c8\u30e9\u30b9\u30c8\u30b5\u30fc\u30af\u30eb\u304c\u5fc5\u8981\u3067\u3059\u3002
missing-metaalias=MetaAlias \u304c\u5fc5\u8981\u3067\u3059\u3002
missing-entity-id=\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc ID \u304c\u5fc5\u8981\u3067\u3059\u3002
metaalias-no-prefix-with-realm=\u30e1\u30bf\u30a8\u30a4\u30ea\u30a2\u30b9 {0} \u306e\u5148\u982d\u306b\u30ec\u30eb\u30e0\u3092\u4ed8\u3051\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
invalid-metaalias-slash=\u30e1\u30bf\u30a8\u30a4\u30ea\u30a2\u30b9\u304c\u7121\u52b9\u3067\u3059\u3002
unable-get-cot=\u30c8\u30e9\u30b9\u30c8\u30b5\u30fc\u30af\u30eb\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
import-entity-exception-invalid-descriptor=\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u7121\u52b9\u3067\u3059\u3002
meta-data-required=\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u5fc5\u8981\u3067\u3059\u3002
import-entity-exception-invalid-descriptor=\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u7121\u52b9\u3067\u3059\u3002
meta-data-required=\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u5fc5\u8981\u3067\u3059\u3002
entityId-required=\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u8b58\u5225\u5b50\u304c\u5fc5\u8981\u3067\u3059\u3002
assertion.consumer-required=\u8868\u660e\u30b3\u30f3\u30b7\u30e5\u30fc\u30de URL \u304c\u5fc5\u8981\u3067\u3059\u3002
assertion.consumer-invalid=\u8868\u660e\u30b3\u30f3\u30b7\u30e5\u30fc\u30de URL \u304c\u7121\u52b9\u3067\u3059\u3002
file-not-found=\u30d5\u30a1\u30a4\u30eb {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
domain.is.empty =\u30c9\u30e1\u30a4\u30f3\u540d\u304c\u7a7a\u3067\u3059\u3002
google.apps.configured.success=\u6210\u529f
attributemapping.is.empty=\u5c5e\u6027\u30de\u30c3\u30d4\u30f3\u30b0\u30c6\u30fc\u30d6\u30eb\u304c\u7a7a\u3067\u3059\u3002
salesforce.apps.configured.success=\u6210\u529f


idp.configured=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002<br />\u300c\u9023\u643a\u300d\u30bf\u30d6\u3067\u3001\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u5909\u66f4\u3067\u304d\u307e\u3059\u3002
sp.configured=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002<br />\u300c\u9023\u643a\u300d\u30bf\u30d6\u3067\u3001\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u5909\u66f4\u3067\u304d\u307e\u3059\u3002
invalid-extended-data-cot=\u62e1\u5f35\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u7121\u52b9\u3067\u3042\u308b\u305f\u3081\u3001\u6709\u52b9\u306a\u30c8\u30e9\u30b9\u30c8\u30b5\u30fc\u30af\u30eb\u306e\u30bb\u30c3\u30c8\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002 
unable.to.reach.url={0} \u306b\u5230\u9054\u3067\u304d\u307e\u305b\u3093\u3002
malformedurl={0} \u306f\u6b63\u3057\u3044\u5f62\u5f0f\u306e URL \u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002

cannot.locate.idp=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
cannot.locate.idp.loginURL=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0 {0} \u306e\u30ed\u30b0\u30a4\u30f3 URL \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
cannot.locate.sp=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
cannot.locate.sp.loginURL=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0 {0} \u306e\u30ed\u30b0\u30a4\u30f3 URL \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002

federation.connectivity.test=\u9023\u643a\u306e\u63a5\u7d9a\u6027\u306e\u30c6\u30b9\u30c8
button.cancel=\u53d6\u6d88\u3057
validate.initializing=\u3053\u306e\u30c6\u30b9\u30c8\u3092\u521d\u671f\u5316\u3059\u308b\u9593\u304a\u5f85\u3061\u304f\u3060\u3055\u3044\u3002
validate.title.setup.failed=\u9023\u643a\u306e\u63a5\u7d9a\u6027\u3092\u30c6\u30b9\u30c8\u3067\u304d\u307e\u305b\u3093\u3002
validate.title.auth.idp=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0 {0} \u306e\u8a8d\u8a3c\u60c5\u5831\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044
validate.help.auth.idp.passed=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u3092\u53d7\u3051\u307e\u3057\u305f\u3002
validate.help.auth.idp.failed=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u3092\u53d7\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
validate.auth.idp.again=\u3082\u3046\u4e00\u5ea6\u8a8d\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044
validate.title.auth.sp=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u60c5\u5831\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002{0}
validate.help.auth.sp.passed=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u3092\u53d7\u3051\u307e\u3057\u305f\u3002
validate.help.auth.sp.failed=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u3092\u53d7\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
validate.auth.sp.again=\u3082\u3046\u4e00\u5ea6\u8a8d\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044

validate.title.account.linking=\u30b7\u30b9\u30c6\u30e0\u306f\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ea\u30f3\u30af\u6a5f\u80fd\u306e\u30c6\u30b9\u30c8\u3092\u3057\u3066\u3044\u307e\u3059
validate.wait.account.linking=\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ea\u30f3\u30af\u6a5f\u80fd\u306e\u30c6\u30b9\u30c8\u3092\u3057\u3066\u3044\u307e\u3059
validate.help.account.linking.passed=\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u307e\u3059
validate.help.account.linking.failed=\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ea\u30f3\u30af\u3067\u304d\u307e\u305b\u3093

validate.title.single.logout=\u30b7\u30b9\u30c6\u30e0\u306f\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u306e\u30c6\u30b9\u30c8\u3092\u3057\u3066\u3044\u307e\u3059
validate.wait.single.logout= \u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u306e\u30c6\u30b9\u30c8\u3092\u3057\u3066\u3044\u307e\u3059
validate.help.single.logout.passed=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u306b\u6210\u529f\u3057\u307e\u3057\u305f
validate.help.single.logout.failed=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f

validate.title.single.login_hosted=\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u3092\u30c6\u30b9\u30c8\u3057\u3066\u3044\u307e\u3059\u3002\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u60c5\u5831\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044
validate.title.single.login_remote=\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u3092\u30c6\u30b9\u30c8\u3057\u3066\u3044\u307e\u3059\u3002\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u60c5\u5831\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044
validate.wait.single.login=\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u306e\u30c6\u30b9\u30c8\u3092\u3057\u3066\u3044\u307e\u3059
validate.help.single.login.passed=\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u304c\u6a5f\u80fd\u3057\u3066\u3044\u307e\u3059
validate.help.single.login.failed=\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u304c\u6a5f\u80fd\u3057\u3066\u3044\u307e\u305b\u3093
validate.help.single.login.again=\u3082\u3046\u4e00\u5ea6\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u304f\u3060\u3055\u3044

validate.title.account.termination=\u30a2\u30ab\u30a6\u30f3\u30c8\u7d42\u4e86\u306e\u30c6\u30b9\u30c8\u3092\u3057\u3066\u3044\u307e\u3059
validate.help.account.termination.passed=\u30a2\u30ab\u30a6\u30f3\u30c8\u7d42\u4e86\u304c\u6a5f\u80fd\u3057\u3066\u3044\u307e\u3059
validate.help.account.termination.failed=\u30a2\u30ab\u30a6\u30f3\u30c8\u7d42\u4e86\u304c\u6a5f\u80fd\u3057\u3066\u3044\u307e\u305b\u3093
validate.wait.account.termination=\u30a2\u30ab\u30a6\u30f3\u30c8\u7d42\u4e86\u306e\u30c6\u30b9\u30c8\u3092\u3057\u3066\u3044\u307e\u3059

validate.report.title=\u63a5\u7d9a\u6027\u30c6\u30b9\u30c8\u306e\u7d50\u679c
validate.report.task.label.idp=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0
validate.report.task.label.sp=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0
validate.report.task.label.fedlet=Fedlet
validate.report.tbl.hdr.test=\u30c6\u30b9\u30c8
validate.report.tbl.hdr.result=\u7d50\u679c
validate.report.task.auth.idp=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u8a8d\u8a3c
validate.report.task.auth.sp=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u8a8d\u8a3c
validate.report.task.account.linking=\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ea\u30f3\u30af
validate.report.task.single.logout=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8
validate.report.task.single.login=\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3
validate.report.task.account.termination=\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ea\u30f3\u30af\u89e3\u9664

validator.report.auth.idp.not.tested=\u30c6\u30b9\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
validator.report.auth.idp.passed=IDP \u306e\u8a8d\u8a3c\u3092\u53d7\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
validator.report.auth.idp.failed=\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u3092\u53d7\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u5931\u6557\u306e\u6700\u3082\u4e00\u822c\u7684\u306a\u539f\u56e0\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059:<ol><li>\u7121\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u540d\u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u3057\u3066\u300cdemo\u300d\u3092\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u3057\u3066\u300cchangeit\u300d\u3092\u4f7f\u7528\u3067\u304d\u308b\u306f\u305a\u3067\u3059\u3002</li><li>\u8a2d\u5b9a\u306b\u30a8\u30e9\u30fc\u304c\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u7ba1\u7406\u8005\u306e\u5834\u5408\u306f\u3001\u300camAuth\u300d\u30c7\u30d0\u30c3\u30b0\u30d5\u30a1\u30a4\u30eb\u3068\u300camAuthentication.error\u300d\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3067\u8a73\u7d30\u3092\u78ba\u8a8d\u3067\u304d\u307e\u3059\u3002</li></ol>

validator.report.auth.sp.not.tested=\u30c6\u30b9\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
validator.report.auth.sp.passed=SP \u306e\u8a8d\u8a3c\u3092\u53d7\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059
validator.report.auth.sp.failed=\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u8a8d\u8a3c\u3092\u53d7\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u5931\u6557\u306e\u6700\u3082\u4e00\u822c\u7684\u306a\u539f\u56e0\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059:<ol><li>\u7121\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u540d\u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u3057\u3066\u300cdemo\u300d\u3092\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u3057\u3066\u300cchangeit\u300d\u3092\u4f7f\u7528\u3067\u304d\u308b\u306f\u305a\u3067\u3059\u3002</li><li>\u8a2d\u5b9a\u306b\u30a8\u30e9\u30fc\u304c\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u7ba1\u7406\u8005\u306e\u5834\u5408\u306f\u3001\u300camAuth\u300d\u30c7\u30d0\u30c3\u30b0\u30d5\u30a1\u30a4\u30eb\u3068\u300camAuthentication.error\u300d\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3067\u8a73\u7d30\u3092\u78ba\u8a8d\u3067\u304d\u307e\u3059\u3002</li></ol>

validator.report.account.linking.not.tested=\u30c6\u30b9\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
validator.report.account.linking.passed=\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ea\u30f3\u30af \u306b\u6210\u529f\u3057\u307e\u3057\u305f\u3002
validator.report.account.linking.failed=\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ea\u30f3\u30af\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u30a8\u30e9\u30fc\u306e\u6700\u3082\u4e00\u822c\u7684\u306a\u539f\u56e0\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059:<ol><li>SAMLv2 \u5c5e\u6027\u30b9\u30ad\u30fc\u30de\u304c\u30ed\u30fc\u30c9\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u30a8\u30e9\u30fc\u3092\u4fee\u6b63\u3059\u308b\u306b\u306f\u3001SAMLv2 \u5c5e\u6027\u30b9\u30ad\u30fc\u30de\u30d5\u30a1\u30a4\u30eb\u3092\u30ed\u30fc\u30c9\u3057\u3001ldapmodify \u30b3\u30de\u30f3\u30c9\u3092\u4f7f\u7528\u3057\u3066 opensso.war \u5185\u306b\u3042\u308b WEB-INF/template/openfm/fam_sds_schema.ldif \u30d5\u30a1\u30a4\u30eb\u3092\u30ed\u30fc\u30c9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059</li><li>\u3053\u306e\u30bf\u30b9\u30af\u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306e\u30a2\u30af\u30bb\u30b9\u6a29\u3092\u4fdd\u6301\u3057\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a2\u30af\u30bb\u30b9\u6a29\u30ec\u30d9\u30eb\u3092\u5909\u66f4\u3059\u308b\u306b\u306f\u3001\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002</li><li>\u30e6\u30fc\u30b6\u30fc\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u3053\u306e\u30a8\u30e9\u30fc\u3092\u4fee\u6b63\u3059\u308b\u306b\u306f\u3001\u30b3\u30f3\u30bd\u30fc\u30eb\u306b\u79fb\u52d5\u3057\u3066\u3001\u300c\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u300d -> \u300c\u30ec\u30eb\u30e0\u300d -> \u300c\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u300d\u3068\u79fb\u52d5\u3057\u3001\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306e\u8a2d\u5b9a\u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u7ba1\u7406\u30ac\u30a4\u30c9\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002</li><li>\u7ba1\u7406\u8005\u306e\u5834\u5408\u306f\u3001\u300clibSAML2\u300d\u30c7\u30d0\u30c3\u30b0\u30d5\u30a1\u30a4\u30eb\u3068\u300cSAML2.error\u300d\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3067\u8a73\u7d30\u3092\u78ba\u8a8d\u3067\u304d\u307e\u3059\u3002</li></ol>

validator.report.single.logout.not.tested=\u30c6\u30b9\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093 
validator.report.single.logout.passed=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u306b\u6210\u529f\u3057\u307e\u3057\u305f
validator.report.single.logout.failed=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002<ol><li>\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u3082\u3046\u4e00\u65b9\u306e\u7d42\u7aef\u3067\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u307e\u3057\u305f\u3002\u6709\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u3042\u308b\u304b\u3069\u3046\u304b\u3001\u30ea\u30e2\u30fc\u30c8\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3066\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002</li><li>\u63a5\u7d9a\u6027\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3059\u3002\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8 (\u8981\u6c42\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b URL) \u304c\u958b\u304b\u308c\u3001\u6a5f\u80fd\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8 URL \u304c\u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002</li></ol><span style="background-color:#333333">\u7ba1\u7406\u8005\u306e\u5834\u5408\u306f\u3001\u300clibSAML#2\u300d\u30c7\u30d0\u30c3\u30b0\u30d5\u30a1\u30a4\u30eb\u3068\u300cSAML2.error\u300d\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3067\u8a73\u7d30\u3092\u78ba\u8a8d\u3067\u304d\u307e\u3059</span>

validator.report.single.login.not.tested=\u30c6\u30b9\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
validator.report.single.login.passed=\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u306b\u6210\u529f\u3057\u307e\u3057\u305f
validator.report.single.login.failed=\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u3053\u306e\u5931\u6557\u306e\u6700\u3082\u4e00\u822c\u7684\u306a\u539f\u56e0\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059:<ol><li>\u7f72\u540d\u9375\u304c\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u5074\u3067\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u3092\u518d\u8a2d\u5b9a\u3057\u3066\u7f72\u540d\u9375\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u6ce8: \u3053\u308c\u304c\u5f53\u3066\u306f\u307e\u308b\u306e\u306f POST \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306e\u5834\u5408\u3060\u3051\u3067\u3059\u3002POST \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3067\u306a\u3044\u5834\u5408\u3001\u3053\u308c\u304c\u30a8\u30e9\u30fc\u306e\u539f\u56e0\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002</li><li>\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u304c SOAP \u30c1\u30e3\u30cd\u30eb\u3092\u4f7f\u7528\u3057\u3066\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u308c\u304c\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3067\u3042\u308b\u5834\u5408\u306f\u3001\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u30db\u30b9\u30c8\u304c\u30a2\u30a4\u30c7\u30f3\u30c6\u30a3\u30c6\u30a3\u30fc\u30d7\u30ed\u30d0\u30a4\u30c0\u30db\u30b9\u30c8\u306b\u63a5\u7d9a\u3067\u304d\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u30021 \u3064\u306e\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u306e\u80cc\u5f8c\u306b\u8907\u6570\u306e\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u30ed\u30fc\u30c9\u30d0\u30e9\u30f3\u30b5\u8a2d\u5b9a\u3067\u306f\u3001\u3053\u308c\u306f\u4e00\u822c\u7684\u306a\u4e8b\u4f8b\u3067\u3059\u3002</li></ol><span style="background-color:#333333">\u7ba1\u7406\u8005\u306e\u5834\u5408\u306f\u3001\u300clibSAML#2\u300d\u30c7\u30d0\u30c3\u30b0\u30d5\u30a1\u30a4\u30eb\u3068\u300cSAML2.error\u300d\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3067\u8a73\u7d30\u3092\u78ba\u8a8d\u3067\u304d\u307e\u3059</span>

validator.report.account.termination.not.tested=\u30c6\u30b9\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
validator.report.account.termination.passed=\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ea\u30f3\u30af\u89e3\u9664\u306b\u6210\u529f\u3057\u307e\u3057\u305f
validator.report.account.termination.failed=\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ea\u30f3\u30af\u89e3\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u3053\u306e\u5931\u6557\u306e\u6700\u3082\u4e00\u822c\u7684\u306a\u539f\u56e0\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059:<ol><li>\u63a5\u7d9a\u6027\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3059\u3002\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8 (\u8981\u6c42\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b URL) \u304c\u6a5f\u80fd\u3057\u3066\u3044\u308b\u3053\u3068\u3001\u304a\u3088\u3073\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8 URL \u304c\u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002</li><li>\u30ea\u30e2\u30fc\u30c8\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u30ea\u30e2\u30fc\u30c8\u30d7\u30ed\u30d0\u30a4\u30c0\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30ea\u30f3\u30af\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3001sun-fm-saml2-nameid-infokey \u5c5e\u6027\u3068 sun-fm-saml2-nameid-info \u5c5e\u6027\u306e\u4e21\u65b9\u304c\u30a8\u30f3\u30c8\u30ea\u306b\u5b58\u5728\u3059\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002</li></ol><span style="background-color:#333333">\u7ba1\u7406\u8005\u306e\u5834\u5408\u306f\u3001\u300clibSAML#2\u300d\u30c7\u30d0\u30c3\u30b0\u30d5\u30a1\u30a4\u30eb\u3068\u300cSAML2.error\u300d\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3067\u8a73\u7d30\u3092\u78ba\u8a8d\u3067\u304d\u307e\u3059</span>

validate.footer.auth.idp=\u30d2\u30f3\u30c8: \u30e6\u30fc\u30b6\u30fc\u540d\u306b demo \u3092\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u306b changeit \u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u305f\u3060\u3057\u3001\u88fd\u54c1\u306e\u8a2d\u5b9a\u5f8c\u306b\u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3060\u3051\u3067\u3059\u3002
validate.footer.auth.sp=\u30d2\u30f3\u30c8: \u30e6\u30fc\u30b6\u30fc\u540d\u306b demo \u3092\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u306b changeit \u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u305f\u3060\u3057\u3001\u88fd\u54c1\u306e\u8a2d\u5b9a\u5f8c\u306b\u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3060\u3051\u3067\u3059\u3002
validate.footer.account.linking=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ea\u30f3\u30af\u3059\u308b\u9593\u304a\u5f85\u3061\u304f\u3060\u3055\u3044\u3002
validate.footer.single.logout=\u30b7\u30f3\u30b0\u30eb\u30ed\u30b0\u30a2\u30a6\u30c8\u3092\u5b9f\u884c\u3059\u308b\u9593\u304a\u5f85\u3061\u304f\u3060\u3055\u3044
validate.footer.single.login=30 \u79d2\u4ee5\u5185\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30d2\u30f3\u30c8: \u30e6\u30fc\u30b6\u30fc\u540d\u306b demo \u3092\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u306b changeit \u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u305f\u3060\u3057\u3001\u88fd\u54c1\u306e\u8a2d\u5b9a\u5f8c\u306b\u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3060\u3051\u3067\u3059\u3002
validate.footer.account.termination=\u30e6\u30fc\u30b6\u30fc\u30a2\u30ab\u30a6\u30f3\u30c8\u3092\u30ea\u30f3\u30af\u89e3\u9664\u3059\u308b\u9593\u304a\u5f85\u3061\u304f\u3060\u3055\u3044\u3002

validator.title.auth.failed=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
validator.message.auth.failed=\u3053\u306e\u30a8\u30e9\u30fc\u306e\u6700\u3082\u4e00\u822c\u7684\u306a\u539f\u56e0\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059:<ol><li>\u7121\u52b9\u306a\u30e6\u30fc\u30b6\u30fc\u540d\u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u8a2d\u5b9a\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u3057\u3066\u300cdemo\u300d\u3092\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u3057\u3066\u300cchangeit\u300d\u3092\u4f7f\u7528\u3067\u304d\u308b\u306f\u305a\u3067\u3059\u3002</li><li>\u8a2d\u5b9a\u306b\u30a8\u30e9\u30fc\u304c\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u7ba1\u7406\u8005\u306e\u5834\u5408\u306f\u3001\u300camAuth\u300d\u30c7\u30d0\u30c3\u30b0\u30d5\u30a1\u30a4\u30eb\u3068\u300camAuthentication.error\u300d\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3067\u8a73\u7d30\u3092\u78ba\u8a8d\u3067\u304d\u307e\u3059\u3002</li></ol>
validator.link.auth.failed=\u8a8d\u8a3c\u306b\u623b\u308b

Fedlet.created=\u30d5\u30a1\u30a4\u30eb\u304c opensso \u30d5\u30a9\u30eb\u30c0 {0} \u306b\u4fdd\u5b58\u3055\u308c\u307e\u3057\u305f\u3002<p>\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u30b5\u30fc\u30d3\u30b9\u30d7\u30ed\u30d0\u30a4\u30c0\u306b\u9001\u4fe1\u3059\u308b\u304b\u3001\u30c7\u30e2\u76ee\u7684\u3067\u30ed\u30fc\u30ab\u30eb\u306b\u4f7f\u7528\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u3053\u306e .zip \u30d5\u30a1\u30a4\u30eb\u306b\u3088\u308a\u3001Fedlet \u3092 SP \u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u914d\u5099\u3059\u308b\u3068\u540c\u6642\u306b SP \u3092\u9023\u643a\u72b6\u614b\u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002</p>

directory.already.exist=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea {0} \u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002

reg-no-service=\u5229\u7528\u3067\u304d\u308b\u767b\u9332\u30b5\u30fc\u30d3\u30b9\u306f\u3042\u308a\u307e\u305b\u3093\u3002
reg-create-soa-err=Sun \u30aa\u30f3\u30e9\u30a4\u30f3\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
reg-process-exc=\u767b\u9332\u51e6\u7406\u306e\u4f8b\u5916: {0}
reg-no-service-waccount=\u767b\u9332\u30b5\u30fc\u30d3\u30b9\u306f\u3042\u308a\u307e\u305b\u3093 (\u65e2\u5b58\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u5834\u5408)
reg-execute-registration-exc=\u767b\u9332\u306e\u5b9f\u884c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
reg-execute-no-domains=\u767b\u9332\u5148\u306e\u30c9\u30e1\u30a4\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
reg-to-domain-error=\u30c9\u30e1\u30a4\u30f3 {0} \u306b\u767b\u9332\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
reg-domain-not-found=\u30c9\u30e1\u30a4\u30f3 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
reg-no-domains=\u30c9\u30e1\u30a4\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
reg-to-def-domain-error=\u30c7\u30d5\u30a9\u30eb\u30c8\u30c9\u30e1\u30a4\u30f3\u306b\u767b\u9332\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8: {0}
reg-usrname-pswd-rqd=\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u4e21\u65b9\u304c\u5fc5\u8981\u3067\u3059
reg-emailadr-no-username=\u30e6\u30fc\u30b6\u30fc\u540d\u3092\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u306f\u96fb\u5b50\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
reg-pswd-req=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059
reg-cfm-pswd-req=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u78ba\u8a8d\u304c\u5fc5\u8981\u3067\u3059
reg-pswd-no-match=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093
reg-get-reg-svc-error=\u767b\u9332\u30b5\u30fc\u30d3\u30b9\u306e\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
reg-get-reg-svc-proxy-error=\u30d7\u30ed\u30ad\u30b7 {0} \u3092\u4ecb\u3057\u3066\u767b\u9332\u30b5\u30fc\u30d3\u30b9\u306e\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}
