/**
 * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
 *
 * Copyright (c) 2009 Sun Microsystems Inc. All Rights Reserved
 *
 * The contents of this file are subject to the terms
 * of the Common Development and Distribution License
 * (the License). You may not use this file except in
 * compliance with the License.
 *
 * You can obtain a copy of the License at
 * https://opensso.dev.java.net/public/CDDLv1.0.html or
 * opensso/legal/CDDLv1.0.txt
 * See the License for the specific language governing
 * permission and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL
 * Header Notice in each file and include the License file
 * at opensso/legal/CDDLv1.0.txt.
 * If applicable, add the following below the CDDL Header,
 * with the fields enclosed by brackets [] replaced by
 * your own identifying information:
 * "Portions Copyrighted [year] [name of copyright owner]"
 *
 * $Id: EntitlementException_ja.properties,v 1.1 2009/12/26 03:51:44 cbasha Exp $
 */

# Portions Copyrighted 2012 ForgeRock Inc
# Portions Copyrighted 2012 Open Source Solution Technology Corporation

1=\u6a29\u9650\u306e\u65b0\u3057\u3044\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
2=\u6a29\u9650\u306e\u5b9f\u88c5\u30af\u30e9\u30b9\u304c\u306a\u3044\u305f\u3081\u3001\u6a29\u9650\u306e\u65b0\u3057\u3044\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
3=\u6a29\u9650\u540d\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093\u3002
4=\u30a8\u30f3\u30bf\u30a4\u30c8\u30eb\u30e1\u30f3\u30c8\u306f null \u306b\u3067\u304d\u307e\u305b\u3093\u3002
5=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u64cd\u4f5c
6=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30af\u30e9\u30b9\u306f\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u3067\u304d\u307e\u305b\u3093\u3002
7=XML \u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3002
8=WSDL \u306e\u5834\u6240 {0} \u304c\u7121\u52b9\u3067\u3059\u3002

10=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3042\u308b\u304b\u3001\u671f\u9650\u304c\u5207\u308c\u3066\u3044\u307e\u3059\u3002\u4e00\u822c\u7684\u306b\u3001\u3053\u306e\u72b6\u6cc1\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u30a2\u30a4\u30c9\u30eb\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u305f\u304b\u3001\u5225\u306e\u53c2\u52a0\u8005\u306b\u3088\u3063\u3066\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u5316\u3055\u308c\u305f\u5834\u5408\u306b\u767a\u751f\u3057\u307e\u3059\u3002

50=\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u30a8\u30f3\u30c8\u30ea {0} \u3092\u66f8\u304d\u8fbc\u3081\u307e\u305b\u3093\u3002
51=\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u30a8\u30f3\u30c8\u30ea {0} \u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
52=\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u30a8\u30f3\u30c8\u30ea {0} \u3092\u8aad\u307f\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
55=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u30a8\u30f3\u30c8\u30ea {0} \u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
56=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u30a8\u30f3\u30c8\u30ea {0} \u3092\u8aad\u307f\u53d6\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002

100=\u30dd\u30ea\u30b7\u30fc\u306e\u8a55\u4fa1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
101=\u30ec\u30eb\u30e0 {0} \u304b\u3089\u30dd\u30ea\u30b7\u30fc\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
102=\u30dd\u30ea\u30b7\u30fc\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0} \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
103=\u30dd\u30ea\u30b7\u30fc {1} \u306e\u5bfe\u8c61\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0] \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
104=\u30dd\u30ea\u30b7\u30fc {1} \u306e\u6761\u4ef6\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0] \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
105=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 {0} \u304c\u30ec\u30eb\u30e0 {1} \u306b\u898b\u3064\u304b\u3089\u306a\u3044\u305f\u3081\u3001\u6a29\u9650\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
110=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30bf\u30a4\u30d7 {0} \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002

113=\u30dd\u30ea\u30b7\u30fc {1} \u306e\u5bfe\u8c61\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0] \u3092\u8a55\u4fa1\u3067\u304d\u307e\u305b\u3093\u3002
114=\u30dd\u30ea\u30b7\u30fc {1} \u306e\u6761\u4ef6\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0] \u3092\u8a55\u4fa1\u3067\u304d\u307e\u305b\u3093\u3002

200=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u76f4\u5217\u5316\u3067\u304d\u307e\u305b\u3093\u3002
201=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u76f4\u5217\u5316\u89e3\u9664\u3067\u304d\u307e\u305b\u3093\u3002
202=\u30dd\u30ea\u30b7\u30fc {0} \u3092\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u7dad\u6301\u3067\u304d\u307e\u305b\u3093\u3002
203=\u30dd\u30ea\u30b7\u30fc {0} \u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
204=\u30dd\u30ea\u30b7\u30fc {0} \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
205=\u30dd\u30ea\u30b7\u30fc {0} \u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
206=\u30dd\u30ea\u30b7\u30fc {0} \u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
207=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30dd\u30ea\u30b7\u30fc {0} \u3092\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u7dad\u6301\u3067\u304d\u307e\u305b\u3093\u3002
208=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30dd\u30ea\u30b7\u30fc {0} \u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
209=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30dd\u30ea\u30b7\u30fc {0} \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
210=\u6a29\u9650\u3092\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
211=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30dd\u30ea\u30b7\u30fc {0} \u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
215=\u6a29\u9650\u3092\u691c\u7d22\u3067\u304d\u307e\u305b\u3093\u3002
216=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u6a29\u9650\u3092\u691c\u7d22\u3067\u304d\u307e\u305b\u3093\u3002

220=\u5bfe\u8c61\u5c5e\u6027\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
221=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
222=\u30a2\u30af\u30b7\u30e7\u30f3 {0} \u304c\u3059\u3067\u306b\u5b58\u5728\u3057\u3066\u3044\u308b\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
225=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u5bfe\u8c61\u5c5e\u6027\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
226=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
227=\u30b5\u30d6\u30ec\u30eb\u30e0\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
228=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059
230=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 {0} \u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
231=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 {0} \u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
240=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30bf\u30a4\u30d7 {0} \u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
241=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30bf\u30a4\u30d7 {0} \u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
245=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30bf\u30a4\u30d7 {0} \u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
246=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30bf\u30a4\u30d7 {0} \u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
247=\u30ea\u30bd\u30fc\u30b9\u304c\u89aa\u304b\u3089\u53c2\u7167\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 {0} \u3092\u4fdd\u5b58\u3067\u304d\u307e\u305b\u3093\u3002
248=\u30ec\u30eb\u30e0 {0} \u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002

250=\u53c2\u7167\u6a29\u9650\u306e\u540d\u524d\u304c\u3001\u53c2\u7167\u6a29\u9650\u306b\u3042\u308a\u307e\u305b\u3093\u3002
251=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u540d\u3068\u30ea\u30bd\u30fc\u30b9\u540d\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u304c\u3001\u53c2\u7167\u6a29\u9650\u306b\u3042\u308a\u307e\u305b\u3093\u3002
252=\u30ec\u30eb\u30e0\u304c\u53c2\u7167\u6a29\u9650\u306b\u3042\u308a\u307e\u305b\u3093\u3002

260=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u53c2\u7167\u6a29\u9650\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
261=\u53c2\u7167\u6a29\u9650\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
262=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u53c2\u7167\u6a29\u9650 {0} \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
263=\u53c2\u7167\u6a29\u9650 {0} \u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
264=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u53c2\u7167\u6a29\u9650 {0} \u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
265=\u53c2\u7167\u6a29\u9650 {0} \u3092\u5909\u66f4\u3067\u304d\u307e\u305b\u3093\u3002
266=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u53c2\u7167\u6a29\u9650 {0} \u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
267=\u30ea\u30bd\u30fc\u30b9\u304c\u89aa\u304b\u3089\u53c2\u7167\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u53c2\u7167\u6a29\u9650 {0} \u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002

270=\u53c2\u7167\u6a29\u9650\u3092\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
275=\u30ec\u30eb\u30e0 {0} \u306e\u53c2\u7167\u30ea\u30bd\u30fc\u30b9\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002

280=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 {2} \u304c\u89aa\u30ec\u30eb\u30e0 {0} \u306b\u5b58\u5728\u3057\u3066\u3044\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30b5\u30d6\u30ec\u30eb\u30e0 {1} \u306b\u5bfe\u3059\u308b\u6a29\u9650\u3092\u53c2\u7167\u3067\u304d\u307e\u305b\u3093\u3002

285=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u5bfe\u8c61\u5c5e\u6027\u30b3\u30ec\u30af\u30bf\u8a2d\u5b9a\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
286=\u5bfe\u8c61\u5c5e\u6027\u30b3\u30ec\u30af\u30bf\u8a2d\u5b9a\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
287=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u5bfe\u8c61\u5c5e\u6027\u30b3\u30ec\u30af\u30bf\u8a2d\u5b9a {0} \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
288=\u5bfe\u8c61\u5c5e\u6027\u30b3\u30ec\u30af\u30bf\u8a2d\u5b9a {0} \u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
289=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u5bfe\u8c61\u5c5e\u6027\u30b3\u30ec\u30af\u30bf\u8a2d\u5b9a {0} \u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
290=\u5bfe\u8c61\u5c5e\u6027\u30b3\u30ec\u30af\u30bf\u8a2d\u5b9a {0} \u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002

300=\u4e21\u65b9\u306e\u30ef\u30a4\u30eb\u30c9\u30ab\u30fc\u30c9\u30bf\u30a4\u30d7\u3092\u540c\u4e00\u306e\u30eb\u30fc\u30eb\u306b\u6307\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
301=\u30dd\u30fc\u30c8 {0} \u304c\u7121\u52b9\u3067\u3059
302=URL {0} \u304c\u4e0d\u6b63\u3067\u3059
303=\u30ea\u30bd\u30fc\u30b9 {0} \u304c\u7121\u52b9\u3067\u3059
# TODO(jtb)
310=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u6a29\u9650\u306b\u7121\u52b9\u306a\u30a8\u30f3\u30bf\u30a4\u30c8\u30eb\u30e1\u30f3\u30c8\u5bfe\u8c61\u30af\u30e9\u30b9\u304c\u3042\u308a\u307e\u3059\u3002

320=\u59d4\u4efb\u6a29\u9650\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u540d\u304c\u3042\u308a\u307e\u305b\u3093\u3002
321={0} \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
322=\u59d4\u4efb\u6a29\u9650\u306b\u30ea\u30bd\u30fc\u30b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
323={0} \u306f\u59d4\u4efb\u3067\u304d\u307e\u305b\u3093\u3002
324={0} \u306f\u7b26\u53f7\u5316\u3067\u304d\u307e\u305b\u3093\u3002
325={0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
326=\u30a2\u30af\u30bb\u30b9\u6a29\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
327=\u5bfe\u8c61\u304c\u5fc5\u8981\u3067\u3059\u3002
328=\u691c\u7d22\u30d5\u30a3\u30eb\u30bf {0} \u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002

400=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc {0} \u306e\u5024 {1} \u304c\u7121\u52b9\u3067\u3059\u3002
401=\u5024 {0} \u304c\u7121\u52b9\u3067\u3059
402=\u958b\u59cb\u65e5 ({0}) \u306b\u7d42\u4e86\u65e5 ({1}) \u3088\u308a\u3082\u3042\u3068\u306e\u65e5\u4ed8\u306f\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093
403=\u5bfe\u8c61\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002

508=\u5bfe\u8c61\u306e\u8a55\u4fa1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
510=\u6761\u4ef6\u306e\u8a55\u4fa1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002

600={0} \u306e\u5bfe\u8c61\u5c5e\u6027\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
601=\u5bfe\u8c61 {0} \u306e\u5c5e\u6027\u5024\u304c\u5b58\u5728\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5224\u65ad\u3067\u304d\u307e\u305b\u3093\u3002
602=\u4f7f\u7528\u53ef\u80fd\u306a\u5bfe\u8c61\u5c5e\u6027\u540d\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002

420=REST \u547c\u3073\u51fa\u3057\u306b\u30ea\u30bd\u30fc\u30b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
421=REST \u547c\u3073\u51fa\u3057\u306b\u5bfe\u8c61\u8b58\u5225\u5b50\u304c\u3042\u308a\u307e\u305b\u3093\u3002
422=REST \u547c\u3073\u51fa\u3057\u306b\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
424=\u30ea\u30bd\u30fc\u30b9\u540d\u304c\u5fc5\u8981\u3067\u3059\u3002
425=JSON \u4f8b\u5916\u3002
426=\u30a8\u30f3\u30bf\u30a4\u30c8\u30eb\u30e1\u30f3\u30c8\u30ea\u30b9\u30ca\u30fc\u306b\u901a\u77e5 URL \u304c\u5fc5\u8981\u3067\u3059\u3002
427={0} \u306e\u30a8\u30f3\u30bf\u30a4\u30c8\u30eb\u30e1\u30f3\u30c8\u30ea\u30b9\u30ca\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
428=\u30a8\u30f3\u30bf\u30a4\u30c8\u30eb\u30e1\u30f3\u30c8\u30ea\u30b9\u30ca\u30fc\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u540d\u304c\u5fc5\u8981\u3067\u3059\u3002
429=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u304b\u3089\u30ea\u30b9\u30ca\u30fc\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002\u30ea\u30b9\u30ca\u30fc\u30c7\u30fc\u30bf\u304c\u7834\u640d\u3057\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002
430=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u304b\u3089\u30ea\u30b9\u30ca\u30fc\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002\u7ba1\u7406\u30e6\u30fc\u30b6\u30fc\u306b\u8aad\u307f\u53d6\u308a\u306e\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
431={0} \u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u901a\u77e5\u3092\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
432=\u59d4\u4efb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
434=\u8981\u6c42\u3092\u8a8d\u8a3c\u3067\u304d\u307e\u305b\u3093\u3002
435=\u901a\u77e5 URL \u306e\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
436=\u901a\u77e5 URL \u304c\u8aa4\u3063\u3066\u3044\u307e\u3059\u3002

450=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u691c\u7d22\u3067\u304d\u307e\u305b\u3093\u3002
451=\u7ba1\u7406\u8005\u306e\u30b7\u30f3\u30b0\u30eb\u30b5\u30a4\u30f3\u30aa\u30f3\u30c8\u30fc\u30af\u30f3\u304c\u306a\u3044\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u691c\u7d22\u3067\u304d\u307e\u305b\u3093\u3002

resource.validation.does.not.match.valid.resources={0} \u306f\u6709\u52b9\u306a\u30ea\u30bd\u30fc\u30b9\u306b\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
resource.validation.invalid.resource={0} \u304c\u7121\u52b9\u3067\u3059\u3002
