#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amSession_fr.properties,v 1.11 2009/12/26 03:53:27 cbasha Exp $
#

# Portions Copyrighted 2012 ForgeRock Inc
# Portions Copyrighted 2012 Open Source Solution Technology Corporation

onlinehelp.doc=session.html
unexpectedResponse=Nombre de r\u00e9ponses re\u00e7ues inattendu.
unexpectedSession=Nombre de sessions re\u00e7ues inattendu.
invalidSessionID=ID de session non valide.
invalidSessionState=statut de session non valide.
protectedPropertyNoClientToken=Impossible de d\u00e9finir une propri\u00e9t\u00e9 prot\u00e9g\u00e9e sans jeton d\u2019identification du client.
protectedPropertyNoSSOTokenMgrInstance=Impossible d\u2019atteindre l\u2019instance SSOTokenManager pour valider le jeton du client.
protectedPropertyInvalidClientToken=Impossible de d\u00e9finir une propri\u00e9t\u00e9 prot\u00e9g\u00e9e car le jeton de client est invalide.
protectedPropertyNoAdminToken=Impossible de r\u00e9cup\u00e9rer un jeton admin pour valider en fonction du jeton client.
protectedPropertyNoPermission=Le client n\u2019a pas la permission de d\u00e9finir une propri\u00e9t\u00e9 prot\u00e9g\u00e9e. Requ\u00eate de mise \u00e0 jour de session rejet\u00e9e.
unexpectedEOF=Fin du fichier inattendue.
readRandomDeviceFailed=La lecture de l\u2019unit\u00e9 al\u00e9atoire a \u00e9chou\u00e9.
noPrivilege=Aucun privil\u00e8ge pour ex\u00e9cuter cette op\u00e9ration.
sessionNotObtained=Impossible d\u2019obtenir la session.
unknownRequestMethod=M\u00e9thode de demande inconnue.
iplanet-am-session-service-description=Session
sessionTimedOut=D\u00e9passement du d\u00e9lai de session.
sessionNotTimedOut=La session n\u2019est pas encore arriv\u00e9e \u00e0 expiration.
propertyMustBeSet=Les propri\u00e9t\u00e9s com.iplanet.am.serveurlocal.{protocole,h\u00f4te,port} doivent \u00eatre param\u00e9tr\u00e9es sur le mode de basculement.
restrictionViolation=Tentative ill\u00e9gale d\u2019utilisation d\u2019un jeton restreint.
appTokenInvalid=Le jeton de l\u2019application accept\u00e9 n\u2019est pas valide.
emptyTrustedSourceList=Aucune entr\u00e9e trouv\u00e9e dans les listes des sources ou des serveurs de plate-forme de confiance
unsupportedFunction=Fonction non prise en charge.
SessionTableNotFound=La table de sessions ne figure pas dans l\u2019espace de stockage de sessions.
getValidSessionsError=Impossible d\u2019obtenir les sessions valides du serveur sp\u00e9cifi\u00e9.
a101=Dur\u00e9e maximale de session
a101.help=En minutes.
a102=Dur\u00e9e maximale d\u2019inactivit\u00e9
a102.help=En minutes.
a103=Dur\u00e9e maximale de mise en cache
a103.help=En minutes.
a104=Statut du service de session
a105=Nombre maximal de r\u00e9sultats renvoy\u00e9s par la recherche
a105.help=Ne d\u00e9finissez pas cet attribut sur une valeur sup\u00e9rieure \u00e0 1 000 \u00e0 moins de disposer de ressources syst\u00e8me suffisantes.
a106=D\u00e9lai d\u2019attente de recherche
a106.help=En secondes.
a107=Basculement de session
a108=Utilisateur de l\u2019emplacement de stockage de sessions
a109=Mot de passe pour l\u2019emplacement de stockage de sessions
a110=Liste des serveurs de clusters de sessions
a111=Temps d\u2019attente maximal
a111.help=Expiration du d\u00e9lai de lecture pour la reprise de la session (en millisecondes).
a112=Nom de classe d\u2019impl\u00e9mentation du pilote JDBC
a113=URL de LDAP\u00e9es
a114=Taille minimale du pool
a115=Taille maximale du pool
a116=Activer les notifications de modification de propri\u00e9t\u00e9
a117=Activer les contraintes li\u00e9es aux quotas
a118=Sessions utilisateur actives
a118.help=Nombre maximal de sessions simultan\u00e9es autoris\u00e9es pour un utilisateur.
a119=Expiration du d\u00e9lai de lecture de la contrainte li\u00e9e aux quotas
a119.help=Temps d\u2019attente maximal pour la r\u00e9cup\u00e9ration du nombre de sessions (en millisecondes).
a119b=Comportement observ\u00e9 en cas d\u2019\u00e9puisement du quota de sessions
a119b.help=a119b.help=DENY_ACCESS (la requ\u00eate de cr\u00e9ation d\u2019une nouvelle session sera refus\u00e9e)<br/>DESTROY_NEXT_EXPIRING (la prochaine session arrivant \u00e0 expiration sera supprim\u00e9e)<br/>DESTROY_OLDEST_SESSION (la plus ancienne session sera supprim\u00e9e)<br/>DESTROY_OLD_SESSIONS (toutes les sessions pr\u00e9c\u00e9dentes seront supprim\u00e9e)
a119c=Refuser la connexion de l\u2019utilisateur lorsque le r\u00e9f\u00e9rentiel de session ne fonctionne pas
a119c.help=Cet attribut s\u2019applique uniquement si la contrainte li\u00e9e aux quotas de session est activ\u00e9e.
a120=Propri\u00e9t\u00e9s de notification
a120.help=Envoyer des notifications en cas de modification de ces propri\u00e9t\u00e9s.
a121=Basculement de session activ\u00e9
a121b=La restriction DN uniquement est activ\u00e9e
a121b.help=Cet attribut contr\u00f4le si le serveur fait une v\u00e9rification de DN stricte en \u00e9change de l\u2019acceptation d\u2019une adresse IP d\u2019un client lors de la d\u00e9finition d\u2019une restriction en mode de r\u00e9duction de d\u00e9tournement de cookie.
a122=Activer l\u2019ajustement de session
a124=Session Persistence and High Availability Failover Enabled
a124.help=Enabling provides full Session persistence and when coupled with a clustered environment provides Session High availability Failover as well.
a125=LDAP URL
a125.help=Specify LDAP URL for distinct Session Failover Persistence. If using Embedded OpenDJ or External Configuration Store for Session Persistence, leave this field blank.
a126=LDAP Root DN
a126.help=Root Container DN to contain Session Objects on external Store.
a127=LDAP User DN
a128=LDAP User Password
a129=Minimum Pool Size
a130=Maximum Pool Size
a131=Maximum Connection Wait Time
a131.help=Read Timeout for retrieving the session (in milliseconds).
p101=Obtenir toutes les sessions valides
p102=D\u00e9truire une session
p103=Ajouter un listener de session \u00e0 toutes les sessions

choiceActive=Actif
choiceInactive=Inactif
choiceDeleted=Supprim\u00e9
choiceON=Activ\u00e9e
choiceOFF=D\u00e9sactiv\u00e9e
choiceYES=YES
choiceNO=NO
choiceDenyAccess=DENY_ACCESS
choiceDestroyNextExpiring=DESTROY_NEXT_EXPIRING
choiceDestroyOldSession=DESTROY_OLDEST_SESSION
choiceDestroyAll=DESTROY_OLD_SESSIONS
i18nTrue=Activ\u00e9
i18nFalse=D\u00e9sactiv\u00e9
