<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Ajout d'un contact &#224; un fournisseur dans une entit&#233; fournisseur - Aide en ligne de la console Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fscreatecontactperson"></a><h4>Ajout d'un contact &#224; un fournisseur dans une entit&#233; fournisseur</h4><a name="indexterm-81"></a><p>Les informations relatives &#224; un contact (individu) pour un fournisseur de services
ou d'identit&#233;s particulier peuvent &#234;tre ajout&#233;es au profil du fournisseur dans une
entit&#233; fournisseur. Le point de d&#233;part est l'&#233;cran Entit&#233;s sous F&#233;d&#233;ration.</p><ol>
<li><b>Cliquez sur le nom d'une entit&#233; configur&#233;e pour modifier son profil.</b><p>La page du profil de l'entit&#233; s'affiche.</p></li>
<li><b>S&#233;lectionnez Fournisseur d'identit&#233;s ou Fournisseur de services dans le menu Affichage.</b></li>
<li><b>Cliquez sur Nouveau contact sous le groupe d'attributs Contacts.</b></li>
<li><b>Fournissez les valeurs des attributs du nouveau contact.</b><dl><dt>Pr&#233;nom</dt>
<dd><p>Tapez le nom de bapt&#234;me du contact de l'entit&#233;.</p></dd>
<dt>Nom</dt>
<dd><p>Tapez le nom de famille du contact de l'entit&#233;.</p></dd>
<dt>Type</dt>
<dd><p>Choisissez le type du contact dans le menu d&#233;roulant :</p>
<ul><li><p>Administrateur</p></li>
<li><p>Facturation</p></li>
<li><p>Technique</p></li>
<li><p>Autre</p></li></ul>
</dd>
<dt>Soci&#233;t&#233;</dt>
<dd><p>Tapez le nom de la soci&#233;t&#233; qui emploie cette personne.</p></dd>
<dt>ID principal Liberty</dt>
<dd><p>Tapez un URI qui pointe sur une instance en ligne du profil d'informations personnelles du contact.</p></dd>
<dt>Adresses e-mail</dt>
<dd><p>Tapez une ou plusieurs adresses e-mail pour le contact, puis cliquez sur Ajouter.</p></dd>
<dt>Num&#233;ros de t&#233;l&#233;phone</dt>
<dd><p>Tapez un ou plusieurs num&#233;ros de t&#233;l&#233;phone pour le contact, puis cliquez sur Ajouter.</p></dd>
</dl>
</li>
<li><b>Cliquez sur Cr&#233;er pour terminer la configuration du contact.</b></li>
<li><b>Cliquez sur Enregistrer dans la page Profil de l'entit&#233; pour terminer la
configuration de l'entit&#233;.</b></li></ol>
<br/>

</body>
</html>
