<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Types de magasins de donn&#233;es OpenSSO - Aide en ligne de la console Sun OpenSSO&#160;8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="idrepoadd"></a><h4>Types de magasins de donn&#233;es OpenSSO</h4>
<p>Dans l'&#233;cran de s&#233;lection de magasin de donn&#233;es OpenSSO, vous pouvez cr&#233;er
les types de magasins de donn&#233;es suivants&#160;:</p>

<a name="gdlmv"></a><h5>Active Directory</h5>
<p>Ce type de magasin de donn&#233;es utilise la sp&#233;cification LDAP version 3
pour &#233;crire des donn&#233;es d'identit&#233; dans une instance de Microsoft Active Directory.</p><p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <a href="realm.idrepoeditad.html">Attributs Active Directory</a>.</p>

<a name="gdlmr"></a><h5>LDAPv3 g&#233;n&#233;rique</h5>
<p>Ce type de magasin de donn&#233;es vous permet d'&#233;crire des donn&#233;es d'identit&#233;
dans une quelconque base de donn&#233;es compatible LDAPv3. Si la base de
donn&#233;es LDAPv3 utilis&#233;e ne prend pas en charge la recherche persistante, vous
ne pourrez pas utiliser la fonction de mise en cache.</p><p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <a href="realm.idrepoeditldapv3.html">Attributs LDAPv3 g&#233;n&#233;rique</a>.</p>

<a name="gdlnw"></a><h5>Sch&#233;ma OpenSSO Sun Directory Server</h5>
<p>Ce type de magasin de donn&#233;es se trouve dans une instance Sun
Java System Directory Server et contient l'arborescence d'informations OpenSSO. </p><p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <a href="realm.idrepoeditfamschema.html">Sun Directory Server avec attributs de sch&#233;ma OpenSSO</a>.</p>
<br/>

</body>
</html>
