/**
 * NE MODIFIEZ PAS ET NE SUPPRIMEZ PAS LES MENTIONS DE COPYRIGHT OU CET EN-T\u00caTE.
 *
 * Copyright (c) 2008 Sun Microsystems, Inc. Tous droits r\u00e9serv\u00e9s
 *
 * Le contenu de ce fichier est soumis aux conditions
 * de la Common Development and Distribution License
 * (la Licence). Vous n\u2019\u00eates pas autoris\u00e9 \u00e0 utiliser ce fichier sauf dans le
 * cadre de la Licence.
 *
 * Vous pouvez obtenir une copie de la Licence \u00e0 l\u2019adresse
 * https://opensso.dev.java.net/public/CDDLv1.0.html ou
 * opensso/legal/CDDLv1.0.txt
 * Consultez la Licence pour en savoir plus sur les permissions et
 * les limitations sp\u00e9cifiques r\u00e9gissant les langues dans le cadre de la License.
 *
 * Lors de la distribution du code couvert, incluez cet
 * mention d\u2019en-t\u00eate CDDL dans chaque fichier, ainsi que le fichier License
 * dans opensso/legal/CDDLv1.0.txt.
 * Le cas \u00e9ch\u00e9ant, ajoutez ce qui suit sous l\u2019en-t\u00eate CDDL,
 * en rempla\u00e7ant les champs entre crochets [] par
 * vos propres informations d\u2019identification\u00a0:
 * "Parties prot\u00e9g\u00e9es par copyright [ann\u00e9e] [nom du d\u00e9tenteur du copyright]"
 *
 * $Id: ServerConfigService_fr.properties,v 1.3 2009/12/26 03:53:25 cbasha Exp $
 *
 */

#General
service-start-msg=Le service de configuration de serveur a d\u00e9marr\u00e9 ...
service-done-msg=Service de configuration de serveur termin\u00e9 ...
invalid-bootstrap-location= Emplacement du programme d\u2019initialisation non valide\u00a0:
cannot-bootstrap-system=Impossible d\u2019initialiser le syst\u00e8me.
cannot-load-properties=Impossible de charger les propri\u00e9t\u00e9s \u00e0 partir du r\u00e9pertoire\u00a0: {0}
msg-fail=\u00c9chec de l\u2019op\u00e9ration
msg-pass=Op\u00e9ration accomplie
msg-ok=OK

svr-auth-msg=\u00c9chec de l\u2019authentification
#
#SAML general message
#
saml-validate-cfg=Validation de la configuration SAML.
saml-validate-cfg-prop=Validation des propri\u00e9t\u00e9s SAML.
saml-file-loc=Fichier\u00a0: {0}

#store password related 
saml-validate-storepwd-prop=Validation de la propri\u00e9t\u00e9 de mot de passe store
saml-invalid-storepwd-prop=Propri\u00e9t\u00e9 du mot de passe store incorrecte.
saml-storepwd-file-not-exist=Le fichier de mot de passe store n\u2019existe pas\u00a0: {0}
saml-invalid-storepass-file=Chemin/nom de fichier storepass non valide\u00a0: {0}
saml-invalid-storepassd=Mot de passe store non valide
saml-storepass-empty=Impossible de lire le mot de passe store. V\u00e9rifiez si le fichier est vide.

#key password related 
saml-keypwd-file-not-exist=Le fichier de mot de passe clef n\u2019existe pas\u00a0: {0}
saml-invalid-keypass-file=Chemin/nom de fichier keypass non valide\u00a0: {0}
saml-validate-keypwd-prop=Validation de la propri\u00e9t\u00e9 du mot de passe clef
saml-invalid-keypwd-prop=Propri\u00e9t\u00e9 du mot de passe key incorrecte.
saml-keypass-empty=Impossible de lire le mot de passe key. V\u00e9rifiez si le fichier est vide.
saml-invalid-keypassd=Mot de passe key non valide

#key store related 
saml-validate-keystore-prop=Validation de la propri\u00e9t\u00e9 du magasin de cl\u00e9s
saml-invalid-keystore-prop=La propri\u00e9t\u00e9 du magasin de cl\u00e9s est incorrecte
saml-validate-keystore-pwd=Validation du mot de passe du magasin de cl\u00e9s
saml-invalid-keystore-file=Chemin/nom de fichier keystore non valide\u00a0: {0}
saml-keystore-file-not-exist=Le fichier keystore n\u2019existe pas\u00a0: {0}
saml-loading-keystore=Chargement du magasin de cl\u00e9s
saml-open-ks-failed=Impossible d\u2019ouvrir le magasin de cl\u00e9s avec le mot de passe de magasin de cl\u00e9s donn\u00e9.
saml-loading-failed=Impossible de charger le magasin de cl\u00e9s avec le mot de passe de magasin de cl\u00e9s donn\u00e9.

#cert alias
saml-cannot-validate-ks-pwd=Impossible de valider le mot de passe key. Alias du certificat non valide\u00a0: {0}
saml-cert-alias-mismatch=Pas de certificat avec l\u2019alias donn\u00e9\u00a0: {0}
saml-validate-cert-alias=Validation de l\u2019alias cert SAML.

#xml signature
saml-validate-xml-sig=Validation de l\u2019algorithme de signature XML.
saml-missing-prop=Propri\u00e9t\u00e9 requise manquante : {0}
saml-empty-prop-val=La valeur de propri\u00e9t\u00e9 est vide pour : {0}
saml-inv-xml-alg-val=Valeur non valide pour l\u2019algorithme de signature XML : {0}
saml-xml-alg-mismatch=L\u2019algorithme {0} sp\u00e9cifi\u00e9 ne correspond pas au certificat\u00a0: {1}
saml-cannot-validate-sig=Impossible de valider la signature. Alias du certificat non valide

saml-invalid-cfg-prop=Les propri\u00e9t\u00e9s relatives \u00e0 SAML contiennent des valeurs non valides.
saml-prop-not-cfgd=Les propri\u00e9t\u00e9s SAML ne sont pas configur\u00e9es.
saml-exp-cfg-info-validation=Exception lors de la validation des informations de configuration SAML\u00a0: {0}
saml-detect-prop=D\u00e9tection des propri\u00e9t\u00e9s relatives \u00e0 SAML.

#
# Server configuration 
#
#Server
svr-get-boot-corrupt=Lecture du fichier d\u2019initialisation
svr-get-boot-info=Lecture du fichier d\u2019initialisation pour les serveurs d\u2019initialisation.
svr-boot-parse-err=Impossible d\u2019analyser le fichier d\u2019initialisation \u00e0 : {0} 
svr-boot-not-found=Impossible de trouver le fichier d\u2019initialisation \u00e0 : {0}
svr-boot-read-err=Erreur de lecture du fichier d\u2019initialisation \u00e0 : {0}
svr-all-boot-svr-dwn=Tous les serveurs d\u2019initialisation sont d\u00e9faillants \u00e0 l\u2019emplacement : {0}
svr-ins-prop-load-fail=Impossible de charger les propri\u00e9t\u00e9s pour l\u2019instance : {0}
svr-prop-load-fail=Erreur fatale. Impossible de charger les propri\u00e9t\u00e9s. Voir le fichier de d\u00e9bogage.
svr-ins-running=V\u00e9rifie si le l\u2019instance de serveur est en cours d\u2019ex\u00e9cution.
svr-ins-not-running=L\u2019instance de serveur n\u2019est pas ex\u00e9cut\u00e9e \u00e0 : {0}
svr-validate-ins-prop=Validation des propri\u00e9t\u00e9s de : {0}
svr-no-svr-entry=Aucune entr\u00e9e de serveur trouv\u00e9e pour l\u2019instance de serveur : {0}
svr-glog-prop-chg=D\u00e9tection des propri\u00e9t\u00e9s modifi\u00e9es globales.
svr-ins-prop-chg=D\u00e9tection des propri\u00e9t\u00e9s modifi\u00e9es de l\u2019instance.
svr-process-svr-ins=Traitement de l\u2019instance de serveur : {0} 
svr-prop-not-in-valid-list=La propri\u00e9t\u00e9 ne se trouve pas dans une liste valide : {0} 
svr-invalid-prop=Propri\u00e9t\u00e9 non valide : {0}
svr-ins-prop-unswapped=Les propri\u00e9t\u00e9s d\u2019instance ne sont pas \u00e9chang\u00e9es avec une instance : {0}
svr-notify-url-validation=Validation de l\u2019URL de notification
svr-invalid-value=Valeur non valide - propri\u00e9t\u00e9 : {0} valeur : {1}  
svr-no-site-cfg=L\u2019instance de serveur {0} n\u2019appartient \u00e0 aucun site.
svr-validate-site-cfg=Validation de la configuration de site du serveur 
svr-belongs-to-invalid-site=L\u2019instance de serveur appartient \u00e0 un site non-existant : {0}
svr-url-prop-mismatch=L\u2019entr\u00e9e de serveur ne correspond \u00e0 l\u2019URL construite \u00e0 partir des propri\u00e9t\u00e9s : {0}
svr-org-alias-entry=Entr\u00e9e de serveur dans l\u2019alias d\u2019organisation 
svr-entry-not-in-org-alias=L\u2019instance de serveur ne poss\u00e8de pas d\u2019entr\u00e9e dans l\u2019alias d\u2019organisation : {0}
svr-validating-php-uri=Validation de l\u2019entr\u00e9e de serveur avec les propri\u00e9t\u00e9s protocol://host:port/uri 
svr-process-enc-key=V\u00e9rification de toutes les cl\u00e9s de chiffrement.
svr-validating-enc-key=Validation de la cl\u00e9 de chiffrement.
svr-entries-with-multiple-enc-key=Les entr\u00e9es de serveur ont des cl\u00e9s incompatibles.
svr-enc-key-list=Cl\u00e9 : "{0}" : utilis\u00e9e par : "{1}" 
svr-print-prop={0} = {1}
svr-persist-prop=Validation de la propri\u00e9t\u00e9 de recherche persistante
svr-persist-prop-err=
#Site
site-validate-cfg-prop=Validation de configuration de site 
site-org-alias-check=Validation d\u2019entr\u00e9e de site en fonction de l\u2019alias d\u2019organisation 
site-org-alias-fail=Pas d\u2019entr\u00e9e dans l\u2019alias d\u2019organisation pour le site : {0}
site-invalid-url=URL de site non valide : {0}
site-url-syntax=Validation de la syntaxe d\u2019entr\u00e9e d\u2019URL de site
site-host-validate=Validation du nom d\u2019h\u00f4te du site  
site-url-process-entry=Traitement de l\u2019entr\u00e9e de site : {0}
site-url-validate=Validation du format de nom d\u2019url de site  
site-invalid-site-host=Nom d\u2019h\u00f4te de site non valide : {0}
site-uri-misplace=URI de d\u00e9ploiement mal plac\u00e9e dans l\u2019url de site : {0}
site-url-syntax-err=Syntaxe d\u2019URL de site non valide. URI de d\u00e9ploiement manquante ou non valide : {0}
site-missing-svr-uri=La valeur de l\u2019URI de d\u00e9ploiement de serveur est manquante : {0}
site-svr-url-in-site=Impossible d\u2019utiliser l\u2019URL du server comme entr\u00e9e de site : {0}
site-in-svr-list=Validation des entr\u00e9es de site en fonction des entr\u00e9es de serveur.
site-not-configured=Aucun site n\u2019est configur\u00e9.

#
#Session Failover 
#
sfo-validate-cfg-prop=Validation de la configuration de basculement de session
sfo-validate-jdbc-url=Validation de l\u2019URL de base de donn\u00e9es 
sfo-jdbc-url-empty=L\u2019URL de base de donn\u00e9es est vide.
sfo-jdbc-url=URL : {0}
sfo-jdbc-url-invalid=URL non valide : {0}
sfo-jdbc-url-single=L\u2019URL de base de donn\u00e9es contient uniquement un serveur Message Queue.
sfo-jdbc-url-no-port=Syntaxe de nom d\u2019h\u00f4te non valide. Port manquant : {0}
sfo-jdbc-url-invalid-host=Nom d\u2019h\u00f4te non valide : {0}
sfo-jdbc-url-invalid-port=Port non valide : {0}
sfo-cfg-enabled=Le basculement de session est activ\u00e9 pour l\u2019instance : {0}
sfo-cfg-not-enabled=Le basculement de session n\u2019est pas activ\u00e9 pour l\u2019instance : {0}
sfo-cfg-prop-details=D\u00e9tails de la configuration du basculement de session : 
sfo-cfg-prop-notfound=Impossible d\u2019obtenir la configuration de basculement de session.
sfo-cfg-params=UserName = {0} \n clusterServerList = {1} \n connectionMaxWaitTime = {2} \n minPoolSize = {3} \n maxPoolSize = {4}

#
#Directory Server
#
ds-ins-validation=Validation en fonction de l\u2019instance de serveur d\u2019annuaire : {0} 
ds-ins-connect=Connexion \u00e0 Directory Server.
ds-connect-at-suffix=Connexion au serveur d\u2019annuaire portant le suffixe : {0}
ds-failed-connect-at-suffix=Connexion impossible \u00e0 Directory Server avec le suffixe : {0}
ds-sfx-connect=Connexion avec le suffixe configur\u00e9.
ds-not-running=Le serveur d\u2019annuaire n\u2019est pas ex\u00e9cut\u00e9 sur : {0}:{1}
ds-no-ins-to-connect=Impossible de se connecter \u00e0 un serveur d\u2019annuaire de configuration.
