/**
 * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
 *
 * Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
 *
 * The contents of this file are subject to the terms
 * of the Common Development and Distribution License
 * (the License). You may not use this file except in
 * compliance with the License.
 *
 * You can obtain a copy of the License at
 * https://opensso.dev.java.net/public/CDDLv1.0.html or
 * opensso/legal/CDDLv1.0.txt
 * See the License for the specific language governing
 * permission and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL
 * Header Notice in each file and include the License file
 * at opensso/legal/CDDLv1.0.txt.
 * If applicable, add the following below the CDDL Header,
 * with the fields enclosed by brackets [] replaced by
 * your own identifying information:
 * "Portions Copyrighted [year] [name of copyright owner]"
 *
 * $Id: ServerConfigReport_ja.properties,v 1.3 2009/12/26 03:51:44 cbasha Exp $
 *
 */

#General
service-start-msg=\u30ec\u30dd\u30fc\u30c8\u30b5\u30fc\u30d3\u30b9\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f...
service-done-msg=\u30ec\u30dd\u30fc\u30c8\u30b5\u30fc\u30d3\u30b9\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f...
msg-fail=\u5931\u6557
msg-pass=\u6210\u529f
msg-ok=\u4e86\u89e3

#Server report
invalid-bootstrap-location= \u7121\u52b9\u306a\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u4f4d\u7f6e:
cannot-bootstrap-system=\u30b7\u30b9\u30c6\u30e0\u3092\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
cannot-load-properties=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093: {0}
rpt-svr-print-prop={0} = {1}
rpt-svr-gen=\u30b5\u30fc\u30d0\u30fc\u30ec\u30dd\u30fc\u30c8\u3092\u751f\u6210\u3057\u3066\u3044\u307e\u3059 
rpt-auth-msg=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f 

#KeyStore report
rpt-cert-gen=\u30ad\u30fc\u30b9\u30c8\u30a2\u30ec\u30dd\u30fc\u30c8\u3092\u751f\u6210\u3057\u3066\u3044\u307e\u3059 
rpt-storepwd-file-not-exist=\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093: {0}
rpt-invalid-storepassd=\u7121\u52b9\u306a\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9
rpt-invalid-storepass-file=\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u307e\u305f\u306f\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u7121\u52b9\u3067\u3059: {0}
rpt-invalid-storepwd-prop=\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
rpt-keystore-file-not-exist=\u30ad\u30fc\u30b9\u30c8\u30a2\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093: {0}
rpt-invalid-keystore-file=\u30ad\u30fc\u30b9\u30c8\u30a2\u306e\u30d5\u30a1\u30a4\u30eb\u30d1\u30b9/\u30d5\u30a1\u30a4\u30eb\u540d\u304c\u7121\u52b9\u3067\u3059: {0}
rpt-loading-keystore=\u30ad\u30fc\u30b9\u30c8\u30a2\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059
rpt-loading-failed=\u6307\u5b9a\u3057\u305f\u30ad\u30fc\u30b9\u30c8\u30a2\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u306f\u3001\u30ad\u30fc\u30b9\u30c8\u30a2\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

#Agent report
rpt-agt-gen=\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u30ec\u30dd\u30fc\u30c8\u3092\u751f\u6210\u3057\u3066\u3044\u307e\u3059 
rpt-agt-auth-to-svr-fail=\u6b21\u306e\u30e6\u30fc\u30b6\u30fc\u8cc7\u683c\u306b\u3088\u308b\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
rpt-agt-auth-to-svr=\u30d6\u30fc\u30c8\u8cc7\u683c\u306b\u3088\u308b\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u8a8d\u8a3c\u3092\u3057\u3066\u3044\u307e\u3059
rpt-agt-fatal-connect-err=\u81f4\u547d\u7684\u30a8\u30e9\u30fc\u30cd\u30fc\u30e0\u30b5\u30fc\u30d3\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093: {0}
rpt-agt-invalid-naming-url=\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30cd\u30fc\u30df\u30f3\u30b0 URL \u304c\u7121\u52b9\u3067\u3059: {0}
rpt-agt-naming-url-validation=\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30cd\u30fc\u30df\u30f3\u30b0 URL \u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059
rpt-agt-naming-url-connect=\u30cd\u30fc\u30df\u30f3\u30b0 URL \u3092\u4f7f\u7528\u3057\u3066\u63a5\u7d9a\u3057\u3066\u3044\u307e\u3059: {0}
rpt-agt-svr-connect-status=\u30b5\u30fc\u30d0\u30fc\u306e\u63a5\u7d9a\u3092\u691c\u67fb\u3057\u3066\u3044\u307e\u3059: {0}
rpt-agt-loading-cfg-prop=\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059\u3002
rpt-agt-cfg-type=\u30bf\u30a4\u30d7: {0}
rpt-agt-name=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc: {0}

