/**
 * NE MODIFIEZ PAS ET NE SUPPRIMEZ PAS LES MENTIONS DE COPYRIGHT OU CET EN-T\u00caTE.
 *
 * Copyright (c) 2008 Sun Microsystems, Inc. Tous droits r\u00e9serv\u00e9s
 *
 * Le contenu de ce fichier est soumis aux conditions
 * de la Common Development and Distribution License
 * (la Licence). Vous n\u2019\u00eates pas autoris\u00e9 \u00e0 utiliser ce fichier sauf dans le
 * cadre de la Licence.
 *
 * Vous pouvez obtenir une copie de la Licence \u00e0 l\u2019adresse
 * https://opensso.dev.java.net/public/CDDLv1.0.html ou
 * opensso/legal/CDDLv1.0.txt
 * Consultez la Licence pour en savoir plus sur les permissions et
 * les limitations sp\u00e9cifiques r\u00e9gissant les langues dans le cadre de la License.
 *
 * Lors de la distribution du code couvert, incluez cet
 * mention d\u2019en-t\u00eate CDDL dans chaque fichier, ainsi que le fichier License
 * dans opensso/legal/CDDLv1.0.txt.
 * Le cas \u00e9ch\u00e9ant, ajoutez ce qui suit sous l\u2019en-t\u00eate CDDL,
 * en rempla\u00e7ant les champs entre crochets [] par
 * vos propres informations d\u2019identification :
 * "Parties prot\u00e9g\u00e9es par copyright [ann\u00e9e] [nom du d\u00e9tenteur du copyright]"
 *
 * $Id: ServerConfigReport_fr.properties,v 1.3 2009/12/26 03:53:25 cbasha Exp $
 *
 */

#General
service-start-msg=D\u00e9marrage du service de g\u00e9n\u00e9ration de rapports ...
service-done-msg=Service de g\u00e9n\u00e9ration de rapports termin\u00e9 ...
msg-fail=\u00c9chec de l\u2019op\u00e9ration
msg-pass=Op\u00e9ration accomplie
msg-ok=OK

#Server report
invalid-bootstrap-location= Emplacement du programme d\u2019initialisation non valide\u00a0:
cannot-bootstrap-system=Impossible d\u2019initialiser le syst\u00e8me.
cannot-load-properties=Impossible de charger les propri\u00e9t\u00e9s \u00e0 partir du r\u00e9pertoire\u00a0: {0}
rpt-svr-print-prop={0} = {1}
rpt-svr-gen=G\u00e9n\u00e9ration du rapport de serveur 
rpt-auth-msg=\u00c9chec de l\u2019authentification 

#KeyStore report
rpt-cert-gen=G\u00e9n\u00e9ration du rapport keystore 
rpt-storepwd-file-not-exist=Le fichier de mot de passe store n\u2019existe pas\u00a0: {0}
rpt-invalid-storepassd=Mot de passe store non valide
rpt-invalid-storepass-file=Chemin/nom de fichier storepass non valide\u00a0: {0}
rpt-invalid-storepwd-prop=Propri\u00e9t\u00e9 du mot de passe store incorrecte.
rpt-keystore-file-not-exist=Le fichier keystore n\u2019existe pas\u00a0: {0}
rpt-invalid-keystore-file=Chemin/nom de fichier keystore non valide\u00a0: {0}
rpt-loading-keystore=Chargement du magasin de cl\u00e9s
rpt-loading-failed=Impossible de charger le magasin de cl\u00e9s avec le mot de passe de magasin de cl\u00e9s donn\u00e9.

#Agent report
rpt-agt-gen=G\u00e9n\u00e9ration du rapport de l\u2019agent 
rpt-agt-auth-to-svr-fail=\u00c9chec de l\u2019authentification aupr\u00e8s du serveur avec les r\u00e9f\u00e9rences utilisateur pour\u00a0: {0}
rpt-agt-auth-to-svr=Authentification aupr\u00e8s du serveur avec r\u00e9f\u00e9rences d\u2019initialisation
rpt-agt-fatal-connect-err=Erreur fatale !!! Impossible de contacter le service de nommage : {0}
rpt-agt-invalid-naming-url=URL de nommage non valide dans les propri\u00e9t\u00e9s d\u2019initialisation\u00a0: {0}
rpt-agt-naming-url-validation=Validation de l\u2019URL de nommage dans les propri\u00e9t\u00e9s d\u2019initialisation
rpt-agt-naming-url-connect=Connexion \u00e0 l\u2019aide de l\u2019URL de nommage\u00a0: {0}
rpt-agt-svr-connect-status=V\u00e9rification de la connexion au serveur\u00a0: {0}
rpt-agt-loading-cfg-prop=Chargement des propri\u00e9t\u00e9s d\u2019agent \u00e0 partir du serveur.
rpt-agt-cfg-type=Type\u00a0: {0}
rpt-agt-name=Propri\u00e9t\u00e9s de\u00a0: {0}

