/**
 * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
 *
 * Copyright (c) 2008 Sun Microsystems Inc. All Rights Reserved
 *
 * The contents of this file are subject to the terms
 * of the Common Development and Distribution License
 * (the License). You may not use this file except in
 * compliance with the License.
 *
 * You can obtain a copy of the License at
 * https://opensso.dev.java.net/public/CDDLv1.0.html or
 * opensso/legal/CDDLv1.0.txt
 * See the License for the specific language governing
 * permission and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL
 * Header Notice in each file and include the License file
 * at opensso/legal/CDDLv1.0.txt.
 * If applicable, add the following below the CDDL Header,
 * with the fields enclosed by brackets [] replaced by
 * your own identifying information:
 * "Portions Copyrighted [year] [name of copyright owner]"
 *
 * $Id: ServerConnection_ja.properties,v 1.3 2009/12/26 03:51:44 cbasha Exp $
 *
 */

#General
service-start-msg=\u63a5\u7d9a\u30c6\u30b9\u30c8\u30b5\u30fc\u30d3\u30b9\u304c\u958b\u59cb\u3055\u308c\u307e\u3057\u305f...
service-done-msg=\u63a5\u7d9a\u30c6\u30b9\u30c8\u30b5\u30fc\u30d3\u30b9\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f...
msg-fail=\u5931\u6557
msg-pass=\u6210\u529f
msg-ok=\u4e86\u89e3

#Connection related
invalid-bootstrap-location=\u7121\u52b9\u306a\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u4f4d\u7f6e:
cannot-bootstrap-system=\u30b7\u30b9\u30c6\u30e0\u3092\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
cannot-load-properties=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093: {0}
cnt-auth-msg=\u8a8d\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f
cnt-svr-msg=\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u63a5\u7d9a\u3057\u3066\u3044\u307e\u3059
cnt-process-svr-ins=\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304a\u3088\u3073\u30b5\u30a4\u30c8\u30a8\u30f3\u30c8\u30ea\u3092\u51e6\u7406\u3057\u3066\u3044\u307e\u3059: {0} 
cnt-svr-current=\u30b5\u30fc\u30d0\u30fc\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9: {0} 
cnt-svr-connect-status=\u63a5\u7d9a: {0} 
cnt-svr-connect-ssl-fail=SSL \u63a5\u7d9a\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u6709\u52b9\u306a\u8a3c\u660e\u66f8\u30d1\u30b9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093 
cnt-ds-msg=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u306b\u63a5\u7d9a\u3057\u3066\u3044\u307e\u3059
cnt-ds-datastore=\u30c7\u30fc\u30bf\u30b9\u30c8\u30a2\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u51e6\u7406\u3057\u3066\u3044\u307e\u3059: {0}
cnt-ds-no-entries=\u30a8\u30f3\u30c8\u30ea\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u304b\u3001\u53d6\u5f97\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 
cnt-ds-invalid-port=\u7121\u52b9\u306a\u30dd\u30fc\u30c8\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30dd\u30fc\u30c8(389)\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
cnt-ds-no-port=\u6307\u5b9a\u3055\u308c\u305f\u30dd\u30fc\u30c8\u306f\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30dd\u30fc\u30c8(389)\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002

sfo-validate-cfg-prop=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059 
sfo-cfg-not-enabled=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093\u3002 
sfo-cfg-prop-notfound=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093\u3002
sfo-connect-credential-fail=\u30e1\u30c3\u30bb\u30fc\u30b8\u30ad\u30e5\u30fc\u306b\u30e6\u30fc\u30b6\u30fc\u3068\u3057\u3066\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: {0}
sfo-cfg-connect-failed=\u6b21\u306e\u5834\u6240\u3067\u63a5\u7d9a\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
sfo-cfg-connect-test=\u63a5\u7d9a\u3057\u3066\u3044\u307e\u3059\u3002\u30e6\u30fc\u30b6\u30fc: [{0}]\u3001\u5834\u6240: {1}
sfo-cfg-enabled=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306f\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002 
sfo-cfg-prop-details=\u30bb\u30c3\u30b7\u30e7\u30f3\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc:
sfo-invalid-jdbc-url=\u7121\u52b9\u306a JDBC URL \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f: {0}
sfo-jdbc-url-no-port=\u7121\u52b9\u306a\u30db\u30b9\u30c8\u540d\u306e\u69cb\u6587\u3002\u30dd\u30fc\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093: {0}
sfo-jdbc-url-invalid-host=\u7121\u52b9\u306a\u30db\u30b9\u30c8\u540d: {0}
sfo-jdbc-url-invalid-port=\u7121\u52b9\u306a\u30dd\u30fc\u30c8: {0}
sfo-mq-connect-status=\u63a5\u7d9a: {0}
sfo-jdbc-url-invalid=\u7121\u52b9\u306a URL: {0}
sfo-cfg-params=UserName = {0} \n clusterServerList = {1} \n connectionMaxWaitTime = {2} \n minPoolSize = {3} \n maxPoolSize = {4}


