#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amAuthJDBC_ja.properties,v 1.11 2009/12/26 03:51:44 cbasha Exp $
#

# Portions Copyrighted 2011 ForgeRock Inc
# Portions Copyrighted 2012 Open Source Solution Technology Corporation

onlinehelp.doc=jdbc.html
authentication=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb
sunAMAuthJDBCServiceDescription=JDBC

a100=\u63a5\u7d9a\u30bf\u30a4\u30d7
a100.help=\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306eJDBC\u63a5\u7d9a\u3092\u53d6\u5f97\u3059\u308b\u65b9\u6cd5\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a100.help.txt=\u63a5\u7d9a\u30bf\u30a4\u30d7\u304c\u975e\u6c38\u7d9a\u7684\u306a JDBC \u63a5\u7d9a\u306e\u5834\u5408\u3001 JDBC \u30c9\u30e9\u30a4\u30d0\u306f OpenAM \u306e web-app \u304b\u3089\u5229\u7528\u53ef\u80fd\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002\
\u63a5\u7d9a\u30bf\u30a4\u30d7\u304cJNDI\u306e\u5834\u5408\u3001 OpenAM Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30bf <code>web.xml</code> \u304c\u6b63\u3057\u3044 JNDI JDBC \u30ea\u30bd\u30fc\u30b9\u60c5\u5831\u3092\u542b\u3080\u3088\u3046\u306b\u4fee\u6b63\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\
J2EE \u30b3\u30f3\u30c6\u30ca\u306f\u3001\u6b63\u3057\u3044 JNDI JDBC \u30b3\u30f3\u30d5\u30a3\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a101=\u63a5\u7d9a\u30d7\u30fc\u30eb\u306e JNDI \u540d
a101.help=JDBC\u63a5\u7d9a\u30d7\u30fc\u30eb\u306eJNDI URL\u3002
a101.help.txt=JNDI URL \u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u8a8d\u8a3c\u306e\u305f\u3081\u306b J2EE \u30b3\u30f3\u30c6\u30ca\u3067\u4f5c\u6210\u3055\u308c\u305f JDBC \u63a5\u7d9a\u30d7\u30fc\u30eb\u3092\u6307\u3057\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u63a5\u7d9a\u30bf\u30a4\u30d7\u304c JNDI \u306e\u5834\u5408\u306e\u307f\u4f7f\u7528\u3002
a102=JDBC \u30c9\u30e9\u30a4\u30d0
a102.help=\u4f7f\u7528\u3059\u308b JDBC \u30c9\u30e9\u30a4\u30d0\u306e\u30af\u30e9\u30b9\u540d\u3002
a102.help.txt=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u63a5\u7d9a\u306b\u4f7f\u7528\u3059\u308b JDBC \u30c9\u30e9\u30a4\u30d0\u306e\u5b8c\u5168\u4fee\u98fe\u30af\u30e9\u30b9\u540d\u3002
Oracle \u307e\u305f\u306f MySQL \u306e\u307f\u30c9\u30e9\u30a4\u30d0\u304c\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u4ed6\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u7528\u306e JDBC\u30c9\u30e9\u30a4\u30d0\u304c\u52d5\u4f5c\u3059\u308b\u53ef\u80fd\u6027\u306f\u3042\u308a\u307e\u3059\u304c\u3001\
Oracle \u3067\u3042\u308b\u304b\u306e\u3088\u3046\u306b\u51e6\u7406\u3055\u308c\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u63a5\u7d9a\u30bf\u30a4\u30d7\u304c JDBC \u306e\u5834\u5408\u306e\u307f\u4f7f\u7528\u3002
a103=JDBC URL
a103.help=JDBC \u30c9\u30e9\u30a4\u30d0\u3092\u521d\u671f\u5316\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b JDBC URL\u3002
a103.help.txt=<i>\u6ce8\u610f </i>\u63a5\u7d9a\u30bf\u30a4\u30d7\u304c JDBC \u306e\u5834\u5408\u306e\u307f\u4f7f\u7528\u3002
a104=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u63a5\u7d9a\u3059\u308b\u30e6\u30fc\u30b6\u30fc
a104.help=\u3053\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u8a8d\u8a3c\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a104.help.txt=<i>\u6ce8\u610f </i>\u63a5\u7d9a\u30bf\u30a4\u30d7\u304c JDBC \u306e\u5834\u5408\u306e\u307f\u4f7f\u7528\u3002
a105=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u63a5\u7d9a\u3059\u308b\u305f\u3081\u306e\u30d1\u30b9\u30ef\u30fc\u30c9
a105.help=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u8a8d\u8a3c\u306b\u4f7f\u7528\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
a105.help.txt=<i>\u6ce8\u610f </i>\u63a5\u7d9a\u30bf\u30a4\u30d7\u304c JDBC \u306e\u5834\u5408\u306e\u307f\u4f7f\u7528\u3002
a106=\u30d1\u30b9\u30ef\u30fc\u30c9\u30ab\u30e9\u30e0\u306e\u6587\u5b57\u5217
a106.help=\u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u542b\u3080\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30ab\u30e9\u30e0\u540d\u3002
a106.help.txt=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u3088\u3063\u3066\u8fd4\u3055\u308c\u308b\u7d50\u679c\u30c6\u30fc\u30d6\u30eb\u304b\u3089\u3001\
\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u542b\u3080\u9069\u5207\u306a\u30ab\u30e9\u30e0\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a107=\u6e96\u5099\u3055\u308c\u3066\u3044\u308b\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8
a107.help=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304b\u3089\u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b SQL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3002
a107.help.txt=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304b\u3089\u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b SQL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3002\
SQL \u306e\u30af\u30a8\u30ea\u30b9\u30c8\u30ea\u30f3\u30b0\u306b\u5bfe\u3057\u3066\u30e6\u30fc\u30b6\u30fc\u540d\u306e\u307f\u304c\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u3088\u308a\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002\u691c\u7d22\u7d50\u679c\u306f\u3001 \u30e6\u30fc\u30b6\u30fc\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30ab\u30e9\u30e0\u306e\u307f\u306e\u5358\u4e00\u884c\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
a108=\u30d1\u30b9\u30ef\u30fc\u30c9\u69cb\u6587\u3092\u5909\u63db\u3059\u308b\u305f\u3081\u306e\u30af\u30e9\u30b9
a108.help=\u3053\u306e\u30af\u30e9\u30b9\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304b\u3089\u53d6\u5f97\u3057\u305f\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u5909\u63db\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
a108.help.txt=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5b9f\u88c5\u306f\u3001\u5909\u63db\u3092\u5b9f\u884c\u3057\u306a\u3044 <code>ClearTextTransform</code> \u3067\u3059\u3002\
\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304b\u3089\u53d6\u5f97\u3057\u305f\u30d1\u30b9\u30ef\u30fc\u30c9\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u3001\u6307\u5b9a\u3057\u305f\u30af\u30ec\u30c7\u30f3\u30b7\u30e3\u30eb\u3092\u4f7f\u7528\u3057\u3066\u6bd4\u8f03\u3059\u308b\u524d\u306b\u3001\u5909\u63db\u304c\u5fc5\u8981\u306a\u5834\u5408; \
\u30ab\u30b9\u30bf\u30e0\u5b9f\u88c5\u3092\u63d0\u4f9b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30ab\u30b9\u30bf\u30e0\u5b9f\u88c5\u3067\u306f\u3001\u6b21\u306e\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\
<code>com.sun.identity.authentication.modules.jdbc.JDBCPasswordSyntaxTransform</code>
a109=\u8a8d\u8a3c\u30ec\u30d9\u30eb
a109.help=\u3053\u306e\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u3067\u8a8d\u8a3c\u6210\u529f\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3067\u3059\u3002
a109.help.txt=\u5404\u8a8d\u8a3c\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30ec\u30d9\u30eb\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8a8d\u8a3c\u30ec\u30d9\u30eb\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\
0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u304c\u6700\u4f4e\u3067\u3059\u3002

noCONNECTIONTYPE=\u63a5\u7d9a\u30bf\u30a4\u30d7\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
noJNDINAME=JNDI \u540d\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
noDRIVER=JDBC \u30c9\u30e9\u30a4\u30d0\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noURL=JDBC URL \u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noDBUSER=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u8a8d\u8a3c\u306b\u5fc5\u8981\u306a\u30e6\u30fc\u30b6\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noDBPASSWORD=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u8a8d\u8a3c\u306b\u5fc5\u8981\u306a\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noPASSWORDCOLUMN=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u30ab\u30e9\u30e0\u540d\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noTRANSFORM=\u30d1\u30b9\u30ef\u30fc\u30c9\u69cb\u6587\u3092\u5909\u63db\u3059\u308b\u30af\u30e9\u30b9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noSTATEMENT=SQL \u30af\u30a8\u30ea\u30fc\u306b\u6e96\u5099\u3055\u308c\u305f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
noUserName=\u30e6\u30fc\u30b6\u30fc ID \u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
invalidState=JDBC \u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u5bfe\u3057\u3066\u6709\u52b9\u306a\u72b6\u614b\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
loginFailed=\u30e6\u30fc\u30b6\u30fc\u306e\u8a3c\u660e\u60c5\u5831\u304c\u7121\u52b9\u3067\u3059\u3002
choiceJNDI=JNDI \u304b\u3089\u53d6\u5f97\u3055\u308c\u305f\u63a5\u7d9a\u30d7\u30fc\u30eb
choiceURL=\u975e\u6301\u7d9a JDBC \u63a5\u7d9a
userNameTooLong=\u6307\u5b9a\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc\u540d\u304c\u6700\u5927\u6587\u5b57\u6570\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
nullResult=\u6e96\u5099\u3055\u308c\u305f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u691c\u7d22\u7d50\u679c\u304c null \u3067\u3059\u3002
multiEntry=\u8907\u6570\u306e\u30e6\u30fc\u30b6\u30fc\u30a8\u30f3\u30c8\u30ea\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
