#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amSession_es.properties,v 1.11 2009/12/26 03:55:09 cbasha Exp $
#

# Portions Copyrighted 2012 ForgeRock Inc
# Portions Copyrighted 2012 Open Source Solution Technology Corporation

onlinehelp.doc=session.html
unexpectedResponse=Se ha recibido un n\u00famero de respuestas inesperado.
unexpectedSession=Se ha recibido un n\u00famero de sesiones inesperado.
invalidSessionID=ID sesi\u00f3n no v\u00e1lida.
invalidSessionState=Estado de sesi\u00f3n no v\u00e1lido.
protectedPropertyNoClientToken=No se puede configurar la propiedad protegida sin el token de identificaci\u00f3n del cliente.
protectedPropertyNoSSOTokenMgrInstance=La instancia SSOTokenManager no puede validar el token del cliente.
protectedPropertyInvalidClientToken=No se puede definir la propiedad protegida ya que el token del cliente no es v\u00e1lido.
protectedPropertyNoAdminToken=No se puede recuperar el token de administrador que validar con respecto al token del cliente.
protectedPropertyNoPermission=El cliente no tiene permiso para establecer la propiedad protegida. Solicitud de actualizaci\u00f3n de sesi\u00f3n rechazada.
unexpectedEOF=Fin de archivo inesperado.
readRandomDeviceFailed=Fallo de lectura del dispositivo aleatorio.
noPrivilege=No se concede privilegio para realizar la operaci\u00f3n.
sessionNotObtained=No se obtuvo la sesi\u00f3n.
unknownRequestMethod=M\u00e9todo de solicitud desconocido.
iplanet-am-session-service-description=Sesi\u00f3n
sessionTimedOut=Finaliz\u00f3 el tiempo de sesi\u00f3n.
sessionNotTimedOut=No se ha agotado el tiempo de espera de la sesi\u00f3n.
propertyMustBeSet=Las propiedades com.iplanet.am.localserver.{protocolo,host,puerto} deben definirse en modo de conmutaci\u00f3n por error.
restrictionViolation=Intento ilegal de utilizar un token restringido.
appTokenInvalid=El token de aplicaci\u00f3n facilitado no es v\u00e1lido.
emptyTrustedSourceList=No se ha encontrado ninguna entrada en la lista de fuentes de confianza o en la lista de servidores de plataformas.
unsupportedFunction=No se admite la funci\u00f3n.
SessionTableNotFound=La tabla de sesi\u00f3n no existe en el almac\u00e9n de sesiones.
getValidSessionsError=No se pudieron obtener las sesiones v\u00e1lidas del servidor especificado.
a101=Tiempo por sesi\u00f3n m\u00e1ximo
a101.help=En minutos.
a102=Tiempo inactivo m\u00e1ximo
a102.help=En minutos.
a103=Tiempo en cach\u00e9 m\u00e1ximo
a103.help=En minutos.
a104=Estado del servicio de sesi\u00f3n
a105=N\u00famero m\u00e1ximo de resultados de b\u00fasqueda
a105.help=No establezca un valor muy grande (superior a 1000) para este atributo, salvo que se asignen recursos suficientes del sistema.
a106=Tiempo de espera para la b\u00fasqueda
a106.help=En segundos.
a107=Recuperaci\u00f3n ante fallos de la sesi\u00f3n
a108=Usuario del almac\u00e9n de la sesi\u00f3n
a109=Contrase\u00f1a del almac\u00e9n de la sesi\u00f3n
a110=Lista de servidores del cl\u00faster de la sesi\u00f3n
a111=Tiempo m\u00e1ximo de espera
a111.help=Lectura de tiempo de espera para la recuperaci\u00f3n de la sesi\u00f3n (en milisegundos).
a112=Nombre de clases de implementaci\u00f3n del controlador JDBC
a113=URL de la LDAP
a114=Tama\u00f1o de conjunto m\u00ednimo
a115=Tama\u00f1o de conjunto m\u00e1ximo
a116=Habilitar notificaciones de cambio de propiedades
a117=Habilitar restricciones de cuotas
a118=Activar sesiones de usuario
a118.help=N\u00famero m\u00e1ximo de sesiones simult\u00e1neas permitidas para un usuario.
a119=Lectura de tiempo de espera para la restricci\u00f3n de cuotas
a119.help=Tiempo de espera m\u00e1ximo para la recuperaci\u00f3n de la cuenta de sesi\u00f3n (en milisegundos).
a119b=Comportamiento resultante si se agota la cuota de sesiones
a119b.help=DENY_ACCESS (la nueva solicitud de creaci\u00f3n de sesi\u00f3n ser\u00e1 denegada)<br/>DESTROY_NEXT_EXPIRING (la siguiente sesi\u00f3n que caduque ser\u00e1 destruida)<br/>DESTROY_OLDEST_SESSION (la sesi\u00f3n mas antigua ser\u00e1 destruida)<br/>DESTROY_OLD_SESSIONS (todas las sesiones previas ser\u00e1n destruidas)
a119c=Denegar el inicio de sesi\u00f3n del usuario cuando el dep\u00f3sito de sesiones est\u00e9 inactivo
a119c.help=Este atributo s\u00f3lo se aplicar\u00e1 si se habilita la restricci\u00f3n de cuota de sesi\u00f3n.
a120=Propiedades de notificaci\u00f3n
a120.help=Enviar notificaciones cuando se modifiquen estas propiedades.
a121=Conmutaci\u00f3n por error de sesi\u00f3n habilitada
a121b=S\u00f3lo restricci\u00f3n de DN habilitada
a121b.help=Este atributo controla si el servidor realizar\u00e1 una comprobaci\u00f3n de DN estricta al aceptar una direcci\u00f3n IP de un cliente mientras configura la restricci\u00f3n en el modo de mitigaci\u00f3n de apropiaci\u00f3n de cookies.
a122=Habilitar recorte de sesi\u00f3n
a124=Session Persistence and High Availability Failover Enabled
a124.help=Enabling provides full Session persistence and when coupled with a clustered environment provides Session High availability Failover as well.
a125=LDAP URL
a125.help=Specify LDAP URL for distinct Session Failover Persistence. If using Embedded OpenDJ or External Configuration Store for Session Persistence, leave this field blank.
a126=LDAP Root DN
a126.help=Root Container DN to contain Session Objects on external Store.
a127=LDAP User DN
a128=LDAP User Password
a129=Minimum Pool Size
a130=Maximum Pool Size
a131=Maximum Connection Wait Time
a131.help=Read Timeout for retrieving the session (in milliseconds).
p101=Obtener todas las sesiones v\u00e1lidas
p102=Destruir una sesi\u00f3n
p103=A\u00f1adir un proceso de escucha de sesi\u00f3n en todas las sesiones

choiceActive=Activo
choiceInactive=Inactivo
choiceDeleted=Suprimido
choiceON=ACTIVADO
choiceOFF=DESACTIVADO
choiceYES=S\u00cd
choiceNO=NO
choiceDenyAccess=DENY_ACCESS
choiceDestroyNextExpiring=DESTROY_NEXT_EXPIRING
choiceDestroyOldSession=DESTROY_OLDEST_SESSION
choiceDestroyAll=DESTROY_OLD_SESSIONS
i18nTrue=Habilitado
i18nFalse=Inhabilitado
