#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2007 Sun Microsystems Inc. All Rights Reserved
#
# The contents of this file are subject to the terms
# of the Common Development and Distribution License
# (the License). You may not use this file except in
# compliance with the License.
#
# You can obtain a copy of the License at
# https://opensso.dev.java.net/public/CDDLv1.0.html or
# opensso/legal/CDDLv1.0.txt
# See the License for the specific language governing
# permission and limitations under the License.
#
# When distributing Covered Code, include this CDDL
# Header Notice in each file and include the License file
# at opensso/legal/CDDLv1.0.txt.
# If applicable, add the following below the CDDL Header,
# with the fields enclosed by brackets [] replaced by
# your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
#
# $Id: amLogging_ja.properties,v 1.11 2009/12/26 03:51:45 cbasha Exp $
#

# Portions Copyrighted 2012 ForgeRock Inc
# Portions Copyrighted 2012 Open Source Solution Technology Corporation

amverifyarchive-usage=\u4f7f\u7528\u6cd5: amverifyarchive -l <logName> -p <path> -u <uname> -w <password>
onlinehelp.doc=logging.html
invalidSession=invalidSession
alreadyExists=alreadyExists
notFound=notFound
inactive=\u7121\u52b9
fileHandlerError=fileHandlerError
platformError=\u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f
writeError=writeError
readError=readError
readSegmentError=readSegmentError
deleteError=deleteError
listNotExists=listNotExists
typeError=typeError
createAccessDenied=createAccessDenied
writeAccessDenied=writeAccessDenied
readAccessDenied=readAccessDenied
listAccessDenied=listAccessDenied
profileError=profileError
noSuchLogExists=noSuchLogExists
noSuchSegmentExists=noSuchSegmentExists
deleteAccessDenied=deleteAccessDenied
invalidLogOrSegName=invalidLogOrSegmentName
readExceedsMax=readExceedsMax
fatalError=fatalError
invalidLogName=invalidLogName
driverLoadFailed=driverLoadFailed
nullLocation=nullLocation
connectionFailed=connectionFailed
logHandlerError=logHandlerError
sqlError=SQLError
nullPointer=nullPointer
unableToLoadDriver=\u30ed\u30b0\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u3092\u8aad\u307f\u8fbc\u3081\u307e\u305b\u3093\u3002
iplanet-am-logging-service-description=\u30ed\u30b0
verificationOfLogArchiveFor=\u30ed\u30b0\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u691c\u8a3c
archiveVerificationPassed= \u53d7\u3051\u6e21\u3057\u306b\u6210\u529f\u3057\u307e\u3057\u305f\u3002
archiveVerificationFailed= \u5931\u6557\u3057\u307e\u3057\u305f\u3002\u4e0d\u6b63\u4fb5\u5165\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
archiveVerification=\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u691c\u8a3c : 
noFilesToVerify=\u691c\u8a3c\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u304c\u3042\u308a\u307e\u305b\u3093
fileBeingVerified=\u30d5\u30a1\u30a4\u30eb\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059 : 
recordVerificationPassed=\u30d5\u30a1\u30a4\u30eb\u306e\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u306e\u691c\u8a3c\u306b\u6210\u529f\u3057\u307e\u3057\u305f : 
recordVerificationFailed=\u30d5\u30a1\u30a4\u30eb\u306e\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u306e\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f : 
signatureVerificationPassed=\u7f72\u540d\u691c\u8a3c\u3092\u30d5\u30a1\u30a4\u30eb\u306b\u6e21\u3057\u307e\u3057\u305f :
signatureVerificationFailed=\u30d5\u30a1\u30a4\u30eb\u3067\u7f72\u540d\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f :
emptyReturn=\u8aad\u307f\u53d6\u308a\u304b\u3089\u7a7a\u306e\u5024\u304c\u8fd4\u3055\u308c\u307e\u3057\u305f 
atRecordNumber=\u30ec\u30b3\u30fc\u30c9\u756a\u53f7 : 
a101=\u30ed\u30b0\u72b6\u614b
a102=\u6700\u5927\u30ed\u30b0\u30b5\u30a4\u30ba
a102.help=\u30d5\u30a1\u30a4\u30eb\u30b5\u30a4\u30ba(\u30d0\u30a4\u30c8)\u3002
a103=\u5c65\u6b74\u30d5\u30a1\u30a4\u30eb\u306e\u6570
a103.help=\u524a\u9664\u3055\u308c\u308b\u524d\u306b\u4fdd\u6301\u3055\u308c\u308b\u5404\u30ed\u30b0\u306e\u5c65\u6b74\u30d5\u30a1\u30a4\u30eb\u306e\u6570\u3002
a104=\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u5834\u6240
a104.help=\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u3002
a104.help.txt=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u5834\u6240\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002\u30d7\u30ed\u30d1\u30c6\u30a3\u5024\u306f\u3001\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f DB \u30ed\u30ae\u30f3\u30b0\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u306b\u3088\u3063\u3066\u7570\u306a\u308a\u307e\u3059\u3002\
<ul><li>\u30d5\u30a1\u30a4\u30eb: \u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u542b\u3080\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3078\u306e\u30d5\u30eb\u30d1\u30b9\u540d</li>\
<li>DB: \u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u683c\u7d0d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e JDBC URL</li></ul>
a1041=\u30ed\u30b0\u72b6\u614b
a1041.help=OpenAM \u30ed\u30ae\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u3092\u6709\u52b9/\u7121\u52b9\u306b\u3057\u307e\u3059\u3002
a1042=\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u3067\u30db\u30b9\u30c8\u540d\u3092\u89e3\u6c7a\u3059\u308b
a1042.help=DNS \u30db\u30b9\u30c8\u30eb\u30c3\u30af\u30a2\u30c3\u30d7\u3092\u6709\u52b9\u306b\u3057\u305f\u3068\u304d\u3001 LogRecord \u306e Hostname \u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u30db\u30b9\u30c8\u540d\u306b\u306a\u308a\u307e\u3059\u3002
a1042.help.txt=<i>\u6ce8\u610f </i>\u3053\u306e\u6a5f\u80fd\u3092\u6709\u52b9\u306b\u3059\u308b\u3068\u3001\u30ed\u30ae\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u306e\u8ca0\u8377\u304c\u5897\u52a0\u3057\u307e\u3059\u3002\
\u307e\u305f OpenAM \u30db\u30b9\u30c8\u306f DNS \u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a105=\u30ed\u30b0\u30bf\u30a4\u30d7
a105.help=OpenAM \u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u6c7a\u5b9a\u3057\u307e\u3059\u3002
a105.help.txt=OpenAM \u306f\u3001\u30d5\u30a1\u30a4\u30eb\u30b7\u30b9\u30c6\u30e0(\u30c7\u30d5\u30a9\u30eb\u30c8)\u307e\u305f\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u30ed\u30b0\u51fa\u529b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\
\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u5fc5\u8981\u306a JDBC \u30c9\u30e9\u30a4\u30d0\u3092 OpenAM \u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a105.help.uri=#tbd
a106=\u8aad\u307f\u53d6\u3089\u308c\u305f\u30ed\u30b0\u306e\u30b5\u30a4\u30ba
a107=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30e6\u30fc\u30b6\u30fc\u540d
a107.help=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u8a8d\u8a3c\u306b\u4f7f\u7528\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u540d\u3002
a108=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30e6\u30fc\u30b6\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9
a108.help=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u8a8d\u8a3c\u306b\u4f7f\u7528\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
a109=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u540d
a109.help=JDBC \u30c9\u30e9\u30a4\u30d0\u306e\u30af\u30e9\u30b9\u540d\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u63a5\u7d9a\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002
a109.help.txt=OpenAM \u306f Oracle \u3068 MySQL \u306e JDBC \u30c9\u30e9\u30a4\u30d0\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059\u3002\u4ed6\u306e JDBC \u30c9\u30e9\u30a4\u30d0\u306f\u52d5\u4f5c\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u304c\u3001 \
OpenAM \u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c Oracle \u3067\u3042\u308b\u5834\u5408\u3068\u540c\u69d8\u306b\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u6271\u3044\u307e\u3059\u3002
a110=\u30ed\u30b0\u540d\u306e\u30ea\u30b9\u30c8
a111=\u8a2d\u5b9a\u53ef\u80fd\u306a\u30ed\u30b0\u30d5\u30a3\u30fc\u30eb\u30c9
a111.help=OpenAM \u306b\u3088\u3063\u3066\u8a18\u9332\u3055\u308c\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a111.help.txt=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u30ed\u30b0\u306b\u8a18\u9332\u3059\u308b\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u30ea\u30b9\u30c8\u3067\u3059\u3002\
\u7ba1\u7406\u8005\u306f OpenAM \u306b\u3088\u3063\u3066\u8a18\u9332\u3055\u308c\u308b\u60c5\u5831\u3092\u5236\u9650\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
a111.help.uri=#tbd
a114=\u30ed\u30b0\u691c\u8a3c\u983b\u5ea6
a114.help=OpenAM \u304c\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3092\u691c\u8a3c\u3059\u308b\u9593\u9694(\u79d2\u5358\u4f4d)\u3002
a114.help.txt=\u300c\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3067\u4fdd\u8b77\u3055\u308c\u305f\u30ed\u30ae\u30f3\u30b0\u300d\u304c\u6709\u52b9\u306a\u5834\u5408\u306e\u3001 OpenAM \u304c\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u6574\u5408\u6027\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u9593\u9694\u3067\u3059\u3002
a115=\u30ed\u30b0\u7f72\u540d\u6642\u9593
a115.help=OpenAM \u304c\u30c7\u30b8\u30bf\u30eb\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u306b\u7f72\u540d\u3059\u308b\u983b\u5ea6(\u79d2\u5358\u4f4d)\u3002
a115.help.txt=\u300c\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3067\u4fdd\u8b77\u3055\u308c\u305f\u30ed\u30ae\u30f3\u30b0\u300d\u304c\u6709\u52b9\u306a\u5834\u5408\u306e\u3001 OpenAM \u304c\u30c7\u30b8\u30bf\u30eb\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u5185\u5bb9\u306b\u7f72\u540d\u3059\u308b\u9593\u9694\u3067\u3059\u3002\
\u30ed\u30b0\u306e\u7f72\u540d\u306f\u3001\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u6574\u5408\u6027\u30c1\u30a7\u30c3\u30af\u306e\u57fa\u790e\u3092\u5f62\u6210\u3057\u307e\u3059\u3002
a116=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4fdd\u8b77\u3055\u308c\u305f\u30ed\u30b0 
a116.help=\u30bb\u30ad\u30e5\u30a2\u30ed\u30ae\u30f3\u30b0\u3092\u6709\u52b9\u307e\u305f\u306f\u7121\u52b9\u306b\u3057\u307e\u3059\u3002
a116.help.txt=\u3053\u306e\u8a2d\u5b9a\u3092\u6709\u52b9\u306b\u3059\u308b\u3068\u3001 OpenAM \u306f\u3001\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u6539\u3056\u3093\u3092\u9632\u6b62\u30fb\u691c\u51fa\u3059\u308b\u305f\u3081\u306b\u3001\u30ed\u30b0\u00b7\u30d5\u30a1\u30a4\u30eb\u306e\u5185\u5bb9\u3092\u30c7\u30b8\u30bf\u30eb\u7f72\u540d\u3001\u691c\u8a3c\u3059\u308b\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002\
\u3053\u306e\u6a5f\u80fd\u3092\u6709\u52b9\u306b\u3059\u308b\u306b\u306f\u3001\u8a3c\u660e\u66f8\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
a1161=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4fdd\u8b77\u3055\u308c\u305f\u30ed\u30b0\u306e\u7f72\u540d\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 
a1161.help=\u30c7\u30b8\u30bf\u30eb\u30ed\u30b0\u00b7\u30ec\u30b3\u30fc\u30c9\u3092\u7f72\u540d\u3059\u308b\u306e\u306b\u4f7f\u7528\u3055\u308c\u308b\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u6c7a\u5b9a\u3057\u307e\u3059\u3002
a1162=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u30ed\u30b0\u306e\u5834\u6240
a1162.help=\u30ed\u30ae\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u8a3c\u660e\u66f8\u3092\u542b\u3080 Java \u30ad\u30fc\u30b9\u30c8\u30a2\u3078\u306e\u30d1\u30b9\u3002
a1162.help.txt=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3067\u4fdd\u8b77\u3055\u308c\u305f\u30ed\u30ae\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u306f\u3001\
\u6307\u5b9a\u3055\u308c\u305f\u30ad\u30fc\u30b9\u30c8\u30a2\u3067\u8a3c\u660e\u66f8\u3092\u898b\u3064\u3051\u308b\u305f\u3081\u306b <code>Logger</code> \u306e\u8a3c\u660e\u66f8\u30a8\u30a4\u30ea\u30a2\u30b9\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
a117=\u30ec\u30b3\u30fc\u30c9\u306e\u6700\u5927\u6570
a117.help=\u30ed\u30ae\u30f3\u30b0 API \u3092\u4ecb\u3057\u3066\u30ed\u30b0\u304b\u3089\u8aad\u307f\u53d6\u3089\u308c\u305f\u30ec\u30b3\u30fc\u30c9\u306e\u6700\u5927\u6570\u3002
a118=\u30a2\u30fc\u30ab\u30a4\u30d6\u3042\u305f\u308a\u306e\u30d5\u30a1\u30a4\u30eb\u6570
a118.help=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u3067\u4fdd\u8b77\u3055\u308c\u305f\u30ed\u30ae\u30f3\u30b0\u30b7\u30b9\u30c6\u30e0\u306b\u3088\u3063\u3066\u30a2\u30fc\u30ab\u30a4\u30d6\u3055\u308c\u308b\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u6570\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
a119=\u30d0\u30c3\u30d5\u30a1\u30fc\u30b5\u30a4\u30ba
a119.help=\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u304c\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u30d5\u30e9\u30c3\u30b7\u30e5\u3055\u308c\u308b\u524d\u306b\u3001\u30e1\u30e2\u30ea\u5185\u306b\u4fdd\u6301\u3055\u308c\u308b\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u306e\u6570\u3002
a1191=DB \u5931\u6557\u30e1\u30e2\u30ea\u30d0\u30c3\u30d5\u30a1\u30fc\u30b5\u30a4\u30ba
a1191.help=DB \u30ed\u30b0\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u306b\u30e1\u30e2\u30ea\u306b\u4fdd\u6301\u3055\u308c\u308b\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u306e\u6700\u5927\u6570\u3002
a1191.help.txt=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u5229\u7528\u3067\u304d\u306a\u3044\u5834\u5408\u306b\u3001\u30e1\u30e2\u30ea\u5185\u306b\u4fdd\u6301\u3055\u308c\u308b\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u306e\u6700\u5927\u6570\u3067\u3059\u3002\
\u30d0\u30c3\u30d5\u30a1\u30fc\u304c\u3044\u3063\u3071\u3044\u306b\u306a\u3063\u305f\u3068\u304d\u306b\u3001\u65b0\u3057\u3044\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u306b\u3088\u308a\u30d0\u30c3\u30d5\u30a1\u30fc\u5185\u306e\u6700\u3082\u53e4\u3044\u30ec\u30b3\u30fc\u30c9\u304c\u30af\u30ea\u30a2\u3055\u308c\u307e\u3059\u3002\
OpenAM \u76e3\u8996\u6a5f\u80fd\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u304c\u5229\u7528\u3067\u304d\u306a\u304b\u3063\u305f\u3068\u304d\u306b\u6d88\u53bb\u3055\u308c\u305f\u30ed\u30b0\u30a8\u30f3\u30c8\u30ea\u306e\u6570\u3092\u8a18\u9332\u3057\u307e\u3059\u3002<br/><br/>\
\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u306e\u5024\u304c\u30d0\u30c3\u30d5\u30a1\u30fc\u30b5\u30a4\u30ba\u3088\u308a\u3082\u5c0f\u3055\u3044\u5834\u5408\u3001<i>\u30d0\u30c3\u30d5\u30a1\u30fc\u30b5\u30a4\u30ba</i>\u306e\u5024\u304c\u512a\u5148\u3055\u308c\u307e\u3059\u3002
a120=\u30d0\u30c3\u30d5\u30a1\u30fc\u6642\u9593
a120.help=OpenAM \u304c\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30d5\u30e9\u30c3\u30b7\u30e5\u3059\u308b\u524d\u306b\u30e1\u30e2\u30ea\u306b\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u3092\u4fdd\u6301\u3059\u308b\u6700\u5927\u6642\u9593(\u79d2\u5358\u4f4d)\u3002
a121=\u6642\u9593\u30d0\u30c3\u30d5\u30a1\u30ea\u30f3\u30b0
a121.help=\u30ed\u30b0\u306e\u30d0\u30c3\u30d5\u30a1\u30ea\u30f3\u30b0\u3092\u6709\u52b9\u307e\u305f\u306f\u7121\u52b9\u306b\u3057\u307e\u3059\u3002
a121.help.txt=\u6709\u52b9\u306b\u3059\u308b\u3068\u3001 OpenAM \u306f\u5b9a\u671f\u7684\u306b\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30d5\u30e9\u30c3\u30b7\u30e5\u3059\u308b\u30e1\u30e2\u30ea\u30d0\u30c3\u30d5\u30a1\u30fc\u5185\u306e\u3059\u3079\u3066\u306e\u30ed\u30b0\u30ec\u30b3\u30fc\u30c9\u3092\u4fdd\u6301\u3057\u307e\u3059\u3002\
\u671f\u9593\u306f\u3001<i>\u30d0\u30c3\u30d5\u30a1\u30fc\u6642\u9593</i>\u30d7\u30ed\u30d1\u30c6\u30a3\u3067\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
a1031=\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ec\u30d5\u30a3\u30c3\u30af\u30b9
a1031.help=\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d\u306b\u6307\u5b9a\u3055\u308c\u305f\u5024\u304c\u30d7\u30ec\u30d5\u30a3\u30c3\u30af\u30b9\u3068\u3057\u3066\u4ed8\u304f\u3053\u3068\u306b\u306a\u308a\u307e\u3059\u3002
a1031.help.txt=\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3001\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u30d7\u30ec\u30d5\u30a3\u30c3\u30af\u30b9\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\
\u30d7\u30ec\u30d5\u30a3\u30c3\u30af\u30b9\u306f\u3059\u3079\u3066\u306e\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002<br/><br/>\
<i>\u6ce8\u610f </i>\u6642\u9593\u30d9\u30fc\u30b9\u306e\u30ed\u30b0\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306b\u306e\u307f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a1032=\u30ed\u30b0\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u30b5\u30d5\u30a3\u30c3\u30af\u30b9
a1032.help=\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d\u306b\u6307\u5b9a\u3055\u308c\u305f\u5024\u304c\u4ed8\u52a0\u3055\u308c\u307e\u3059\u3002
a1032.help.txt=\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3001\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u6b21\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u306e\u5f62\u5f0f\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\
<code>-MM.DD.YY-kk.mm</code>\u3002\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u306b\u3088\u308a\u3001\u65e5\u4ed8\u3068\u6642\u523b\u306e\u30d1\u30bf\u30fc\u30f3\u306e\u4f7f\u7528\u3092 \
<a href="http://download.oracle.com/javase/6/docs/api/java/text/SimpleDateFormat.html"><code>SimpleDateFormat</code></a> \u4e0a\u3067\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 \
<i>\u6ce8\u610f </i>\u6642\u9593\u30d9\u30fc\u30b9\u306e\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u304c\u6709\u52b9\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
a1033=\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u306e\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u9593\u9694
a1033.help=\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u9593\u9694\uff08\u5206\u5358\u4f4d\uff09\u3002
a1033.help.txt=\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u9593\u9694\u306f\u3001\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u304c\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u308b\u983b\u5ea6\u3092\u6c7a\u5b9a\u3057\u307e\u3059\u3002\
\u5024\u304c-1\u306e\u5834\u5408\u3001\u6642\u9593\u30d9\u30fc\u30b9\u306e\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u3068\u306a\u308a\u3001\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u30b5\u30a4\u30ba\u30d9\u30fc\u30b9\u306e\u30ed\u30fc\u30c6\u30fc\u30b7\u30e7\u30f3\u304c\u6709\u52b9\u306b\u306a\u308a\u307e\u3059\u3002
a130=\u30ed\u30b0\u30ec\u30d9\u30eb
a130.help=OpenAM \u5185\u306e JDK \u30ed\u30ae\u30f3\u30b0\u306e\u30ec\u30d9\u30eb\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
choiceFile=\u30d5\u30a1\u30a4\u30eb
choiceJDBC=JDBC
choiceON=\u30aa\u30f3
choiceOFF=\u30aa\u30d5
choiceDB=DB
choiceTIME=TIME
choiceDOM=DOMAIN
choiceLOGINID=LOGINID
choiceTYPE=TYPE
choiceDATA=DATA
choiceIPADDR=IPADDR
choiceHOSTNAME=HOSTNAME
choiceLOGLEVEL=LOGLEVEL
choiceLOGGEDBY=LOGGEDBY
choiceMODULENAME=MODULENAME
choiceCONTEXTID=CONTEXTID
choiceMESSAGEID=MESSAGEID
choiceNAMEID=NAMEID
choiceMD2withRSA=RSA \u3092\u4f7f\u7528\u3057\u305f MD2
choiceMD5withRSA=RSA \u3092\u4f7f\u7528\u3057\u305f MD5
choiceSHA1withDSA=DSA \u3092\u4f7f\u7528\u3057\u305f SHA1
choiceSHA1withRSA=RSA \u3092\u4f7f\u7528\u3057\u305f SHA1
choiceLOGSEVERE=SEVERE
choiceLOGWARNING=WARNING
choiceLOGINFO=INFO
choiceLOGCONFIG=CONFIG
choiceLOGFINE=FINE
choiceLOGFINER=FINER
choiceLOGFINEST=FINEST
choiceLOGOFF=\u30aa\u30d5
choiceACTIVE=\u30a2\u30af\u30c6\u30a3\u30d6
choiceINACTIVE=\u975e\u30a2\u30af\u30c6\u30a3\u30d6
i18nYes=\u306f\u3044
i18nNo=\u3044\u3044\u3048
